{"id":15773,"date":"2021-07-29T22:00:00","date_gmt":"2021-07-29T22:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/natixis-customer-centric-multi-brand-deployment\/"},"modified":"2023-09-15T13:25:40","modified_gmt":"2023-09-15T12:25:40","slug":"natixis-customer-centric-multi-brand-deployment","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/","title":{"rendered":"How to become customer-centric: Natixis&#039; method for multi-brand"},"content":{"rendered":"<p>Natixis is made up of several entities. What do they all have in common? A growth strategy centred around the customer relationship. So, Natixis rose to the challenge and <a href=\"https:\/\/skeepers.io\/en\/blog\/customer-centric-definition-benefits\/\" target=\"_blank\" rel=\"noopener\">became a customer-centric company<\/a>!<\/p>\n<p>But how do you deploy a customer-centric strategy and culture in a company made up of several entities with different organisations, ecosystems, challenges and goals?<\/p>\n<p>In our last webinar, we were delighted to welcome Chi-Hoa LAM, Head of IT &amp; Digital Marketing Projects at <a href=\"https:\/\/www.natixis.com\/natixis\/en\/home-j_6.html\" target=\"_blank\" rel=\"noopener\">Natixis<\/a> and Angeline BELOU, Product Manager at Natixis Payments.<\/p>\n<p>They looked back in detail at the challenges they faced when implementing their customer satisfaction management system with MyFeelBack.<\/p>\n<h2>Implementing a Customer Satisfaction Management System at Natixis: Strategic Context and Organisational Framework<\/h2>\n<p>Chi-Hoa LAM, Head of IT &amp; Digital Marketing Projects at Natixis, led the project to deploy a customer satisfaction strategy in the various Natixis entities. He spoke to us about this project, which began in 2018.<\/p>\n<h3>&#8220;Natixis decided to make customer satisfaction a strategic pillar&#8221;<\/h3>\n<p>Natixis decided to place customer satisfaction at the heart of its customer relations strategy. This is part of Natixis’ broader digital performance management objective.<\/p>\n<p>The company decided to rely mainly on one indicator at a global level: <a href=\"https:\/\/skeepers.io\/en\/blog\/complete-guide-net-promoter-score-nps\/\" target=\"_blank\" rel=\"noopener\">NPS<\/a>. This is understandable given the challenges of deploying an indicator in a decentralised organisation.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 244px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/nps-score-calculation.png\" alt=\"NPS survey\" \/><\/p>\n<h3>A Digital Office Led Project<\/h3>\n<p>How is Natixis organised? As we mentioned above, Natixis is made up of several entities, or “divisions”:<\/p>\n<ul>\n<li>A Savings division<\/li>\n<li>A Payments division<\/li>\n<li>An Insurance division<\/li>\n<li>A Retail Banking division<\/li>\n<li>A Support Functions division<\/li>\n<\/ul>\n<p>Each division is made up of several business units – each business unit corresponds to a business line.<\/p>\n<p>The Support Functions division includes a &#8220;Technology &amp; Transformation&#8221; business unit, which in turn includes a &#8220;Digital Office&#8221; entity. This is a cross-functional department whose role is to support all Natixis businesses in their data and digital projects. The Digital Marketing team, which is part of the Digital Office in which Chi-Hoa LAM works, has 3 missions:<\/p>\n<ol>\n<li>Implementing Natixis’ Digital Marketing ecosystem.<\/li>\n<li>Supporting &amp; challenging business lines in the deployment of their Digital Marketing projects.<\/li>\n<li>Driving the community and increasing employee Digital Marketing skills (via training, expertise and support).<\/li>\n<\/ol>\n<p>Each team member has a specific expertise in Digital Marketing: web analytics, customer satisfaction, SEO, Data Quality, etc. The team works transversally with all Natixis’ entities. Each BU is also assigned a Digital Marketing Customer Success Manager (CSM), who serves as a single point of entry for any Digital Marketing issues. The CSM asks their colleagues for help on issues for which they don’t have the expertise.<\/p>\n<p>It’s worth noting that the Digital Marketing team applies the same system to itself as to business lines. After each service provided by the DM team, a survey is automatically sent in order to monitor BU satisfaction and to work on potential areas for improvement.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 298px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/natixis-customer-centric-marketing.jpg\" alt=\"natixis customer centric\" \/><\/p>\n<p>It is within this organisation framework that the MyFeelBack solution was deployed at Natixis.<\/p>\n<h2>MyFeelBack Deployment Within Natixis<\/h2>\n<p>Natixis chose the MyFeelBack solution to implement its customer satisfaction management system. Some of Natixis’ BUs decided to deploy the satisfaction survey tool, to improve their customer experience.<\/p>\n<h3>Management at a Global Level (via a parent account), Paired with Management at Business Line Level (via child accounts)<\/h3>\n<p>The measurement of customer satisfaction is managed by:<\/p>\n<ul>\n<li>A MyFeelBack parent account that allows to consolidate and monitor customer feedback at a global level. This parent account is administered by the Digital Marketing team.<\/li>\n<li>Child accounts at individual BU levels. These child accounts are managed by the business teams.<\/li>\n<\/ul>\n<p>The information collected via the child accounts are then automatically fed into the parent account. This system:<\/p>\n<ul>\n<li>Facilitates the calculation of a global NPS score, by consolidating the NPS calculated at each BU child account level. More broadly, this makes it easier to consolidate MyFeelBack information at a global level.<\/li>\n<li>Provides business teams with greater autonomy to manage their customer satisfaction projects. A MyFeelBack Customer Success Manager and a Natixis Digital Marketing CSM helps each BU manage its child account.<\/li>\n<\/ul>\n<h3>The Challenge: Harmonising MyFeelBack Surveys<\/h3>\n<p>Consolidation means harmonising the surveys and systems deployed in the BUs. How does Natixis achieve this? Chi-Hoa LAM uses the example of NPS to illustrate how the company manages this challenge:<\/p>\n<ul>\n<li>MyFeelBack labels are placed on each NPS question so that the NPS information can automatically be fed back into the parent account. Chi-Hoa LAM notes the importance of clearly defining the label nomenclature to facilitate consolidation.<\/li>\n<li>All BUs word the NPS question in the same way.<\/li>\n<li>The Digital Marketing team has developed an in-house user guide to help BU employees use MyFeelBack.<\/li>\n<\/ul>\n<p>More generally, here are a few measures taken to harmonise the use of MyFeelBack within the various BUs:<\/p>\n<ul>\n<li>A User Club, implemented by the Digital Marketing team, to facilitate exchanges around the MyFeelBack solution.<\/li>\n<li>Survey and reporting designs\/templates shared among BUs.<\/li>\n<li>Reusable components shared among BUs (e.g.: configuration of a particular functionality or configuration of the Salesforce connector, etc.).<\/li>\n<\/ul>\n<h3>Natixis Continually Optimises its MyFeelBack Use<\/h3>\n<p>What are the best practices for improving the quality of surveys and the number of responses collected? Our clients often ask this question.<\/p>\n<p>As Chi-Hoa LAM explains, there are two possible answers:<\/p>\n<ul>\n<li>Some good practices are common sense and apply to all companies using MyFeelBack. For example:\n<ul>\n<li>Do not trigger a pop-up survey as soon as the user arrives on your website.<\/li>\n<li>Limit the number of questions by only asking necessary ones.<\/li>\n<li>Add a thank you page at the end of your survey.<\/li>\n<\/ul>\n<\/li>\n<li>Other good practices are the fruit of a test &amp; learn approach. Test. Analyse. Learn. Make adjustments. Optimise. This learning-by-doing approach is essential to continually improving your MyFeelBack use.<\/li>\n<\/ul>\n<h3>In 2019, Natixis Collected 160,000 Customer Feedbacks with MyFeelBack<\/h3>\n<p>Here are some key figures about the deployment of the MyFeelBack solution at Natixis:<\/p>\n<ul>\n<li>MyFeelBack is currently deployed over 9 Natixis business units.<\/li>\n<li>There are currently 70 solution users. 30 of them have been trained, which is 2 or 3 users per BU. Users are trained by the Digital Marketing team and MyFeelBack’s CSMs.<\/li>\n<li>In 2019, 160,000 customer feedbacks were collected via 55 online &amp; email survey campaigns.<\/li>\n<\/ul>\n<h2>Focus on the Deployment of MyFeelBack Surveys within Natixis Payments<\/h2>\n<p>During this webinar, we were delighted to welcome Angeline Belou, Product Manager at Natixis Payments, to present the deployment of MyFeelBack within her department. Natixis Payments offers a wide range of services, including lunch vouchers, universal employment vouchers (chèque employ-service universel) or gift cards.<\/p>\n<h3>Build a Live Customer Satisfaction Barometer<\/h3>\n<p>Natixis Payments decided to measure customer satisfaction with their Apetiz lunch vouchers.<\/p>\n<p>Their goal?<\/p>\n<ul>\n<li>To monitor customer satisfaction with their customer account page.<\/li>\n<li>To give customers a voice 24\/7.<\/li>\n<li>To collect pains and improvement suggestions.<\/li>\n<li>To visualise satisfaction in their CRM (Salesforce).<\/li>\n<li>To generate qualified leads in their CRM.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 405px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/NPS-par-mois-en.jpg\" alt=\"NPS evolution per month\" \/><\/p>\n<h3>The MyFeelBack – Salesforce Interconnection<\/h3>\n<p>From the start of the project, Natixis Payments decided to connect MyFeelBack and Salesforce to feed CSAT and NPS scores collected via MyFeelBack into their CRM. And more specially, into their customer files.<\/p>\n<p>Why? Because this information is important for the sales team and indicates a customer’s level of satisfaction while they speak on the phone.<br \/>\nThe MyFeelBack – Salesforce interconnection was carried out by the IT team in charge of the maintenance of Salesforce, with the Chief Data Office’s support. The business teams (salespeople) were also involved to qualify the users’ needs.<\/p>\n<p>By connecting these two solutions, the customer satisfaction score has become a sales activation lever for teams whose priority is customer satisfaction.<\/p>\n<h3>Focus on the Two Survey Formats Deployed on the Customer Account Page<\/h3>\n<p>Natixis Payments uses two formats:<\/p>\n<ul>\n<li>A survey that can be accessed anytime on the customer account page via a “Share your opinion” button.<\/li>\n<li>A survey triggered in the form of a pop-up after a key step on the customer journey: an order.<\/li>\n<\/ul>\n<p>These two formats are complementary:<\/p>\n<ul>\n<li>The &#8220;Share your opinion&#8221; button can be accessed at any moment on the customer journey. Customers who click on it have something to say, they want to express themselves. As a result, this survey generates less, but highly qualified, responses.<\/li>\n<li>The pop-up is a push channel that gets more responses and enables you to collect immediate feedback.<\/li>\n<\/ul>\n<p>Natixis has set up non-solicitation rules to limit marketing pressure.<\/p>\n<h3>A Few Examples of Questions<\/h3>\n<p>Angeline Belou shared a few examples of the questions they asked Apetiz customers:<\/p>\n<ul>\n<li>CSAT. Natixis Payments uses the Customer Satisfaction Score to measure customer satisfaction with the customer account page. The question is worded as follows: “Are you satisfied with your customer account page?”.<\/li>\n<li>NPS. Natixis Payments uses the Net Promoter Score to measure recommendation. The question is worded as follows: “Would you recommend our customer account page to other uses?”<\/li>\n<li>One of the survey goals is also to collect pains and ideas for improvement. One of the questions is: “What improvements would you like to see on the customer account page?”. Several answers are suggested, with an empty field for collecting verbatims.<\/li>\n<\/ul>\n<h3>Focus on MyFeelBack Data Activation Modes<\/h3>\n<p>As noted earlier, any information collected via MyFeelBack surveys is automatically fed into the CRM Salesforce tool. To two locations:<\/p>\n<ul>\n<li>Into customer files, so that the sales team can view satisfaction levels while on the phone to a customer. Customer files include NPS and CSAT scores, as well as a link to access their detailed answers.<\/li>\n<li>Into the salesperson’s dashboard. Surveys are also used to generate loyalty leads in the CRM, i.e., to identify sales opportunities and trigger qualified outbound calls.<\/li>\n<\/ul>\n<p>Natixis Payments uses MyFeelBack dashboards and custom reports to obtain a global and up-to-date view of customer satisfaction. The team meets weekly to analyse the evolution of customer satisfaction and send a monthly report to all department employees.<\/p>\n<h3>Evolving Surveys<\/h3>\n<p>The survey content has changed over time:<\/p>\n<ul>\n<li>The first survey was deployed in October 2019, focusing on customer satisfaction (pains\/improvement ideas) and generating leads.<\/li>\n<li>In December 2019, Natixis Payments decided to deploy a second survey focusing solely on satisfaction (and pains\/improvement ideas), without generating leads.<\/li>\n<li>The second survey was then adjusted in April 2020, to finetune the collection of pains and suggestions of areas to improve.<\/li>\n<\/ul>\n<p>The idea that surveys can change over time is essential. A survey’s content is not set in stone. It can always be improved and adjusted. The MyFeelBack solution is flexible and allows surveys to evolve over time. We encourage our clients to make the most of this!<\/p>\n<p>Natixis is a great example of a successful customer measurement project in a multi-entity or multi-brand company. We hope that it will inspire our readers!<\/p>\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-1414dfac-1a81-4b27-a0f8-5a3a8fe23207\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-1414dfac-1a81-4b27-a0f8-5a3a8fe23207\" class=\"hs-cta-node hs-cta-1414dfac-1a81-4b27-a0f8-5a3a8fe23207\"><!-- [if lte IE 8]>\n\n\n<div id=\"hs-cta-ie-element\"><\/div>\n\n\n<![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/744484\/1414dfac-1a81-4b27-a0f8-5a3a8fe23207\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" id=\"hs-cta-img-1414dfac-1a81-4b27-a0f8-5a3a8fe23207\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/1414dfac-1a81-4b27-a0f8-5a3a8fe23207.png\" alt=\"New Call-to-action\" \/><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"><br \/>\n<!--\/\/-->\/\/ ><!--\n hbspt.cta.load(744484, '1414dfac-1a81-4b27-a0f8-5a3a8fe23207', {\"region\":\"na1\"}); \n\/\/--><!\n<\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Natixis is made up of several entities. What do they all have in common? A growth strategy centred around the customer relationship. So, Natixis rose to the challenge and became a customer-centric company! But how do you deploy a customer-centric strategy and culture in a company made up of several entities with different organisations, ecosystems,&#8230;<\/p>\n","protected":false},"author":5,"featured_media":21740,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers<\/title>\n<meta name=\"description\" content=\"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-07-29T22:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:25:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/natixis-customer-centric-multi-brand-deployment.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/\",\"name\":\"How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-07-29T22:00:00+00:00\",\"dateModified\":\"2023-09-15T12:25:40+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to become customer-centric: Natixis&#039; method for multi-brand\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers","description":"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/","og_locale":"en_US","og_type":"article","og_title":"How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers","og_description":"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.","og_url":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/","og_site_name":"Skeepers","article_published_time":"2021-07-29T22:00:00+00:00","article_modified_time":"2023-09-15T12:25:40+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/natixis-customer-centric-multi-brand-deployment.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/","url":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/","name":"How to become customer-centric: Natixis&#039; method for multi-brand - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-07-29T22:00:00+00:00","dateModified":"2023-09-15T12:25:40+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Discover how Natixis implemented a customer-centric approach across multiple brands. Learn from their method to improve customer engagement.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/natixis-customer-centric-multi-brand-deployment\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"How to become customer-centric: Natixis&#039; method for multi-brand"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15773"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15773"}],"version-history":[{"count":6,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15773\/revisions"}],"predecessor-version":[{"id":132876,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15773\/revisions\/132876"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/21740"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15773"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15773"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15773"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15773"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}