{"id":15787,"date":"2021-05-11T22:00:00","date_gmt":"2021-05-11T22:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/tips-voice-of-customer-programme\/"},"modified":"2023-09-15T13:24:43","modified_gmt":"2023-09-15T12:24:43","slug":"tips-voice-of-customer-programme","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/","title":{"rendered":"20 Tips for a Successful Voice of the Customer Programme"},"content":{"rendered":"<p>In this article, we will present our best practices to build or improve your Voice of the Customer programme, with the help of Arnaud Allesant, Director at Eurogroup Consulting. Together, we have compiled a list of 20 practical tips to bring your Voice of the Customer project to fruition.<\/p>\n<p>Think of this article as a toolbox from which you can pick and choose ideas. Enjoy!<\/p>\n<h2>What is a Voice of the Customer Programme? [Definition]<\/h2>\n<p>A Voice of the Customer programme places the company’s customers, needs, expectations, and aspirations, at the heart of decision-making. Companies developing a Voice of the Customer programme are seeking to become more customer-centric.<\/p>\n<p>In practice, a Voice of the Customer programme consists in collecting feedback from customers during their experience with the brand (information search, purchase, contract, etc.), in order to assess their perception and improve the company’s products, services and journey.<\/p>\n<p>The Voice of the Customer generates ROI for companies, as it impacts their performance. According to an Aberdeen Group study, companies with an efficient Voice of the Customer programme report:<\/p>\n<ul>\n<li>55% increase of customer retention rate<\/li>\n<li>24% reduction of customer service costs. Which makes sense, because when you take customer feedback into account, you reduce irritants and therefore their need to contact you.<\/li>\n<li>37% increase in employee engagement.<\/li>\n<\/ul>\n<h2>Voice of the Customer Programmes: What’s the Situation in 2021?<\/h2>\n<p>Implementing a Voice of the Customer programme can be divided up into 4 steps:<\/p>\n<ul>\n<li>Collecting customer feedback.<\/li>\n<li>Analysing and sharing the results at all company levels.<\/li>\n<li>Ensuring teams take ownership of customer feedback.<\/li>\n<li>Implementing actions based on customer feedback.<\/li>\n<\/ul>\n<p>Let’s take a closer look at each of these steps, and how they are currently managed in most companies.<\/p>\n<h3>Collecting Feedback<\/h3>\n<p>The first step consists in collecting feedback, listening to the customer’s voice. This is one of the best managed steps. Collection technologies have matured over the past few years, making it easier to gather feedback.<\/p>\n<p>The indicators used to measure satisfaction, on the other hand, are not always the most relevant or complete. This is an area to improve. We’ll discuss this further in a few moments.<\/p>\n<h3>Analysing and Sharing<\/h3>\n<p>Once the customer feedback has been collected, it is analysed and shared with various employees. Most companies have a good handle on this stage.<\/p>\n<p>However, despite the quality of analysis, it is not always action-oriented. There is room for improvement here.<\/p>\n<p>Feedback and analysis should be thought of as a raw material, used to create short or medium-term actions. Analysis should always be “activatable”.<\/p>\n<h3>Taking Ownership of the Voice of the Customer<\/h3>\n<p>It is important that all employees be involved in the Voice of the Customer project. Everyone has to adopt a customer-centric vision in their ways of working and decision-making, not just the marketing or research teams! This is key to success.<\/p>\n<p>But this is often easier said than done. There are a number of negative (and limiting) beliefs about the Voice of the Customer, its value, and its use. Here a few examples of comments heard during the diagnostic phase:<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 349px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/beliefs-about-voice-of-customer.jpg\" alt=\"Negative beliefs about the voice of customer\" \/><\/p>\n<p>This lack of employee ownership, linked in part to a system of false beliefs, is the Achilles heel of most Voice of the Customer programmes. We’ll explore how to overcome this challenge a little further on.<\/p>\n<h3>Customer Feedback Driving Action<\/h3>\n<p>Customer feedback should be taken into account when making strategic decisions, and defining or improving a brand’s products, services and journey. Unfortunately, this is not often the case. Very few companies are customer feedback-driven. There is therefore a lot of room for improvement here, too.<\/p>\n<p>These 4 steps also constitute areas to work on, to continually improve. We will now present our 5 best practices for each of these 4 phases, along with our methodological tips. Let’s begin with the collection of customer feedback.<\/p>\n<h2>5 Best Practices to Improve Customer Feedback Collection<\/h2>\n<h3>1 – Identify Customer Journey and Moments of Truth<\/h3>\n<p>If you are thinking about collecting customer feedback, ask yourself the following questions: When do you need to collect feedback? Where? In which context? At what stage of the customer journey? Via which channel?<\/p>\n<p>To answer these questions, it is important to understand and analyse your customer journey, meaning all the stages your customer goes through with your brand. You must identify the “moments of truth&#8221; on this journey, meaning the most important moments in your customer relationship. Each moment of truth is a good time to collect feedback.<\/p>\n<p>On a retail customer journey, for example, the best moments to collect feedback would be basket abandonment, order confirmation, order cancellation, product use, contact with after-sales-service, etc.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 211px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/best-moments-collect-feedback.jpg\" alt=\"Customer Journey and Moments of Truth\" \/><\/p>\n<h3>2 – Build Short and Personalised Surveys<\/h3>\n<p>Short surveys have a better response rate, as confirmed by all our MyFeelBack users. To maximise the amount of feedback gathered, we recommend no more than 6 questions per survey.<\/p>\n<p>Here are two additional tips:<\/p>\n<ul>\n<li>Use <a href=\"https:\/\/skeepers.io\/en\/blog\/complete-guide-net-promoter-score-nps\/\" target=\"_blank\" rel=\"noopener\">NPS for the first question<\/a>. This will increase your survey response rates <strong>by 17% on average<\/strong>.<\/li>\n<li>Personalise the first page of your survey, by using the data in your CRM or marketing database (contextual data, transactional data, profile data, etc.).<\/li>\n<\/ul>\n<h3>3 – Set up an Automatic Trigger Scenario<\/h3>\n<p>Surveys sent immediately after an interaction or event get the best response rates. These surveys are triggered automatically, according to &#8220;triggers” for specific customer behaviour. This is based on marketing automation scenarios.<\/p>\n<p>For example, a survey could be automatically triggered in the form of a pop-up when a website visitor displays exit intent.<\/p>\n<p>Create scenarios for triggering your surveys. This will enable you to send immediate surveys that provide better response rates.<\/p>\n<h3>4 – Collect Customer Verbatims<\/h3>\n<p>Satisfaction rates are good, but they’re not enough. We recommend collecting customer verbatims to obtain more practical information. Verbatims complete satisfaction indicators.<\/p>\n<h3>5 – Don’t Forget to Reach out to your Inactive Customers<\/h3>\n<p>You can learn a lot from your inactive customers. Don’t forget about them. Send them surveys. Ask them for feedback.<\/p>\n<p>In fact, why not take the opportunity to ask them why they are inactive. This will help you better understand your weaknesses and maybe detect irritants that you were not aware of or identify areas for improvement with regards to your services, products, and journey.<\/p>\n<h2>5 Best Practices to Improve Feedback Analysis &amp; Deployment<\/h2>\n<h3>6 – Assess the Satisfaction Model<\/h3>\n<p>One of the challenges when it comes to analysis, is identifying the parts of your customer experience and customer journey that contribute most to your customers’ perception. These are the areas you need to act on.<\/p>\n<p>To identify them, it is important to combine the measurement of satisfaction at different levels &#8211; to measure overall satisfaction, but also at every stage and moment.<\/p>\n<p>The correlation between these two levels will help you assess the “satisfaction model”, i.e. the main drivers of customer satisfaction (and dissatisfaction).<\/p>\n<h3>7 – Create Company-Specific Indicators<\/h3>\n<p>It is important to build indicators that are adapted to your company, that combine classic rating scales with business data. For example, if you are a call centre, you could:<\/p>\n<ul>\n<li>Associate an NPS per employee.<\/li>\n<li>Cross-reference the NPS with the reason for the call.<\/li>\n<li>…\/…<\/li>\n<\/ul>\n<p>NPS and CSAT have a standard format so they can be adapted to specific business uses. Take advantage of this!<\/p>\n<h3>8 – Adapt your Dashboard Content<\/h3>\n<p>It is important to adapt your dashboard content to target users. We recommend running workshops with these target users (agency or shop managers, phone operators, managers, etc.) to gain a better understand of their needs in terms of reporting, and to identify the best indicators for your dashboard.<\/p>\n<p>Remember to adapt reports to your recipients, too. All user needs are different!<\/p>\n<h3>9 – Regularly Requalify your Contacts to Follow Changes in Persona \/ Needs<\/h3>\n<p>The Voice of the Customer is a continually evolving programme. New objectives may arise, new priorities may come to light. Think of the Voice of the Customer as a living project, that needs to be challenged on a regular basis:<\/p>\n<ul>\n<li>Are your indicators accurate? Don’t hesitate to change them. Things are often not perfect first-time round. There are always areas to optimise.<\/li>\n<li>Is your customer data still valid? The reliability of the information displayed on your dashboard is based on your data.<\/li>\n<\/ul>\n<h3>10 – Cross-reference Profitability &amp; Customer Perception<\/h3>\n<p>Make sure that your Voice of the Customer management tool is not disconnected from your business applications. Your customer knowledge solution should be linked to your CRM, ERP, and Marketing Automation.<\/p>\n<p>This interconnection enables companies to cross-reference customer satisfaction data (for example, the NPS score) with profitability or customer value data (average basket, etc.). In other words, to cross-reference Customer Perception with Customer Performance.<\/p>\n<p>You can learn a lot from these crossovers, as they help assess your VoC approach ROI, which is of interest to company stakeholders.<\/p>\n<h2>5 Best Practices to Improve Company Ownership of the Voice of the Customer<\/h2>\n<h3>11 – Identify and Involve Ambassadors<\/h3>\n<p>In a company, some employees are always more enthusiastic than others when it comes to topics like the Voice of the Customer. Let them spread a customer culture throughout your organisation. <a href=\"https:\/\/skeepers.io\/en\/build-relationship-of-trust\/\">Make them ambassadors<\/a> and advocates for your Voice of the Customer programme. Encourage them!<\/p>\n<h3>12 – Provide Voice of the Customer Training<\/h3>\n<p>There are a lot of training courses about the Customer Relationship and Customer Experience, but very few about the Voice of the Customer. How many employees in your company really know what NPS-2 means?<\/p>\n<p>We recommend creating Voice of the Customer training modules, so that the customer’s voice becomes a language that all employees understand.<\/p>\n<h3>13 – Share the Voice of the Customer Positively<\/h3>\n<p>The Voice of the Customer is sometimes seen as a form of appraisal. Some employees may feel that their actions are being “sanctioned” or “judged”. When customer feedback is critical, it can be perceived as a punishment.<\/p>\n<p>It is important to change this mindset and to encourage employees to view customer feedback (good or bad) as an opportunity for improvement and growth. Customer feedback helps understand the past and present, to build a better future.<\/p>\n<h3>14 – Incorporate the Voice of the Customer into Management Routines<\/h3>\n<p>Not many companies use the data provided by the Voice of the Customer in their everyday business. This is both the cause and consequence of a lack of ownership of the Voice of the Customer approach. There are several ways to make the Voice of the Customer an integral part of management routines. Here are a few ideas:<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 348px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/make-voice-of-customer-part-of-management.jpg\" alt=\"make the Voice of the Customer an integral part of management routines\" \/><\/p>\n<h3>15 – Gamify Ownership of the Voice of the Customer<\/h3>\n<p>A lot of companies have introduced customer satisfaction or customer experience “challenges”. The idea is to create an element of competition between employees and to reward those who generate the best customer performance. Each employee or team is then given a score at the end of the quarter or year.<\/p>\n<p>The challenge score is usually calculated based on satisfaction indicators, such as the NPS score. We suggest taking into account initiatives to share the voice of the customer with the rest of the company, to empower employees on the subject etc., when calculating this score.<\/p>\n<h2>5 Best Practices to Transform Customer Feedback into Action<\/h2>\n<h3>16 – Activate feedback to create short-term value<\/h3>\n<p>Once the feedback has been collected, it needs to be fed into the company’s software ecosystem – CRM, Marketing, BI, GRC tool, etc. &#8211; and communicated to the operational teams. Immediate customer feedback can create short-term value for companies.<\/p>\n<p>Take the NPS, for example. You can combine this indicator with other business data to build high value customer segments. For example:<\/p>\n<ul>\n<li>Regular detractor customers.<\/li>\n<li>The best promoter customers.<\/li>\n<li>…\/…<\/li>\n<\/ul>\n<p>Several types of actions can be implemented for these segments. For example, you can reward your brand promoters, renew contact with your detractors, build loyalty for neutrals who buy regularly…<\/p>\n<p>You can also use customer feedback to automatically generate personas that will help you better target your marketing actions.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 352px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/target-marketing-actions-persona.jpg\" alt=\" Use customer feedback to generate personas and target marketing actions\" \/><\/p>\n<h3>17 – Activate Feedback for Continuous Progress<\/h3>\n<p>In a more analytical and medium-term approach, customer feedback can help you detect areas for improvement to your products, services, and customer journey. Feedback can be a valuable ally in your BI initiatives.<\/p>\n<h3>18 – Include the Voice of the Customer in All Projects<\/h3>\n<p>We recommend incorporating the Voice of the Customer in all company projects, including those that, on the surface, have nothing to do with customers. Afterall, everything that a company does directly or indirectly impacts customers.<\/p>\n<h3>19 – Convey the Voice of the Customer to Managers &amp; Executives<\/h3>\n<p>The Executive Committee and, more broadly, all the company’s management bodies should become active stakeholders in the <a href=\"https:\/\/skeepers.io\/en\/industrie-transport\/\">Voice of the Customer<\/a> programme.<\/p>\n<p>Three kinds of initiatives could be put in place:<\/p>\n<ul>\n<li>Raising awareness with management. This begins with acculturation (sharing the voice of the customer in meetings, showing the links between Perception &amp; Customer Performance, etc.), and leads to the formation of a belief, that the Voice of the Customer should always be taken into account when making strategic decisions.<\/li>\n<li>Building a Voice of the Customer action plan. We believe that it is important to incorporate an ambition to improve the Customer Experience and an action plan into the company’s global strategy. This action plan should be broken down into specific improvement objectives for each customer journey (e.g. XX% NPS increase).<\/li>\n<li>Monitoring, with the creation of top-management customer experience dashboard.<\/li>\n<\/ul>\n<h3>20 – Define a Customer Experience Roadmap<\/h3>\n<p>The roadmap for improving the customer experience should be based on customer feedback and the resulting dashboards. The construction of your roadmap, selection of areas to work on, their prioritisation, and their scheduling, should be partly dictated by the Voice of the Customer.<\/p>\n<p>We have now presented 20 ideas for organising and improving your Voice of the Customer programme. We hope that you’ve found it helpful!<\/p>\n<p><span id=\"hs-cta-wrapper-f872a7d4-15de-4afd-a4ce-28e373eec588\" class=\"hs-cta-wrapper\"><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"><br \/>\n<!--\/\/-->\/\/ ><!--\n hbspt.cta.load(744484, 'f872a7d4-15de-4afd-a4ce-28e373eec588', {\"region\":\"na1\"}); \n\/\/--><!\n<\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n\n\n<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-cb2d0916-f405-47e9-bb18-4064b993938a\"><span class=\"hs-cta-node hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\" id=\"hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"><\/div><![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/cb2d0916-f405-47e9-bb18-4064b993938a\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"hs-cta-img\" id=\"hs-cta-img-cb2d0916-f405-47e9-bb18-4064b993938a\" style=\"border-width:0px;\" height=\"159\" width=\"700\" src=\"https:\/\/no-cache.hubspot.com\/cta\/default\/20304540\/cb2d0916-f405-47e9-bb18-4064b993938a.png\" alt=\"Discover our Solutions: Book your Demo\"><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"> hbspt.cta.load(20304540, 'cb2d0916-f405-47e9-bb18-4064b993938a', {\"useNewLoader\":\"true\",\"region\":\"na1\"}); <\/script><\/span><!-- end HubSpot Call-to-Action Code -->\n","protected":false},"excerpt":{"rendered":"<p>In this article, we will present our best practices to build or improve your Voice of the Customer programme, with the help of Arnaud Allesant, Director at Eurogroup Consulting. Together, we have compiled a list of 20 practical tips to bring your Voice of the Customer project to fruition. Think of this article as a&#8230;<\/p>\n","protected":false},"author":5,"featured_media":28088,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[160,2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>20 Tips for a Successful Voice of the Customer Programme<\/title>\n<meta name=\"description\" content=\"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"20 Tips for a Successful Voice of the Customer Programme\" \/>\n<meta property=\"og:description\" content=\"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-05-11T22:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:24:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2021\/05\/AdobeStock_323315268-scaled.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1533\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/\",\"name\":\"20 Tips for a Successful Voice of the Customer Programme\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-05-11T22:00:00+00:00\",\"dateModified\":\"2023-09-15T12:24:43+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"20 Tips for a Successful Voice of the Customer Programme\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"20 Tips for a Successful Voice of the Customer Programme","description":"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/","og_locale":"en_US","og_type":"article","og_title":"20 Tips for a Successful Voice of the Customer Programme","og_description":"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.","og_url":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/","og_site_name":"Skeepers","article_published_time":"2021-05-11T22:00:00+00:00","article_modified_time":"2023-09-15T12:24:43+00:00","og_image":[{"width":2560,"height":1533,"url":"https:\/\/skeepers.io\/app\/uploads\/2021\/05\/AdobeStock_323315268-scaled.jpeg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/","url":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/","name":"20 Tips for a Successful Voice of the Customer Programme","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-05-11T22:00:00+00:00","dateModified":"2023-09-15T12:24:43+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"A Voice of the Customer programme places the company&#039;s customers, needs, expectations, and aspirations, at the heart of decision-making.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/tips-voice-of-customer-programme\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"20 Tips for a Successful Voice of the Customer Programme"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15787"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15787"}],"version-history":[{"count":7,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15787\/revisions"}],"predecessor-version":[{"id":124648,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15787\/revisions\/124648"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/28088"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15787"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15787"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15787"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15787"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}