{"id":15795,"date":"2021-03-18T23:00:00","date_gmt":"2021-03-18T23:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/unleash-employees-potential-boost-customer-experience\/"},"modified":"2023-09-15T13:24:11","modified_gmt":"2023-09-15T12:24:11","slug":"unleash-employees-potential-boost-customer-experience","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/","title":{"rendered":"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience"},"content":{"rendered":"<p>There is a lot of talk about customer experience, but much less about employee experience. Wrongly so! Both are closely linked and “work” together.<\/p>\n<p>This article aims to:<\/p>\n<ul>\n<li>Present the interesting results of a survey conducted by CX Lab on employee experience and how it is perceived by employees. Together, we will discover today’s main employee needs and expectations.<\/li>\n<li>Show you how to align employee experience and customer experience with a tool: mirror surveys.<\/li>\n<li>Present a few courses of action and good practices to optimise your employee experience and build your strategy.<\/li>\n<\/ul>\n<p>This article follows on from the three-part webinar we took part in last week, alongside Françoise Terrenes (Executive Director – CX Lab) and Laure Pourageaud (HR Director – Sodexo BRS).<\/p>\n<h2>What Employee Experience Means from an Employee Viewpoint – CX Lab Survey Results<\/h2>\n<p>The fact that a Customer Experience consultancy firm has published a survey on employee experience reveals just how closely tied the following two themes are: <strong>customer experience and employee experience<\/strong>. CX Lab’s survey, conducted with 150 employees and managers, highlights this link. Thank you so much, Françoise Terrenes, for sharing the main findings of this survey with us.<\/p>\n<h3>A Sense of Purpose is Key to Employee Satisfaction<\/h3>\n<p>The question of meaning, explored in this survey, provides interesting insights. <strong>For 70% of respondents, the meaning given to work<\/strong>, the trust, collaboration, genuine relationships, and quality of management, best define the key aspects of the employee experience.<\/p>\n<p>For 12% of respondents, employee experience refers to <strong>every moment spent<\/strong> in a company, particularly key moments. There is a strong analogy here between employee experience and customer experience. Indeed, customer experience is often defined as all the satisfaction and enchantment moments, at key stages of the customer journey.<\/p>\n<p><strong>Only 6% of respondents put well-being at work and material things first<\/strong>: salary, benefits, etc. This is key: offering a quality employee experience is not just about offering yoga classes, table football sessions, lunch vouchers, or employee pay rises!<\/p>\n<p>Above all else, employees are <strong>looking for meaning<\/strong>, for a sense of purpose. They want to feel useful in the company and for their work to be acknowledged. They want to know what they’re doing and why they’re doing it. It is in the company’s interest to take this expectation and need into account, because it clearly favours employee engagement and productivity, as well as alignment with company objectives.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 371px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/employee-need-for-meaning.jpg\" alt=\"employees need a meaning at work\" \/><\/p>\n<p class=\"rtecenter\"><em><span style=\"font-size: 11px;\">Statistical Data: CX Lab<\/span><\/em><\/p>\n<h3>Other Interesting CX Lab Survey Findings About Employee Experience<\/h3>\n<p>Here are a few other results from the CX Lab survey, that complete the previous ones:<\/p>\n<ul>\n<li>65% of respondents place work recognition in their Top 5 expectations of the employer. 55% place the company’s trust in them in the Top 5 of what is important to them professionally. This reflects the <strong>need for recognition among employees<\/strong>. A lack of recognition leads to a loss of employee commitment and engagement. This is closely linked to the question of meaning highlighted above.<\/li>\n<li>35% place contributing to the company’s strategy in their Top 5 expectations of the employer. <strong>Employees want to be fully involved<\/strong>.<\/li>\n<li>65% of respondents place salary in their Top 5 expectations of the employer. 48% place salary in the Top 5 of what is important to them professionally. This puts the earlier 6% into perspective. Although <strong>salary and rewards<\/strong> (in kind or symbolic) is not central, and certainly not the only consideration, it is important to employees. Which, in our opinion, makes perfect sense.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 319px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/key-employee-issues-stats.jpg\" alt=\"key employee issues stats\" \/><\/p>\n<p class=\"rtecenter\"><em><span style=\"font-size: 11px;\">Statistical Data: CX Lab<\/span><\/em><\/p>\n<h2>Aligning Customer and Employee Experience with Mirror Surveys<\/h2>\n<p>Employee experience and customer experience are intrinsically linked. This is what we showed in our article about the concept of symmetry of attention. One of the challenges faced by companies is to align the two: CX and EX. There is a tool that can do just that, called the mirror survey. It consists in mirroring (hence the name) employee feedback and customer feedback to identify alignments and areas for improvement.<\/p>\n<h3>Mirror Survey Concept &amp; Objectives<\/h3>\n<p>A mirror survey is a survey sent to employees at the same time as a customer satisfaction survey. It is then used to compare employee and customer opinions in order to identify any differences in perception and align expectations.<\/p>\n<p>There are <strong>3 objectives<\/strong> in a mirror survey:<\/p>\n<ol>\n<li>Visualise areas of agreement and disagreement between employees and customers.<\/li>\n<li>Realign the service provided by the company with customer expectations.<\/li>\n<li>Refocus your business on its customers and employees.<\/li>\n<\/ol>\n<p class=\"discover_more\"><strong>Discover <a href=\"https:\/\/skeepers.io\/en\/blog\/remote-working-questions-manage-team-satisfaction\/\" target=\"_blank\" rel=\"noopener\">20+ questions to manage remote working employee satisfaction<\/a><\/strong><\/p>\n<h3>Implementing a Mirror Survey<\/h3>\n<p>We will now briefly look at how to build a mirror survey.<\/p>\n<p>A mirror survey takes the form of a <strong>survey sent to employees<\/strong>. This survey can either be a one-off (2 to 4 times a year) or recurring to build up a barometer. The employee survey should mirror the customer satisfaction survey. This will enable you to verify whether or not employee and customer perceptions are in line.<\/p>\n<p>There are 4 possible outcomes:<\/p>\n<ul>\n<li><strong>Positive agreement.<\/strong> The employee think that the customer is satisfied, and they are. This is the situation that companies should work towards.<\/li>\n<li><strong>Negative agreement.<\/strong> The employee thinks that the customer is dissatisfied, and they are.<\/li>\n<li><strong>Overestimation<\/strong>. The employee thinks that the customer is satisfied, but they’re not.<\/li>\n<li><strong>Underestimation.<\/strong> The employee thinks that the customer is dissatisfied, but they’re not.<\/li>\n<\/ul>\n<p>The first two cases are aligned. For the last two however, there is a misalignment between employee and customer perception.<\/p>\n<p>The results of both surveys (employees and customers) can be compared in the form of a spider graph, as below:<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 446px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/mirror-survey-customer.jpg\" alt=\"mirror survey customer\" \/><\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 458px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/mirror-survey-employees.jpg\" alt=\"mirror survey employees\" \/><\/p>\n<p><em>Case n°1 – Overestimation: employees believe that the quality of advice is very satisfactory, whereas customers are not satisfied<br \/>\nCase n°2 – Underestimation: employees believe that the ordering and payment process is not satisfactory, whereas customers are satisfied with this item.<\/em><\/p>\n<p>The graph on the left shows the customers’ answers, and the one of the right the employees’ answers. Comparing these two graphs shows two significant differences, one revealing an overestimation (case n°1) and the other an underestimation (case n°2).<\/p>\n<p>These results should of course be shared with employees and used to identify priority actions for improvement. The example above shows that the quality of advice is an area that needs to be worked on.<\/p>\n<p>The purpose of this survey is operational. A mirror survey helps build an action plan to improve the customer experience. We will now present an additional area to analyse, still based on the mirror survey.<\/p>\n<h3>Cross-referencing the Level of Importance with the Level of Satisfaction<\/h3>\n<p>In order to build your action plan, you need to identify the areas customers are dissatisfied with, and also their importance. Here is the type of representation that can be used to cross-reference these two variables.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 425px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/cross-referencing-importance-satisfaction.jpg\" alt=\"Cross-referencing level of importance and customer satisfaction\" \/><\/p>\n<p>You can identify priority action areas at a glance &#8211; those that combine a high level of importance and a low level of satisfaction. In this example, the product search clearly needs to be optimised.<\/p>\n<p>Bonus tip: we recommend deploying mirror surveys at key moments of the customer experience. In retail, for example, this would be upon purchase, delivery, or customer service. These are the moments you should focus on improving first.<\/p>\n<h3>Mirror Surveys, a Tool for Improving Customer Experience AND Employee Experience<\/h3>\n<p>We’ve explained above how to build a customer experience improvement plan with a mirror survey. But this tool is also a lever for <strong>improving employee experience<\/strong>, a tool for employees. For two reasons.<\/p>\n<p>It shows employees that they are sometimes doing better than they think. Underestimation occurs frequently – employees assume that customers are dissatisfied when they are not. The mirror survey is therefore a way to add value to your staff’s work, a means of recognition. And we’ve already seen how important this is to the employee experience.<\/p>\n<p>More generally speaking, comparing employee and customer perceptions is a way to give meaning to the employee’s work, by reminding them that the goal of their day-to-day work is to satisfy the customer. Mirror surveys show the direct link between internal processes and procedures on the one hand, and customer experience on the other.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 476px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/satisfaction-survey-out-of-4.jpg\" alt=\"Satisfaction survey out of 4\" \/><\/p>\n<h2>Recommendations &amp; Good Practices for an Aligned Employee and Customer Experience<\/h2>\n<p>During the webinar, Laure Pourageaud, HR Director at Sodexo BRS, stressed how important mirror surveys are, and more broadly, <strong>aligning the employee and customer experience<\/strong>. Laure shared several key good practices to build an employee experience strategy that positively impacts the customer experience. We want to thank her for her explanations and enlightening feedback.<\/p>\n<p>Here are a few recommendations that caught our attention:<\/p>\n<ul>\n<li>Employee experience (EX), like customer experience, is based on key moments. If a company wants to optimise the EX, they must understand the employee journey and identify the key moments and priority areas to improve. In other words, <strong>an employee experience strategy should be based on the employee journey.<\/strong><\/li>\n<li>Maintaining a <strong>healthy separation between personal life and work life<\/strong> is key to a satisfactory employee experience. Keeping these two spheres apart is currently being challenged by the health crisis and remote working, whether encouraged or forced. Remote working brings a new dimension to the employee experience, an issue that needs to be addressed by companies.<\/li>\n<li><strong>Employee experience indicators<\/strong> should be taken into account by management’s steering systems. They are just as important as financial indicators. The two are not incompatible. Afterall, a good quality customer experience guarantees better productivity and therefore increases the company’s performance. It is up to human resource managers to push in this direction and get things moving. There is a lot of room for improvement in this area.<\/li>\n<\/ul>\n<h3>&#8220;Whatever the experience, always put yourself in the shoes of the person experiencing it”<\/h3>\n<p>This idea expressed by Laure Pourageaud reaffirms the importance of <strong>mirror surveys<\/strong>, and also <strong>satisfaction surveys<\/strong>.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 357px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/nps-question-net-promoter.jpg\" alt=\"NPS question\" \/><\/p>\n<p>MyFeelBack is fully aligned with this idea. It is at the core of our beliefs.<\/p>\n<p>Companies (managers, directors) should put themselves in their employees’ shoes, just like employees should put themselves in the customer’s shoes. We recommend organising immersion days, during which managers (or even the human resources director) immerse themselves into their employees’ daily lives. This is a way of getting close to what is happening in the field and to understand employee aspirations.<\/p>\n<p>Another good practice is to ensure that employees use the products or services sold by the company, to better immerse themselves into the customer experience. Laure Pourageaud, who worked for Sage for many years, revealed that this software publisher uses its own software internally. We think this is an excellent idea!<\/p>\n<blockquote><p>Employee experience is not a HR issue, but a business, leadership and team issue. Hence the importance of communicating on the customer experience, employee experience and their reciprocal links…<\/p>\n<p>Laure Pourageaud<\/p><\/blockquote>\n<p>We are delighted to have taken part in this highly informative webinar, that sheds light on the challenges and different aspects of the employee experience. We hope to have convinced you of the importance of this winning strategy for your employees, customers, and business alike.<\/p>\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-270de07a-b9e2-461a-b4a4-971afd7fde24\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-270de07a-b9e2-461a-b4a4-971afd7fde24\" class=\"hs-cta-node hs-cta-270de07a-b9e2-461a-b4a4-971afd7fde24\"><!-- [if lte IE 8]>\n\n\n<div id=\"hs-cta-ie-element\"><\/div>\n\n\n<![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/744484\/270de07a-b9e2-461a-b4a4-971afd7fde24\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" id=\"hs-cta-img-270de07a-b9e2-461a-b4a4-971afd7fde24\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/270de07a-b9e2-461a-b4a4-971afd7fde24.png\" alt=\"Download\" \/><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"><br \/>\n<!--\/\/-->\/\/ ><!--\n hbspt.cta.load(744484, '270de07a-b9e2-461a-b4a4-971afd7fde24', {\"region\":\"na1\"}); \n\/\/--><!\n<\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a lot of talk about customer experience, but much less about employee experience. Wrongly so! Both are closely linked and “work” together. This article aims to: Present the interesting results of a survey conducted by CX Lab on employee experience and how it is perceived by employees. Together, we will discover today’s main&#8230;<\/p>\n","protected":false},"author":5,"featured_media":21916,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers<\/title>\n<meta name=\"description\" content=\"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers\" \/>\n<meta property=\"og:description\" content=\"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-03-18T23:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:24:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/unleash-employees-potential-boost-customer-experience.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/\",\"name\":\"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-03-18T23:00:00+00:00\",\"dateModified\":\"2023-09-15T12:24:11+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers","description":"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/","og_locale":"en_US","og_type":"article","og_title":"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers","og_description":"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.","og_url":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/","og_site_name":"Skeepers","article_published_time":"2021-03-18T23:00:00+00:00","article_modified_time":"2023-09-15T12:24:11+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/unleash-employees-potential-boost-customer-experience.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/","url":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/","name":"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-03-18T23:00:00+00:00","dateModified":"2023-09-15T12:24:11+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"There is a lot of talk about customer experience, but less about employee experience. Both are closely linked and &quot;work” together.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/unleash-employees-potential-boost-customer-experience\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"Free Your Employees&#039; Potential &amp; Boost Your Customer Experience"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15795"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15795"}],"version-history":[{"count":5,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15795\/revisions"}],"predecessor-version":[{"id":132849,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15795\/revisions\/132849"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/21916"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15795"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15795"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15795"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15795"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}