{"id":15841,"date":"2020-07-29T22:00:00","date_gmt":"2020-07-29T22:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/energy-sector-indicators-monitoring-dashboard\/"},"modified":"2023-09-15T13:22:08","modified_gmt":"2023-09-15T12:22:08","slug":"energy-sector-indicators-monitoring-dashboard","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/","title":{"rendered":"Energy sector: indicators to include in your monitoring dashboard"},"content":{"rendered":"<p>Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers’ satisfaction with your services?<\/p>\n<p>We are going to help you build your very own customer satisfaction dashboard. We will look at which indicators to include in your dashboard, and what other items to add. This customer satisfaction dashboard will enable you to strengthen your <a href=\"https:\/\/skeepers.io\/en\/blog\/crucial-steps-creating-customer-centric-business\/\" target=\"_blank\" rel=\"noopener\">customer centric approach<\/a> and to adapt your initiatives, projects and actions to your clientele’s needs and expectations.<\/p>\n<h2>Which satisfaction indicator(s) should you choose in the Energy sector?<\/h2>\n<p>If you are reading this article, you are interested in <strong>measuring your customer satisfaction<\/strong>. You probably have several reasons to do so:<\/p>\n<ul>\n<li>Immediately detecting customer dissatisfaction to handle it in a proactive manner.<\/li>\n<li>Monitoring the evolution of customer satisfaction over time.<\/li>\n<li>Understanding your strengths and weaknesses.<\/li>\n<li>Continually improving your products and services, taking into accounts your customers’ expectations and needs.<\/li>\n<li>Reducing the risk of attrition (customer churn).<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 376px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/exemple-dashboard-questionnaire.png\" alt=\"MyFeelBack Satisfaction dashboard example\" \/><\/p>\n<h3>3 key indicators: NPS, CSAT and CES<\/h3>\n<p>The first step to measuring customer satisfaction is to choose one or more satisfaction indicators. If you read this blog regularly, you will know that there are several. The 3 reference indicators are as follows:<\/p>\n<ul>\n<li>The <strong>Net Promoter Score (NPS)<\/strong>, that enables you to calculate your recommendation score. This score is calculated based on the answers given to the following question: “On a scale of 0 to 10, how likely are you to recommend our services to others?”<\/li>\n<li>The <strong>Customer Satisfaction Score (CSAT)<\/strong>, which is the most well-known satisfaction indicator. It is obtained by aggregating the answers to a very simple question: “Are you satisfied with X?”. This question can of course be rephrased, but however it is worded, the respondent must choose from 5 answers, ranging from “Very satisfied” to “Not at all satisfied”.<\/li>\n<li>The <strong>Customer Effort Score (CES)<\/strong>, that helps to identify any friction on the customer journey. This indicator consists in measuring the level of effort exerted by the customer at the different stages of the journey, whether at the beginning (signing up phase) or at the end (after-sales service, contract renewal, etc.).<\/li>\n<\/ul>\n<p>Surveys are required to calculate these three indicators. In order to build a customer satisfaction dashboard, you need a solution that allows you to create and deploy surveys targeting each phase of your journey. MyFeelBack, a Customer Knowledge Solution, does exactly that. Feel free to contact us to find out more.<\/p>\n<p class=\"discover_more\"><strong>For more information about the Net Promoter Score, check out our <a href=\"https:\/\/skeepers.io\/en\/blog\/complete-guide-net-promoter-score-nps\/\">complete guide to NPS<\/a><\/strong><\/p>\n<h3>The two uses of indicators (macro &amp; micro)<\/h3>\n<p>These indicators all have two different uses (macro &amp; micro):<\/p>\n<ul>\n<li><strong>Measuring customer satisfaction at a global level<\/strong>. E.g.: the percentage of satisfied customers or the percentage of “promoters” (as defined by the NPS). The “macro” use case allows for statistical analysis. This article mainly discusses this use case, but it is important to bear in mind that a satisfaction indicator also has another use that could be described as “micro”.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 343px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/NPS-Global.jpg\" alt=\"Overall NPS\" \/><\/p>\n<ul>\n<li><strong>Measuring satisfaction at an individual customer level<\/strong>. E.g.: Mr Martin is very dissatisfied with his energy contract. The “micro” use case allows to trigger real actions and to personalise the customer dialogue. For example, if Mr Martin declares that he is dissatisfied with your services, you can call him back to better understand his needs and deal with his dissatisfaction. With MyFeelBack, you can set up automatic alerts for your customer services (sent by email for example) if a customer gives a satisfaction score below X in a survey.<\/li>\n<\/ul>\n<h3>The choice of indicators<\/h3>\n<p>Which indicator should you choose? One or several? You can proceed in stages, starting by focusing your efforts on one indicator. In this case, we recommend choosing between the NPS (recommendation but also indirectly, satisfaction indicator) and the CSAT (classic satisfaction indicator).<\/p>\n<p>Then, once you are at ease with measuring satisfaction (at every level: survey design, targeted deployment, integration of answers into your CRM and dashboard, etc.), you can consider adding a second indicator: the Customer Effort Score or CES.<\/p>\n<p>The <strong>fluidity of your customer journey<\/strong> is key. It strongly influences the customer experience, and therefore customer satisfaction. As seen above, the Customer Effort Score allows you to evaluate the level of fluidity of your customer journey and, if necessary, identify any sticking points, irritants, and stages that are slowing down the journey. Any company in the energy sector should consider deploying this indicator in the long run.<\/p>\n<h3>The different indicator analysis axes to include in your dashboard<\/h3>\n<p>You need to analyse your indicator(s) from different angles. Take the Net Promoter Score, for example. You can start, of course, by adding the overall score to your dashboard which lies somewhere between -100 and 100. But you should not stop there.<\/p>\n<p>Here are two recommendations to go a step further:<\/p>\n<ul>\n<li>Show the <strong>monthly evolution of your overall NPS score<\/strong>. As with any indicator, it is important to have a view of that specific moment in time and the “film”.<\/li>\n<li><strong>Display the breakdown<\/strong> between “Promoters” \/ “Neutrals” \/ “Detractors” and the monthly evolution of this breakdown.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 418px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/NPS-promoters-neutrals-detractors.jpg\" alt=\"NPS by date and by promoters neutrals detractors\" \/><\/p>\n<h2>Measuring your company’s strengths and weaknesses (from a customer viewpoint)<\/h2>\n<p>Measuring satisfaction is not just about asking your customers whether or not they are satisfied. You can go much further by asking them what they like the most, and what they like the least. This will reveal your company’s strengths and weaknesses <strong>as seen by your customers<\/strong>.<\/p>\n<p>Our advice: Identify 5 to 10 key elements in your products and services and ask your customers about each one: “How satisfied are you with X?”, “How satisfied are you with Y?”, etc. You will learn a lot.<\/p>\n<p>The elements that generate the highest <strong>satisfaction rate<\/strong> are your strengths. Exploit them and highlight them in your communications and sales pitches. These are key elements of your value proposition.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 851px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/why-choose-scottish-power.jpg\" alt=\"why to choose scottish power\" \/><\/p>\n<p class=\"rtecenter\"><em><span style=\"font-size: 11px;\"><a href=\"https:\/\/www.scottishpower.co.uk\/yourenergy\/\">https:\/\/www.scottishpower.co.uk<\/a><\/span><\/em><\/p>\n<p>On the flip side, any elements that are <strong>sources of dissatisfaction<\/strong> need to be worked on. These are your areas for improvement.<\/p>\n<h2>Beyond indicators, enrich your dashboard with customer verbatims!<\/h2>\n<p>You can collect customer verbatims at lots of different touchpoints: website, social media, customer services, etc. But the simplest solution for collecting a customer’s comments, and to integrate these verbatims into your dashboard as easily as possible, is by using surveys.<\/p>\n<h3>Collecting verbatims with complementary questions<\/h3>\n<p>When building an NPS, CSAT or CES satisfaction survey, you can add a complementary question right after the NPS, CSAT or CES question. This is something we highly recommend.<\/p>\n<p>The aim of this complementary question? To ask your customers the reasons behind their answer to the satisfaction question. This is a particularly effective way of <strong>collecting immediate verbatim feedback<\/strong>. With MyFeelBack, you can even vary the complementary question depending on the satisfaction score. For example:<\/p>\n<ul>\n<li>“<em>What are the reasons for your dissatisfaction?<\/em>” for respondents who give a satisfaction score below X.<\/li>\n<li>“<em>What can we improve to satisfy you even more?<\/em>” for respondents who give a score above Y.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 616px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/nps-complementary-question.jpg\" alt=\"NPS question\" \/><\/p>\n<p>One last thing. Customers cancel their energy contracts with you every day. It is <strong>important to ask them why<\/strong> by automatically sending them a customer survey after they cancel or choose not to renew their contract. We encourage you to collect verbatims in this critical situation. This will enable you to better understand your <strong>attrition rate<\/strong> and to identify areas for improvement of your services.<\/p>\n<h3>Adding verbatims to your monitoring dashboard<\/h3>\n<p>There are several ways to integrate verbatims and customer comments directly onto your dashboard. But first, you need to create a data flow to automatically feed the verbatims into your dashboard, in real time. If you are building a dashboard in your customer survey solution, then this does not apply. But if you have decided to create a dashboard in your CRM solution, for example, then you need to create a data flow by using an API or connector, provided by your survey solution. As a side note, MyFeelBack offers connectors for most CRM solutions on the market.<\/p>\n<p>Once you have set up the data flow, the next question is: what mode of representation should you use to integrate the verbatims? We will not spend too long on this question, since it has already been answered in another article that you can read here: <a href=\"https:\/\/skeepers.io\/en\/blog\/verbatim-analysis-transform-customer-comments-kpis\/\" target=\"_blank\" rel=\"noopener\">How to use verbatim analysis to transform customer comments into steering kpis.<\/a><\/p>\n<p>Here are a few possibilities a solution like MyFeelBack can offer:<\/p>\n<ul>\n<li><strong>Group the verbatims into two categories: positive and negative<\/strong>. Our solution uses semantic analysis to automatically classify answers according to the words used by your customers.<\/li>\n<li>Display on your dashboard the words most frequently used by customers in their comments (in the form of a <strong>tag cloud<\/strong> or <strong>chart<\/strong>).<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 325px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/cloud-words-semantic-analysis.jpg\" alt=\"Tag cloud: words semantic analysis\" \/><\/p>\n<p>This article is now drawing to an end. We have provided three answers to the question: “What should I include in my customer satisfaction dashboard?”:<\/p>\n<ul>\n<li>One or more satisfaction indicators: NPS, CSAT, CES. We have stressed the importance of using several analysis axes to learn as much as possible from your indicators.<\/li>\n<li>Strengths and weaknesses so that you can identify the elements that generate the most satisfaction and the areas you need to work on to improve the customer experience.<\/li>\n<li>Verbatims to better understand the way in which your customers talk about you and the words they use to describe you. Verbatims are a gold mine of information to better understand the reasons for satisfaction, dissatisfaction, or termination.<\/li>\n<\/ul>\n<p>Finally, you can also add some <strong>“Customer Knowledge” oriented indicators<\/strong> to you dashboard relating to, for example:<\/p>\n<ul>\n<li>Consumption habits: this information is automatically collected from your customers’ accounts but can also be supplemented by customer feedback.<\/li>\n<li>The characteristics of your customers’ home: house \/ apartment, square footage, insulation, etc.<\/li>\n<li>Your customer acquisition sources. You can ask the customer how they discovered you: a website, print advertising, an online advertising campaign, word of mouth, etc., in order to improve your customer acquisition marketing strategy.<\/li>\n<\/ul>\n<p>We hope that you enjoyed this article. If you have any questions about this topic that were not covered in the article, then please get in touch with our experts via <a href=\"https:\/\/www.myfeelback.com\/en\/contact\" target=\"_blank\" rel=\"noopener\">the form<\/a>. We have worked alongside several companies in the Energy sector to structure their monitoring system. We would be delighted to help you too.<\/p>\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-52c5848e-4be7-4cd1-8e3d-d0a27538ac0b\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-52c5848e-4be7-4cd1-8e3d-d0a27538ac0b\" class=\"hs-cta-node hs-cta-52c5848e-4be7-4cd1-8e3d-d0a27538ac0b\"><!-- [if lte IE 8]>\n\n\n<div id=\"hs-cta-ie-element\"><\/div>\n\n\n<![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/744484\/52c5848e-4be7-4cd1-8e3d-d0a27538ac0b\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" id=\"hs-cta-img-52c5848e-4be7-4cd1-8e3d-d0a27538ac0b\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/52c5848e-4be7-4cd1-8e3d-d0a27538ac0b.png\" alt=\"Download\" \/><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"><br \/>\n<!--\/\/-->\/\/ ><!--\n hbspt.cta.load(744484, '52c5848e-4be7-4cd1-8e3d-d0a27538ac0b', {}); \n\/\/--><!\n<\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers’ satisfaction with your services? We are going to help you build your very own customer satisfaction dashboard. We will look at which indicators to include in your dashboard, and what other items to add. This&#8230;<\/p>\n","protected":false},"author":5,"featured_media":22233,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[160,136],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Energy sector: indicators to include in your monitoring dashboard - Skeepers<\/title>\n<meta name=\"description\" content=\"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Energy sector: indicators to include in your monitoring dashboard - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2020-07-29T22:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:22:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/energy-sector-indicators-monitoring-dashboard.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/\",\"name\":\"Energy sector: indicators to include in your monitoring dashboard - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2020-07-29T22:00:00+00:00\",\"dateModified\":\"2023-09-15T12:22:08+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Energy sector: indicators to include in your monitoring dashboard\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Energy sector: indicators to include in your monitoring dashboard - Skeepers","description":"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/","og_locale":"en_US","og_type":"article","og_title":"Energy sector: indicators to include in your monitoring dashboard - Skeepers","og_description":"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?","og_url":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/","og_site_name":"Skeepers","article_published_time":"2020-07-29T22:00:00+00:00","article_modified_time":"2023-09-15T12:22:08+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/energy-sector-indicators-monitoring-dashboard.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/","url":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/","name":"Energy sector: indicators to include in your monitoring dashboard - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2020-07-29T22:00:00+00:00","dateModified":"2023-09-15T12:22:08+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Does your company operate in the energy sector? Would you like to improve your customer listening to measure your customers&#039; satisfaction?","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/energy-sector-indicators-monitoring-dashboard\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"Energy sector: indicators to include in your monitoring dashboard"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15841"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15841"}],"version-history":[{"count":6,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15841\/revisions"}],"predecessor-version":[{"id":93384,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15841\/revisions\/93384"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/22233"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15841"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}