{"id":15850,"date":"2019-02-12T23:00:00","date_gmt":"2019-02-12T23:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/create-customer-satisfaction-barometer\/"},"modified":"2023-09-15T13:18:00","modified_gmt":"2023-09-15T12:18:00","slug":"create-customer-satisfaction-barometer","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/","title":{"rendered":"Retail: Create your ideal customer satisfaction barometer"},"content":{"rendered":"<p>Retail professionals are aware of the importance of customer satisfaction and a positive in-store customer experience. In order to increase customer loyalty and grow their client base through word-of-mouth. For some brands, monitoring customer satisfaction has become equally as important as tracking turnover or net earnings.<\/p>\n<p>When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system. Developing a customer satisfaction barometer for your <a href=\"https:\/\/skeepers.io\/en\/retail\/\">retail<\/a> business addresses three key objectives:<\/p>\n<ul>\n<li>Measuring customer satisfaction and track changes using relevant indicators<\/li>\n<li>Sharing your barometer with your company’s different teams and departments to help them implement their customer-centric strategy<\/li>\n<li>Encouraging and motivate all collaborators to work towards the company’s goals<\/li>\n<\/ul>\n<p>In this document, we’ll guide you through the various different steps involved in creating a customer satisfaction barometer for your retail company.<\/p>\n<p> <\/p>\n<h2>Retail: Why Creating a Customer Satisfaction Barometer?<\/h2>\n<p>A brief definition before we begin: a customer satisfaction barometer is a<strong> reporting tool<\/strong> that enables companies to measure their customers’ level of satisfaction, <strong>continuously<\/strong> and in <strong>real-time. <\/strong>It usually includes a dashboard that is made up of graphic elements showing changes to various different indicators.<\/p>\n<p>Customer satisfaction barometers are becoming more and more common in retail. This is because retail professionals are aware that they can no longer rely only on their offering of products or services to differentiate their company. Their main differentiating factor is now the <strong>quality of the customer experience.<\/strong><\/p>\n<p>The customer experience refers to <strong>all feelings and emotions <\/strong>that customers have <strong>towards the brand<\/strong>. The customer experience is created through interactions between the customer and the brand, before, during and after making a purchase. It determines customers’ image of the brand, as well as their degree of satisfaction. A positive customer experience leads to increased customer satisfaction, and vice versa.<\/p>\n<h3>How can a brand build customer loyalty?<\/h3>\n<p>Of course, through the products that they sell, but this is only one aspect of the customer experience, and not necessarily the most important one. Above all, customer loyalty is based on the quality of the service, advice and information provided by customer service representatives, the ambience and cleanliness of the store, customized offerings, etc.<\/p>\n<p>To<strong> increase customer loyalty <\/strong>and <strong>attract new customers,<\/strong> retail chains need to prioritize customer satisfaction. In addition to the many other benefits of focusing on customer satisfaction, it is a <strong>key driver of business performance. <\/strong><\/p>\n<p>Your barometer is the <strong>foundation of your strategy<\/strong> to increase customer satisfaction. It enables you to:<\/p>\n<ul>\n<li><strong>Continuously <\/strong>track changes in customer satisfaction ratings.<\/li>\n<li><strong>Make informed decisions <\/strong>and effectively manage your <strong>customer-centric approach.<\/strong><\/li>\n<li>Quickly identify any <strong>issues<\/strong> that may be lowering your customer satisfaction scores.<\/li>\n<li>Inspire, motivate, and more effectively manage your company’s teams, the driving force of your company.<\/li>\n<\/ul>\n<h2>Which customer satisfaction indicators to include in a barometer?<\/h2>\n<p>Before creating your barometer, it is important to <strong>decide which customer satisfaction indicators<\/strong> you would like to track, as these will be used to build your dashboard. There are three main indicators that you can use to measure customer satisfaction:<\/p>\n<p> <\/p>\n<h3>1) Net Promoter Score<\/h3>\n<p>The Net Promoter Score, or NPS, helps you determine how likely your clients are to <strong>recommend <\/strong>your company to friends or family. It lets you measure overall satisfaction and shows <strong>how connected your clients feel <\/strong>to your store or brand, thus showing customer loyalty.<\/p>\n<p class=\"discover_more\"><strong>For more information about this important indicator, feel free to take a look at our <a href=\"https:\/\/skeepers.io\/en\/blog\/complete-guide-net-promoter-score-nps\/\">complete guide to the NPS<\/a>.<\/strong><\/p>\n<p> <\/p>\n<h3>2) Customer Satisfaction Score<\/h3>\n<p><a href=\"https:\/\/skeepers.io\/en\/blog\/csat-works-customer-experience-high-priority-metric\/\">The Customer Satisfaction Score<\/a> (CSAT) measures customer satisfaction <strong>following an interaction <\/strong>with your company (for example, communicating with customer service, making a purchase on your website, etc.) You can use it to evaluate specific aspects of the in-store customer experience: the quality of service and advice provided, product availability, accessibility, etc.<\/p>\n<p> <\/p>\n<h3>3) Customer Effort Score<\/h3>\n<p><a href=\"https:\/\/skeepers.io\/en\/blog\/ces-easy-metric-effortless-customer-experience\/\">The Customer Effort Score (CES)<\/a> shows the <strong>amount of effort <\/strong>required by your customers to achieve their objective or take a specific action. The CES is an indirect indicator of customer satisfaction, as it measures the customer experience, which is one element that contributes to the customer’s overall satisfaction. To learn more, watch our <a href=\"https:\/\/skeepers.io\/fr\/blog\/\">webinar on the Customer Effort Score<\/a>.<\/p>\n<p>Of course, you can also use other indicators. For example, you could also measure your customers’ intention to repurchase by asking if they intend to return to the store. This would be another indirect way to measure customer satisfaction.<\/p>\n<p>At the same time, we recommend not including too many indicators on your dashboard. We suggest focusing on two to four indicators, as this will provide more than enough data to offer a detailed look at your customers’ level of satisfaction.<\/p>\n<p> <\/p>\n<h2>Tell a story through your customer satisfaction barometer<\/h2>\n<p>The barometer is a dashboard that consists of different graphic elements (bar charts, pie charts, line charts, rankings, etc.) showing customer satisfaction data and changes to this data over time. To improve the readability of your barometer, we recommend organizing it into categories, going from the most general data to the most detailed. It should not simply look like a list of indicators.<\/p>\n<p>You know you’re heading in the right direction if you have the impression that you’re telling a story as you move through the different sections of your barometer.<\/p>\n<h3> Layout for a customer satisfaction barometer:<\/h3>\n<ul>\n<li><strong>Overall customer satisfaction level <\/strong>for your brand. This section is largely based on the NPS.<\/li>\n<\/ul>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 650px; height: 365px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-satisfaction-dashboard-nps.png\" alt=\"customer-satisfaction-dashboard-nps\" \/><\/p>\n<p> <\/p>\n<ul>\n<li><strong>Customers’ in-store experience. <\/strong>Focusing on their most recent visit, this section shows customer satisfaction at each step of the customer journey.<\/li>\n<\/ul>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 650px; height: 255px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-in-store-experience.png\" alt=\"customer-in-store-experience\" \/><\/p>\n<p> <\/p>\n<ul>\n<li>Focus on <strong>one of your “key moments”. <\/strong>Some moments of the customer journey could present more challenges than others (the checkout process, home delivery, etc.) It’s up to you to choose which steps to analyze, based on your company’s own strong points and areas for improvement. Below is an example for the checkout process:<\/li>\n<\/ul>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 475px; height: 307px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/key-moment-satisfaction-barometer.png\" alt=\"key-moment-satisfaction-barometer\" \/><\/p>\n<p> <\/p>\n<h3>Our recommendations <\/h3>\n<p>We recommend showing your results in numbers as well as in percentages. Your results in numbers are unlikely to convey the desired information unless you compare them to the total number of answers collected. Displaying this information dynamically will make your barometer easier to read.<\/p>\n<p> <\/p>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 471px; height: 312px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/value-dynamic-barometer.png\" alt=\"value-dynamic-barometer\" \/><\/p>\n<p> <\/p>\n<p>We also recommend showing <strong>changes to these indicators,<\/strong> in percentages, and using colour codes and arrows to show if the values are increasing or decreasing (see the example below). Generally speaking, the changes to these values are often more important than the results at any given moment. This is another reason that your barometer should display more than simply the results in numbers.<\/p>\n<p> <\/p>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 314px; height: 205px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/score-figures-evolution.png\" alt=\"score-figures-evolution\" \/><\/p>\n<p align=\"center\"> <\/p>\n<p>Finally, we suggest using filters to help you navigate through your data. These will enable you to customize how your barometer is displayed based on different variables: time periods, characteristics, campaigns, deployments, etc.<\/p>\n<p> <\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 314px; height: 341px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/filter-system-navigation-barometer.png\" alt=\"filter-system-navigation-barometer\" \/><\/p>\n<p> <\/p>\n<p>The dashboards offered by customer knowledge management tools provide a variety of different options for displaying your data (the images in this article are from Feedback Management dashboards.)<\/p>\n<p>Whenever possible, <strong>compare your different indicators.<\/strong> Doing this will enable you to understand any similarities or differences in your data. In this example, we can see a comparison of purchasers’ and visitors’ thoughts on the customer journey.<\/p>\n<p> <\/p>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 395px; height: 307px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/cross-data-analysis-barometer.png\" alt=\"cross-data-analysis-barometer\" \/><\/p>\n<p> <\/p>\n<p>Using several different data collection methods will allow you to obtain enough feedback to continuously update your customer satisfaction barometer in real-time.<\/p>\n<p> <\/p>\n<h2>How should you share your customer satisfaction barometer, and with whom?<\/h2>\n<p>Your barometer should be shared with all of the stakeholders, in order to include them in your customer-centric approach and enable them to see the impact that their work has on customer satisfaction, in real-time.<\/p>\n<p>Additionally, if your retail brand has a national network of stores, you can create a series of different barometers. Each level of the company should have its own barometer, as they will each have different objectives. With this in mind, we recommend creating barometers:<\/p>\n<ul>\n<li><strong>At the national level:<\/strong> This barometer is meant to measure the brand’s overall level of customer satisfaction and track changes to this over time. The “national” barometer can also include regional data, in order to perform detailed and comparative analyses.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 465px; height: 302px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/national-barometer.png\" alt=\"national-barometer\" \/><\/p>\n<p> <\/p>\n<ul>\n<li><strong>the regional level: <\/strong>this barometer enables you to gain a global perspective of customer satisfaction in the region’s different stores. At this level, you can compare both the performance of the various different stores, as well as compare each store’s performance with regional and national averages.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 500px; height: 236px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/regional-barometer.png\" alt=\"regional-barometer\" \/><\/p>\n<p> <\/p>\n<ul>\n<li><strong>At a local level,<\/strong> meaning at the point of sale. For this barometer, we recommend including data that will be helpful for the store’s staff. This “store-level” barometer can also display results for the store’s different departments.<\/li>\n<\/ul>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 600px; height: 283px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/satisfaction-barometer-department.png\" alt=\"satisfaction-barometer-department\" \/><\/p>\n<p> <\/p>\n<h3>Our recommendations<\/h3>\n<p>You may wish to share your customer satisfaction results with the public (e.g. “90% customer satisfaction”). This can help improve customer perception regarding your point of sale, especially when the store has high customer satisfaction ratings.<\/p>\n<p>We recommend choosing a tool that will enable you to manage your various different barometers, as well as sharing permissions. With some tools, you can generate statistical reports based on filtered dashboards. These reports offer a snapshot of customer satisfaction at a given moment, and can be shared with collaborators, either occasionally or on a regular basis, by email or via a URL. This allows management to maintain control over how these dashboards are organized and shared.<\/p>\n<p> <\/p>\n<p align=\"center\"><img decoding=\"async\" style=\"width: 650px; height: 426px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/share-barometer.png\" alt=\"share-barometer\" \/><\/p>\n<p> <\/p>\n<p>Another option is to <strong>give your collaborators access to the platform <\/strong>used to manage your barometers. Using a SaaS solution makes this easier, as your collaborators are able to access the barometers that they need and track changes to customer satisfaction data in real-time. It’s up to you to choose the approach that works best for your company.<\/p>\n<p> <\/p>\n<h2>How should I collect data at the point of sale?<\/h2>\n<p>So you’ve designed your barometer and chosen indicators that will let you measure customer satisfaction in real-time — now you just need data. You’ll need to choose data collection strategies that will let you add data to your barometer and track changes to your indicators in real-time.<\/p>\n<p>In the world of retail, there are various techniques that are used to collect customer satisfaction data. We do not recommend surveying customers too long after the purchase\/interaction in question, as these surveys do not enable you to continuously add “real-time” data to your dashboards.<\/p>\n<p>Using mystery shoppers is also not an ideal method for obtaining data for your barometer. We generally recommend focusing on collecting feedback soon after the customer’s purchase or interaction with your brand, using a method that lets you add data to your barometer in real-time. Here are a few options:<\/p>\n<p> <\/p>\n<ul>\n<li><strong>Self-checkout surveys. <\/strong>This strategy has notably been used by Ikea: after a customer has used the self-checkout and paid for their purchases, they are invited to rate their experience.<\/li>\n<li><strong>Cash register receipts.<\/strong> On the back of their receipts, Burger King invites customers to take an online survey, offering a free hamburger to those who participate.<\/li>\n<li><strong>Customer loyalty programs. <\/strong>You can send customer satisfaction surveys to customers who have subscribed to loyalty programs, by email or text message, as part of your relational marketing campaigns.<\/li>\n<li><strong>Surveys using tablets. <\/strong>With this type of survey, feedback is collected from customers in-store.<\/li>\n<li><strong>QR Codes<\/strong>. These allow customers to access surveys via their smartphones. QR codes can be displayed at the entry of the store, at the cash register, on receipts, etc.<\/li>\n<li>Intelligent survey <strong>solutions. <\/strong>This option allows you to send customized and targeted surveys across various different channels, including websites, social media, email, mobile apps, etc.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 289px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/intelligent-survey.png\" alt=\"intelligent-survey\" \/><\/p>\n<p> <\/p>\n<h3>In conclusion<\/h3>\n<p>Remember that, first and foremost, the customer satisfaction barometer should assist you with your decision-making process. By analyzing indicators and changes to these over time, you can determine which specific actions you can take to improve the customer experience, and measure the impact of these actions in real time. The customer satisfaction barometer is a tool that can help you effectively steer your <a href=\"https:\/\/skeepers.io\/en\/blog\/crucial-steps-creating-customer-centric-business\/\">customer-centric<\/a> strategies at both a national and local level.<\/p>\n<p><!-- end HubSpot Call-to-Action Code --><\/p>\n<p> <\/p>\n\n\n<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-381919ff-e7c9-4fd1-aff8-9ed948a2e4e6\"><span class=\"hs-cta-node hs-cta-381919ff-e7c9-4fd1-aff8-9ed948a2e4e6\" id=\"hs-cta-381919ff-e7c9-4fd1-aff8-9ed948a2e4e6\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"><\/div><![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/381919ff-e7c9-4fd1-aff8-9ed948a2e4e6\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"hs-cta-img\" id=\"hs-cta-img-381919ff-e7c9-4fd1-aff8-9ed948a2e4e6\" style=\"border-width:0px;\" height=\"340\" width=\"1700\" src=\"https:\/\/no-cache.hubspot.com\/cta\/default\/20304540\/381919ff-e7c9-4fd1-aff8-9ed948a2e4e6.png\" alt=\"2023-EN-SKP-FM-CTA-Discover our solution\"><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"> hbspt.cta.load(20304540, '381919ff-e7c9-4fd1-aff8-9ed948a2e4e6', {\"useNewLoader\":\"true\",\"region\":\"na1\"}); <\/script><\/span><!-- end HubSpot Call-to-Action Code -->\n","protected":false},"excerpt":{"rendered":"<p>Retail professionals are aware of the importance of customer satisfaction and a positive in-store customer experience. In order to increase customer loyalty and grow their client base through word-of-mouth. For some brands, monitoring customer satisfaction has become equally as important as tracking turnover or net earnings. When creating your customer satisfaction strategy, it is essential&#8230;<\/p>\n","protected":false},"author":5,"featured_media":119501,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[160,136],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Retail: Create your ideal customer satisfaction barometer<\/title>\n<meta name=\"description\" content=\"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Retail: Create your ideal customer satisfaction barometer\" \/>\n<meta property=\"og:description\" content=\"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2019-02-12T23:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:18:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2019\/02\/Compression-Template-Blog-9-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1500\" \/>\n\t<meta property=\"og:image:height\" content=\"844\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/\",\"name\":\"Retail: Create your ideal customer satisfaction barometer\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2019-02-12T23:00:00+00:00\",\"dateModified\":\"2023-09-15T12:18:00+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Retail: Create your ideal customer satisfaction barometer\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Retail: Create your ideal customer satisfaction barometer","description":"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/","og_locale":"en_US","og_type":"article","og_title":"Retail: Create your ideal customer satisfaction barometer","og_description":"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.","og_url":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/","og_site_name":"Skeepers","article_published_time":"2019-02-12T23:00:00+00:00","article_modified_time":"2023-09-15T12:18:00+00:00","og_image":[{"width":1500,"height":844,"url":"https:\/\/skeepers.io\/app\/uploads\/2019\/02\/Compression-Template-Blog-9-1.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/","url":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/","name":"Retail: Create your ideal customer satisfaction barometer","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2019-02-12T23:00:00+00:00","dateModified":"2023-09-15T12:18:00+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"When creating your customer satisfaction strategy, it is essential to also develop an effective reporting system.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/create-customer-satisfaction-barometer\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"Retail: Create your ideal customer satisfaction barometer"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15850"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15850"}],"version-history":[{"count":17,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15850\/revisions"}],"predecessor-version":[{"id":120278,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15850\/revisions\/120278"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/119501"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15850"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15850"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15850"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15850"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}