{"id":15895,"date":"2019-08-25T22:00:00","date_gmt":"2019-08-25T22:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/top-brands-collect-customer-feedback\/"},"modified":"2023-09-15T13:19:19","modified_gmt":"2023-09-15T12:19:19","slug":"top-brands-collect-customer-feedback","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/","title":{"rendered":"How 10 Top Brands Collect Customer Feedback"},"content":{"rendered":"\n<p>You have one of two choices to make when deciding what customers want from your product. Either you engage in guesswork or reach out to them to find out what they need.<\/p>\n\n\n\n<p>As it turns out, it looks like many companies are still engaging in guesswork. A <a href=\"https:\/\/blog.hubspot.com\/service\/state-of-service-2019-customer-first\" target=\"_blank\" rel=\"noopener\">recent Hubspot study found that <\/a>a full 42% of companies don&#8217;t survey their customers or collect feedback.<\/p>\n\n\n\n<p>Once you understand what customers need, it becomes relatively easy to provide those features in your product. It also becomes relatively easy to retain customers — since they won’t have to go elsewhere when you’re doing what they expect from you.<\/p>\n\n\n\n<p>So yes, feedback is crucial. But the question is how do you get it? For answers, I’ve collated how ten top brands effectively get customer feedback so you can learn from them.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap1\">1- SiteGround<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.siteground.com\/\" target=\"_blank\" rel=\"noopener\">SiteGround<\/a> is one of the most popular webhost providers on the Internet. They’ve won several awards, from <em>Best Hosting Support <\/em>to <em>Hosting Uptime Award<\/em> to <em>Best Shared Hosting<\/em>.<\/p>\n\n\n\n<p>But the brand doesn’t seem to let its success go to its head. <strong>It prioritizes the value of customer feedback<\/strong>. SiteGround provides three different channels through which customers leave feedback 24\/7: tickets, live chat and phone.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/feedback-4.jpg\" alt=\"feedback customer\" class=\"wp-image-18429\"\/><\/figure>\n\n\n\n<p>On top of these three customer feedback channels, the hosting service takes it further by asking users to rate each customer service rep that attends to them after a live chat. Once you finish chatting with a SiteGround rep and close the chat window, you’ll be automatically redirected to a new window where you’re asked rate your experience with the rep.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/top-brands.jpg\" alt=\"top brands\" class=\"wp-image-18432\"\/><\/figure>\n\n\n\n<p>Once you rate the agent by tapping anywhere from one to five stars and clicking the <strong>Rate <\/strong>button, you’re redirected to another window where you’re asked to leave a review.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-answer-1.jpg\" alt=\"customer feedback\" class=\"wp-image-18436\"\/><\/figure>\n\n\n\n<p>After clicking the <strong>Submit a review <\/strong>button, you’ll be redirected to <a href=\"https:\/\/www.yelp.com\/\">Yelp<\/a> — a third party site where the feedback you submit is seen by other people looking for reviews about the brand.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/feedback-customer.jpg\" alt=\"\" class=\"wp-image-18438\"\/><\/figure>\n\n\n\n<p class=\"rtecenter\">&nbsp;<\/p>\n\n\n\n<p class=\"rtecenter\"><a href=\"https:\/\/www.yelp.com\/writeareview\/biz\/O8YCXrIWtrzlMa0drw2Pvg?return_url=%2Fbiz%2FO8YCXrIWtrzlMa0drw2Pvg\" target=\"_blank\" rel=\"noopener\"><em>Image source<\/em><\/a><\/p>\n\n\n\n<p>SiteGround is one of those businesses who see that <strong>customer feedback is as important as the business itself.<\/strong> And this is why they’ve made it super easy for their users to leave reviews about their brand and service.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap2\">2- Hyatt<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.hyatt.com\/\">Hyatt<\/a> is a hotel that is well-known for delivering great customer experiences. They seem to always know what their users want when they want it. How do they do this? They’ve built their entire brand around customer feedback. Virtually every company that’s been able to figure out most of their customer needs has a great feedback gathering process. And Hyatt is no different.<\/p>\n\n\n\n<p>The multinational franchiser of hotels uses two main channels to collect feedback from customers:<\/p>\n\n\n\n<ol>\n<li>Social media (Twitter and Instagram hashtags).<\/li>\n\n\n\n<li>A feedback form on target pages on their site.<\/li>\n<\/ol>\n\n\n\n<p><strong>For (1) social media<\/strong>, they encourage customers to share their experiences with their hotels, resorts or vacation properties on Twitter and Instagram using any of their two hashtags — <a href=\"https:\/\/www.instagram.com\/explore\/tags\/worldofhyatt\/\">#WorldOfHyatt<\/a> and <a href=\"https:\/\/www.instagram.com\/explore\/tags\/worldofunderstanding\/\" target=\"_blank\" rel=\"noopener\">#WorldOfunderstanding<\/a>.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/instagram-feedback.jpg\" alt=\"instagram feedback\" class=\"wp-image-18439\"\/><\/figure>\n\n\n\n<p class=\"rtecenter\">&nbsp;<\/p>\n\n\n\n<p class=\"rtecenter\"><a href=\"https:\/\/www.instagram.com\/p\/Ba3feV3F_aD\/?tagged=worldofhyatt\"><em>I<\/em><\/a><a href=\"https:\/\/www.instagram.com\/p\/Ba3feV3F_aD\/?tagged=worldofhyatt\" target=\"_blank\" rel=\"noopener\"><em>mage source<\/em><\/a><\/p>\n\n\n\n<p>This is one easy way to get feedback because users already want to share their experiences with friends on social media when they visit interesting places like Hyatt hotels and resorts.<\/p>\n\n\n\n<p>So it’s a win-win for the brand and its consumers: customers share beautiful pictures of themselves in Hyatt’s properties with their friends on social media and Hyatt gets the feedback (and publicity, too).<\/p>\n\n\n\n<p><strong>For (2) feedback forms on target pages on their site, <\/strong>Hyatt adds a special “feedback” button on their hotel reservation page (and even some other pages, too):<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/feedback-arrow.jpg\" alt=\"feedback arrow\" class=\"wp-image-18441\"\/><\/figure>\n\n\n\n<p class=\"rtecenter\">&nbsp;<\/p>\n\n\n\n<p class=\"rtecenter\"><a href=\"https:\/\/www.hyatt.com\/shop\/sharm?rooms=1&amp;adults=1&amp;location=Hyatt%20Regency%20Sharm%20El%20Sheikh%20Resort&amp;checkinDate=2017-11-01&amp;checkoutDate=2017-11-02&amp;kids=0\" target=\"_blank\" rel=\"noopener\"><em>Image source<\/em><\/a><\/p>\n\n\n\n<p>Once that button is clicked through, you get this box below (in the red square) where you can leave feedback about your experience with the brand:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/feedback-website.jpg\" alt=\"feedback website\" class=\"wp-image-18442\"\/><\/figure>\n\n\n\n<p>This way, Hyatt is collecting feedback from multiple sources and that plays a major role in how they seem <strong>to always be able to “figure out” who their customers are and what they want.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\">Read more on <strong>How Hyatt rebranded their business with customer feedback here.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap3\">3- UBER<\/h2>\n\n\n\n<p>One of the things Uber drivers are known for these days is how much they care about their ratings. This is because, if users (riders) keep rating them poorly, they get in trouble with the car sharing service.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/uber.jpg\" alt=\"uber\" class=\"wp-image-18443\"\/><\/figure>\n\n\n\n<p>Uber has this on their <a href=\"https:\/\/newsroom.uber.com\/feedback-is-a-2-way-street\/\">website<\/a>:<\/p>\n\n\n\n<p>“Real-time feedback about drivers means Uber can correct for issues big and small – while ensuring that only the best drivers stay on the road. We take this feedback seriously – depending on the circumstances, rider feedback may lead to deactivating a partner from the system or serve as validation that the driver is providing great service.”<\/p>\n\n\n\n<p>So once Uber notices a certain driver has been getting too many downvotes from users, it penalizes the driver. In other words, feedback pretty much determines who drives (makes money) on Uber and who doesn’t.<\/p>\n\n\n\n<p>And they made it so easy for riders to leave the feedback:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/uber-feedback.jpg\" alt=\"uber feedback\" class=\"wp-image-18444\"\/><\/figure>\n\n\n\n<p class=\"rtecenter\">&nbsp;<\/p>\n\n\n\n<p class=\"rtecenter\"><em>Image source: <\/em><a href=\"https:\/\/techcrunch.com\/2016\/11\/21\/uber-debuts-compliments-letting-riders-give-drivers-specific-positive-feedback\/\" target=\"_blank\" rel=\"noopener\"><em>Techcrunch<\/em><\/a><\/p>\n\n\n\n<p>With simple taps on the mobile app, you can rate a driver anywhere from zero to five stars, and even add comments if you have anything to say.<\/p>\n\n\n\n<p class=\"discover_more\"><strong>Like what you read? We’ve written a full post on How Uber delivers an excellent customer experience.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap4\">4- Dell<\/h2>\n\n\n\n<p>If there’s a brand that once suffered majorly from a backlash due to the lack of gathering customer feedback, it’s <a href=\"http:\/\/www.dell.com\/\" target=\"_blank\" rel=\"noopener\">Dell<\/a>.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/laptop-website.jpg\" alt=\"laptop website\" class=\"wp-image-18445\"\/><\/figure>\n\n\n\n<p>This giant computer brand had the whole internet against it when a dear user was dissatisfied by a Dell product. If they’d been listening to customers before they had an unhappy user turn on them, maybe they’d have been able avoid the unfortunate flack they received.<\/p>\n\n\n\n<p>But of course, Dell learned from the situation.<\/p>\n\n\n\n<p>Former Vice President of Global Services at Dell, Jan Uhrich, said: “We believe that through customer feedback, we are able to grow and evolve our solutions for increased efficiency and ever-better customer satisfaction. Consistent results across multiple categories exemplify Dell’s dedication to putting customers first.”<\/p>\n\n\n\n<p>So how does Dell now collect feedback? <a href=\"http:\/\/www.ideastorm.com\/\" target=\"_blank\" rel=\"noopener\">IdeaStorm<\/a>.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/website-intro.jpg\" alt=\"website intro\" class=\"wp-image-18447\"\/><\/figure>\n\n\n\n<p>The computer giant began to take feedback so seriously that they built a separate website (IdeaStorm) just for Dell users to leave reviews and complaints. And reviews that get the most comments and votes from other Dell users on the forum become prioritized and <strong>taken more seriously by the company.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\"><strong>Read more on How Listening to Customers Helped Dell Leap from Worst to First.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap5\">5- Apple<\/h2>\n\n\n\n<p>Whether it’s their watches, phones, desktops or laptops, <a href=\"https:\/\/www.apple.com\/\" target=\"_blank\" rel=\"noopener\">Apple<\/a> marketers operate like mind readers of their target audience. They keep releasing new versions of their products and customers don’t seem to get tired of buying them. Why? Apple makes collecting feedback a major priority.<\/p>\n\n\n\n<p>Steve Jobs <a href=\"https:\/\/youtu.be\/lQadOr9B7Qc\" target=\"_blank\" rel=\"noopener\">once said<\/a>:<\/p>\n\n\n\n<p>“And one of the things I’ve always found is that — you’ve got to start with the customer experience and work backwards to the technology. You can’t start with the technology and try to figure out where you’re going to try to sell it. And I’ve made this mistake probably more than anybody else in this room. And I’ve got the scar tissue to prove it. And I know that it’s the case.”<\/p>\n\n\n\n<p>So how does Apple collect feedback? One of their most visible customer feedback channels is the Net Promoter Score (NPS) system:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/apple-watch.jpg\" alt=\"apple watch feedback\" class=\"wp-image-18448\"\/><\/figure>\n\n\n\n<p class=\"rtecenter\">&nbsp;<\/p>\n\n\n\n<p class=\"rtecenter\"><em>Image source: <\/em><a href=\"https:\/\/hiverhq.com\/blog\/collect-customer-feedback\/\" target=\"_blank\" rel=\"noopener\"><em>Hiver<\/em><\/a><em>. <\/em><\/p>\n\n\n\n<p>The NPS helps you ask customers the simple “How likely are you to recommend this business to a friend or colleague?” question. On the scale of one to ten, users who rate you anywhere from zero to six are not so likely to recommend you; they’re called <strong>detractors<\/strong>. Those who rate you between seven to ten are more likely to recommend your business — these users are known as <strong>promoters<\/strong>.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/NPS.jpg\" alt=\"NPS score\" class=\"wp-image-18449\"\/><\/figure>\n\n\n\n<p><em>Image source: <\/em><a href=\"https:\/\/www.atlassian.com\/agile\/how-to-prioritize-features-using-net-promoter-scores\"><em>Atlassian<\/em><\/a><\/p>\n\n\n\n<p>If you get more promoters than detractors, your Net Promoter Score will be positive. And if your detractors are greater than promoters, you’ll get a negative score. <strong>A positive NPS simply means most of your customers are happy with your business. But a negative score means you’ll need to dig deeper and find out what you need to do to improve customer satisfaction.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\"><strong>You can read more about How Customer Feedback Surveys Helps Apple Maintains Industry Leadership here.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap6\">6- Timberland<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.timberland.co.uk\/\" target=\"_blank\" rel=\"noopener\">Timberland<\/a> is a huge footwear brand in the fashion industry.<\/p>\n\n\n\n<p>There was a time the brand felt all they needed to know about their customers is that they are shoe lovers (and they are!). But after long years of a blurred product roadmap and unfocused marketing efforts, <strong>Timberland finally realized they needed to get closer to their customers and find out who they really were, above and beyond their adoration of shoes.<\/strong><\/p>\n\n\n\n<p>Former Brand President at Timberland, Stewart Whitney, <a href=\"http:\/\/fortune.com\/2015\/10\/13\/retooled-timberland\/\">said<\/a>: “When you go after lots of consumers, with lots of messages, the odds are higher for a misfire&#8230;The fact that we didn’t stand for anything distinctly meant we didn’t really resonate.”<\/p>\n\n\n\n<p>So the brand decided customer feedback had to be a priority for them if they were ever going to be able to target a specific audience and boost revenue. Timberland then teamed up with global retailer VF Corp and collected customer feedback from 18,000 buyers in eight countries.<\/p>\n\n\n\n<p>Now if you shop on the <a href=\"https:\/\/www.timberland.co.uk\/shop\/en\/tbl-uk\/men-clothing-coats-jackets\/mens-goose-eye-parka-blue-a1ny1g58\">Timberland<\/a> site, you’re encouraged to write a review.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/timberland-coat.jpg\" alt=\"timberland coat\" class=\"wp-image-18450\"\/><\/figure>\n\n\n\n<p>On top of that, Timberland also encourages customers to leave feedback via a button on the right side of most of their webpages:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/timberland-feedback.jpg\" alt=\"timberland feedback\" class=\"wp-image-18451\"\/><\/figure>\n\n\n\n<p>Once that button is clicked, you get redirected to a page where you’re asked to submit customer feedback:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/timberland-test.jpg\" alt=\"timberland test\" class=\"wp-image-18452\"\/><\/figure>\n\n\n\n<p>This way, Timberland has moved on from guessing <strong>what their customers need from their brand to actually finding out what they need by asking them.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\"><strong>Read more on How Customer Knowledge Got Timberland Back on Track.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap7\">7- Nordstrom<\/h2>\n\n\n\n<p>Top fashion retailer <a href=\"https:\/\/shop.nordstrom.com\/\">Nordstrom<\/a> is another brand that is well-known for being up-to-date with the expectations of customers. And what’s their secret formula for knowing what their customers need and when they need it?<\/p>\n\n\n\n<p>You guessed right: customer feedback. Nordstrom uses quite a lot of their resources to gather data from their customers. One of the most notable customer feedback generation efforts for the brand is <em>Innovation Lab.<\/em><\/p>\n\n\n\n<p>They established this <em>lab <\/em>as a means for their employees to see what information their customers have provided so far, and encourage employee input on how Nordstrom can serve the public better using that information.<\/p>\n\n\n\n<p>Data Scientist at Nordstrom Innovation Lab, Erin Shellman, puts it this way: “The goal of the <em>Nordstrom Data Lab<\/em> is to deliver data-driven products to inform business decisions internally, and to enhance customer experience externally.”<\/p>\n\n\n\n<p>Another notable feedback tool Nordstrom uses is a form that pops out right in the middle of your screen after you’ve spent some time on their site.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/feedback-web.jpg\" alt=\"feedback web\" class=\"wp-image-18453\"\/><\/figure>\n\n\n\n<p><strong>Through these means, the fashion brand is able to seamlessly collect information from customers and react accordingly to keep satisfying them.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\"><strong>Learn more on&nbsp;How Customer Satisfaction ranks Nordstrom at the top of its industry.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap8\">8- Deezer<\/h2>\n\n\n\n<p>After Spotify, <a href=\"https:\/\/www.deezer.com\/en\/\" target=\"_blank\" rel=\"noopener\">Deezer<\/a> is arguably the most popular music streaming site today. The company launched in 2007 and now has over 16 million active listeners, about 5 million of whom pay for access to an impressive catalog of over 35 million songs.<\/p>\n\n\n\n<p>But as virtually every brand out there has started catching up with the customer feedback trend — seeing the value in it, Deezer has also launched the Deezer Community to always be updated on what consumers are saying about them.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/community.jpg\" alt=\"community feedback\" class=\"wp-image-18454\"\/><\/figure>\n\n\n\n<p>They created this community with the aim of having their users talk to one another about music and Deezer. It’s a new development in their company that just launched about a week ago — October 30, 2017. In the <a href=\"http:\/\/www.deezer-blog.com\/music-lovers-unite-join-the-brand-new-deezer-community\/\">news<\/a> on their site, Deezer says:<\/p>\n\n\n\n<p>“There’s no better way to discover music than through other people. As the saying goes, the more we share the more we have. Whether you’ve first discovered music through your older brother’s rap tapes, your mother’s favorite radio station or your father’s vinyls, the fact remains that music has so much more meaning when it is shared. This is why we’ve created the Deezer Community, so you can share your thoughts on music and find music lovers like you.”<\/p>\n\n\n\n<p>So for Deezer, starting a community where users and customers talk to one another is <strong>the way to go to keep up-to-date and savvy about what consumers are saying and thinking.<\/strong><\/p>\n\n\n\n<p class=\"discover_more\"><strong>More info here: How customer centricity allows Deezer to boost subscriptions.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap9\">9- Best Buy<\/h2>\n\n\n\n<p><a href=\"https:\/\/www.bestbuy.com\/\" target=\"_blank\" rel=\"noopener\">Best Buy<\/a> is a giant consumer electronics company in America.<\/p>\n\n\n\n<p>The uses <a href=\"https:\/\/skeepers.io\/en\/blog\/how-customer-feedback-helped-best-buy-reinvent-itself\/\">a number of channels<\/a> to collect feedback, but one that’s really notable is how it rewards customers to write reviews about its brand and products. Once you purchase an item on their site and leave a review, you get rewarded with bonus points.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/best-buy-bonus.jpg\" alt=\"best buy bonus\" class=\"wp-image-18455\"\/><\/figure>\n\n\n\n<p>Every customer who writes a review scores 25 bonus points which can be redeemed when they’re&nbsp; next making purchases on Best Buy. The concept works for customers who think, “Why don’t I just write the review and earn free money?” And who doesn’t like freebies?<\/p>\n\n\n\n<p class=\"discover_more\"><strong>Want more info? Read more on&nbsp;How Customer Feedback Helped Best Buy Reinvent Itself<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chp10\">10- Starbucks<\/h2>\n\n\n\n<p>American Coffeehouse chain <a href=\"https:\/\/www.starbucks.com\/\">Starbucks<\/a> launched My Starbucks Idea back in 2008 — when the company decided they needed to really start listening to customers. In that year alone, they got over 70,000 responses from customers and over 190,000 by 2015 (according to Waterloo).<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/starbucks.jpg\" alt=\"starbucks feedback\" class=\"wp-image-18456\"\/><\/figure>\n\n\n\n<p>The company’s ability to successfully use technology to engage with customers has added value to the company. It has created a robust and loyal consumer following, giving customers a place to voice ideas and the company a place to directly respond.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/consumer-facts.jpg\" alt=\"consumer facts\" class=\"wp-image-18457\"\/><\/figure>\n\n\n\n<p class=\"discover_more\">&nbsp;<\/p>\n\n\n\n<p class=\"discover_more\">This way, Starbucks collects ideas and feedback from its customers&nbsp;and act on the ones that really matter.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Now let’s put them all together<\/h2>\n\n\n\n<p>What customers want more than anything is total convenience.<\/p>\n\n\n\n<p>That’s one lesson you should draw from all the brands above. Make your feedback collection process as easy as pie. You’ve seen how every brand above uses the following tools to make it easy for users to leave feedback:<\/p>\n\n\n\n<ul>\n<li>Feedback buttons on specific pages<\/li>\n\n\n\n<li>Pop-up customer feedback forms<\/li>\n\n\n\n<li>Loyalty programs<\/li>\n\n\n\n<li>Net Promoter Score (NPS)<\/li>\n\n\n\n<li>Social media hashtags<\/li>\n\n\n\n<li>Automatic redirects to new windows encouraging customers to leave feedback<\/li>\n\n\n\n<li>Automatic redirects to Yelp (the third party review site) asking for feedback<\/li>\n\n\n\n<li>Communities\/forums and dedicated customer feedback sites<\/li>\n<\/ul>\n\n\n\n<p>All these are about making it easy for the customer to leave feedback. And a tool like <a href=\"https:\/\/skeepers.io\/en\/\" target=\"_blank\" rel=\"noreferrer noopener\"><b>Skeepers <\/b><\/a>can be a great help here. It has features in place to help you easily collect customer feedback and turn them into business opportunities for your organization. Feel free to get a demo and <strong>see how it works here<\/strong>.<\/p>\n\n\n\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-321b1306-bd2d-4e2d-8ffc-8620e7b5f807\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-321b1306-bd2d-4e2d-8ffc-8620e7b5f807\" class=\"hs-cta-node hs-cta-321b1306-bd2d-4e2d-8ffc-8620e7b5f807\"><!-- [if lte IE 8]>\n\n\n<div id=\"hs-cta-ie-element\"><\/div>\n\n\n<![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/321b1306-bd2d-4e2d-8ffc-8620e7b5f807\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" id=\"hs-cta-img-321b1306-bd2d-4e2d-8ffc-8620e7b5f807\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/321b1306-bd2d-4e2d-8ffc-8620e7b5f807.png\" alt=\"Memo 10 Ideas of Smart Questionnaires to Deploy on Your Website\" width=\"700\" height=\"231\"><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"> hbspt.cta.load(20304540, '321b1306-bd2d-4e2d-8ffc-8620e7b5f807', {\"useNewLoader\":\"true\",\"region\":\"na1\"}); <\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You have one of two choices to make when deciding what customers want from your product. Either you engage in guesswork or reach out to them to find out what they need. As it turns out, it looks like many companies are still engaging in guesswork. A recent Hubspot study found that a full 42%&#8230;<\/p>\n","protected":false},"author":5,"featured_media":22609,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How 10 Top Brands Collect Customer Feedback - Skeepers<\/title>\n<meta name=\"description\" content=\"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How 10 Top Brands Collect Customer Feedback - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2019-08-25T22:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:19:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-feedback.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1080\" \/>\n\t<meta property=\"og:image:height\" content=\"584\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"17 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/\",\"name\":\"How 10 Top Brands Collect Customer Feedback - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2019-08-25T22:00:00+00:00\",\"dateModified\":\"2023-09-15T12:19:19+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How 10 Top Brands Collect Customer Feedback\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How 10 Top Brands Collect Customer Feedback - Skeepers","description":"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/","og_locale":"en_US","og_type":"article","og_title":"How 10 Top Brands Collect Customer Feedback - Skeepers","og_description":"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.","og_url":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/","og_site_name":"Skeepers","article_published_time":"2019-08-25T22:00:00+00:00","article_modified_time":"2023-09-15T12:19:19+00:00","og_image":[{"width":1080,"height":584,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-feedback.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"17 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/","url":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/","name":"How 10 Top Brands Collect Customer Feedback - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2019-08-25T22:00:00+00:00","dateModified":"2023-09-15T12:19:19+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Feedback is crucial. But how do you get it? We&#039;ve collated how ten top brands effectively get customer feedback to learn from them.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/top-brands-collect-customer-feedback\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"How 10 Top Brands Collect Customer Feedback"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15895"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15895"}],"version-history":[{"count":7,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15895\/revisions"}],"predecessor-version":[{"id":122573,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15895\/revisions\/122573"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/22609"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15895"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15895"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15895"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}