{"id":15891,"date":"2020-01-29T23:00:00","date_gmt":"2020-01-29T23:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/insurance-smart-survey-solution\/"},"modified":"2023-09-15T13:20:26","modified_gmt":"2023-09-15T12:20:26","slug":"insurance-smart-survey-solution","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/","title":{"rendered":"Insurance: 7 reasons to use a smart survey solution"},"content":{"rendered":"<p>Under the Insurance Distribution Directive (IDD), insurance distributors are now required to collect data about prospective customers. They can thus prove that <strong>recommendations made to a consumer meet their needs as closely as possible<\/strong>. Customer knowledge is no longer just a marketing requirement to improve conversion rates, but a legal obligation. A smart survey solution is the ideal tool to comply with this directive!<\/p>\n<p>Throughout this article, we would like to share the advantages <strong>a smart survey solution<\/strong> can offer to improve your insurance company’s services and products. If you work in the insurance industry, what follows should be of interest to you!<\/p>\n<p>In 2017, Indiko, an Afnor Group barometer, measured customer experience in the insurance industry. 12 criteria were evaluated. The results show that <strong>customer satisfaction is struggling to take off<\/strong> in this sector. But this is not a foregone conclusion and things are starting to change!<\/p>\n<p>Some players in the insurance industry have decided to consistently involve the customer in their continuous improvement process. And the results are there to see. To help you understand how to benefit from a feedback management tool in practical terms, we have selected 7 use cases that have proven their effectiveness.<\/p>\n<h2>1) Increasing the number of insurance sales<\/h2>\n<p>This is a challenge for any insurance company. The performance of the application process, in particular converting prospects into customers, depends on several factors. The two most import are firstly, the attractiveness of the offer (value for money, competitiveness, etc.) and secondly, the <strong>quality of the application process<\/strong>, in particular the quality of the relationship between sales agents and prospects or customers.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 300px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-1.jpg\" alt=\"\" \/><\/p>\n<p>A smart survey solution can play an important role in improving the application journey. Here are 2 examples of how they can be used:<\/p>\n<h3>a. Deploying a campaign to collect new policy holders’ feedback<\/h3>\n<p>This “post-sale” campaign can be deployed by email and sent automatically several days after signature of the contract. What questions should be asked in the survey? You can use standard questions or “business” questions &#8211; most importantly, you should be able to build indicators with the answers you collect. We recommend using for example:<\/p>\n<ul>\n<li><a href=\"https:\/\/skeepers.io\/en\/blog\/complete-guide-net-promoter-score-nps\/\" target=\"_blank\" rel=\"noopener\">The Net Promoter Score<\/a> (NPS) in order to measure the recommendation likelihood of your new insurance holders. This indicator helps measure customer satisfaction (because people only recommend services and products they are satisfied with) and also loyalty potential.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 348px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-nps.jpg\" alt=\"\" \/><\/p>\n<ul>\n<li><a href=\"https:\/\/skeepers.io\/en\/blog\/csat-works-customer-experience-high-priority-metric\" target=\"_blank\" rel=\"noopener\">The Customer Satisfaction Score<\/a> (CSAT), that allows to measure overall satisfaction with regards to the application journey or to measure one or several specific aspects. For example: “How satisfied are you with the support provided by our advisors?”<\/li>\n<li><a href=\"https:\/\/skeepers.io\/en\/blog\/ces-easy-metric-effortless-customer-experience\/\">The Customer Effort Score<\/a> (CES), that allows to measure the (perceived) effort spent by your new policy-holders throughout their application journey. And then, to identify any moments of friction.<\/li>\n<\/ul>\n<p>The answers collected via your survey will enable you to <strong>identify any friction zones<\/strong> and to detect the enchantments and irritants. They will help you select and prioritise the areas for improvement along your application journey.<\/p>\n<p>To improve response rates to smart surveys triggered on your website, Skeepers enables you to:<\/p>\n<ul>\n<li><strong>Integrate specific fields to personalise surveys<\/strong>, by including the name of the insurance product purchased by the customer, for example.<\/li>\n<li><strong>Execute post-answer actions<\/strong>. For example: automatically send a notification to customer services when a policy-holder responds to certain questions with poor ratings.<\/li>\n<\/ul>\n<h3>b. Creating a “quote abandonment” campaign<\/h3>\n<p>The idea is to trigger a survey on your website (in the form of a pop-up for example), when a visitor <strong>is about to abandon a quote request<\/strong>. You can ask them their reasons for abandoning the quote, suggest a call-back or send them to a page on your website to try and re-engage them.<\/p>\n<p>If well-designed, these campaigns can produce excellent results, whether in terms of response rates or re-engagement rates.<\/p>\n<h2>2) Collect verbatims to improve your offers<\/h2>\n<p>You can also <strong>collect suggestions<\/strong> from customers, in view of improving your services and offers. You can collect suggestions at the end of a survey. Verbatims often allow to <strong>identify problems or areas for improvement <\/strong>that you may not previously have thought about. Their content can be very interesting.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 321px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-4.jpg\" alt=\"\" \/><\/p>\n<p>Analysing answers given to open-ended questions is always more complex. To make it easier to process verbatims, you can put in place a <strong>verbatim analysis system<\/strong>, for example. This will make it possible to identify <strong>the “polarity” of certain recurring key words<\/strong> in the answers provided by customers: “warm welcome” will have a positive polarity, whereas “queue” will have a negative one. Skeepers can offer you solutions to analyse verbatims.<\/p>\n<p class=\"discover_more\"><strong>Discover <a href=\"https:\/\/skeepers.io\/en\/blog\/use-open-ended-questions\/\">Why and how to use open-ended questions?<\/a><\/strong><\/p>\n<h2>3) Continually enrich your customer type knowledge<\/h2>\n<p>Your marketing department may have already created <strong>buyer personas<\/strong>. These are <strong>stereotypical fictional characters symbolising a target buyer or user profile<\/strong>, otherwise known as customer “types”. For more information about the benefits of personas, please read our article entitled: “<a href=\"https:\/\/skeepers.io\/en\/blog\/blog-use-buyer-persona-marketing\/\" target=\"_blank\" rel=\"noopener\">5 Reasons to use Personas in your Marketing<\/a>”.<\/p>\n<p>Skeepers allows you to <strong>identify to which persona a prospect or policy-holder responding to your survey matches<\/strong>. When a customer’s answers meets one or more of your persona criteria, a flag can be applied to associate him\/her with the persona in question. This mechanism allows to <strong>continually enrich your personas<\/strong>.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 300px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-2.jpg\" alt=\"\" \/><\/p>\n<p>More widely, answers to your surveys enable you to better know your existing customers and target customers. Surveys are primarily used to measure satisfaction, but they can also be used to collect customer information: socio-demographic data, interests, insurance preferences, personal (e.g. moving house) or professional projects, etc.<\/p>\n<p>The more you know about your customers, the better you can personalise your customer relations and your marketing campaign offers.<\/p>\n<h2>4) Dealing with customer dissatisfaction quickly<\/h2>\n<p><strong>Dealing with dissatisfied customers should be one of your priorities<\/strong>. It is very dangerous to not take care of unhappy customers for at least two reasons:<\/p>\n<ul>\n<li>The risk of them <strong>leaving for a competitor<\/strong> is great.<\/li>\n<li>They can <strong>damage your insurance company’s image<\/strong> with negative word-of-mouth. The rise of social media has considerably increased this risk.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 300px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-3.jpg\" alt=\"\" \/><\/p>\n<p>When a customer expresses dissatisfaction by responding to your survey with poor ratings, it is important to react quickly. We have already seen above how to do this.<\/p>\n<p>With Skeepers, you can offer customers who gave poor ratings a call-back (to the NPS question for example). If the customer replies “yes, I would like to be contacted”, a notification is automatically sent to customer services who can deal with the customer as quickly as possible.<\/p>\n<p>Callbacks allow to identify <strong>the reasons for dissatisfaction<\/strong>, but also to find <strong>solutions to win the customer back<\/strong>. Even if such calls do not resolve the problem, they show customers that you care about them and limit the risk of negative word-of-mouth.<\/p>\n<h2>5) Improving your online customer area<\/h2>\n<p>Online customer areas are becoming a key channel in the insurance industry. A lot of the points of contact between a brand and customer pass through this channel. Which is why it is essential to <strong>measure satisfaction and improve user experience<\/strong>.<\/p>\n<p>How? By deploying <strong>surveys directly on the customer area<\/strong>, for example. To not interfere with user navigation, you could trigger the survey at the end of their visit with an exit pop-up.<\/p>\n<p>ChatSurveys are another possibility. They allow to deploy surveys in the form of a chat. These processes allow to ask your customers questions without disrupting their navigation and to obtain better response rates.<\/p>\n<p>Here are a few examples of questions:<\/p>\n<ul>\n<li>“Are you satisfied with the Customer Area?” (CSAT)<\/li>\n<li>“Does the Customer Area meet your needs?”<\/li>\n<li>“Do you think our Customer Area is easy to use?”<\/li>\n<li>“To what extent would you recommend our brand to those around you?” (NPS)<\/li>\n<\/ul>\n<p>You can end your survey by collecting suggestions.<\/p>\n<h2>6) Improving customer service skills<\/h2>\n<p>Nowadays, <strong>the quality of customer service<\/strong> plays a <strong>major role<\/strong> in a company’s sales performance. Customers are on the lookout for attractive offers and good value for money products. They want a “great deal” but also expect brands to provide quality service and, more specifically, an attentive and efficient customer service. This is true of all industries. But, as mentioned at the beginning of this article, customers are even more demanding when it comes to insurance. The customer sector is, more than anywhere else, an essential channel in this industry.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 321px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-5.jpg\" alt=\"\" \/><\/p>\n<p>A smart survey solution can help you <strong>manage the quality and performance of your customer service<\/strong>. You could send a survey, for example, to anyone who contacted customer service and ask them for feedback. This survey could be sent minutes following their call, by email or SMS.<\/p>\n<p>This survey could seek to measure an agent’s performance, the quality of answers provided, their level of politeness, or perceived skills. An NPS question or suggestions space can be added at the end of the survey.<\/p>\n<h2>7) Managing your customer satisfaction strategy (via dashboards)<\/h2>\n<p>A smart survey solution such as Skeepers enables you to <strong>manage your customer satisfaction strategy via dashboards.<\/strong> Dashboards can be customised to include the indicators of your choice.<\/p>\n<p>Our solution offers a large range of visual options to create both easy-to-read and complete tables.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px;height: 326px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smart-survey-solution-dash.jpg\" alt=\"\" \/><\/p>\n<p>There is also the possibility to build several different dashboards, which is what we would recommend. You could for example create:<\/p>\n<ul>\n<li>One dashboard focusing on applications for the marketing and acquisition teams.<\/li>\n<li>One dashboard for customer service breaking down the data collected via post-call surveys.<\/li>\n<li>One cross-campaign dashboard, displaying your different marketing campaign results, with the possibility of a filter by campaign to monitor performance in real time.<\/li>\n<li>One “Customer Area” dashboard to monitor policy-holder satisfaction with regards to your online customer space.<\/li>\n<\/ul>\n<p>A smart survey tool is also <strong>an employee management tool<\/strong>. It allows to improve internal procedures, measure the impact of implemented operations on a daily basis, guide decisions based on customer feedback, and more broadly, promote a customer-centric culture throughout the organisation. The possibilities for customising dashboards are endless with Skeepers.<\/p>\n<p>We will end with a reminder of the importance of <strong>integrating collected survey data into your CRM<\/strong>. A solution such as Skeepers feeds into your CRM software in real time. We offer native connectors with the CRM market-leaders (Salesforce, Adobe Campaign, Microsoft Dynamics, etc.), an API, webhooks, FTP import\/export solutions, etc.<\/p>\n<p>We hope that this article has given you an idea of the benefits smart survey solutions can offer an insurance company. If you have any questions about our solution, please do not hesitate to <a href=\"https:\/\/www.myfeelback.com\/en\/contact\" target=\"_blank\" rel=\"noopener\">contact us<\/a>. We will be happy to answer!<\/p>\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-dc9fd1e1-c77d-4539-bb92-98a69448daac\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-dc9fd1e1-c77d-4539-bb92-98a69448daac\" class=\"hs-cta-node hs-cta-dc9fd1e1-c77d-4539-bb92-98a69448daac\"><!-- [if lte IE 8]&gt;--><\/p>\n<div id=\"hs-cta-ie-element\"><\/div>\n<p><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/744484\/dc9fd1e1-c77d-4539-bb92-98a69448daac\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" id=\"hs-cta-img-dc9fd1e1-c77d-4539-bb92-98a69448daac\" class=\"hs-cta-img\" style=\"border-width: 0px\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/dc9fd1e1-c77d-4539-bb92-98a69448daac.png\" alt=\"New Call-to-action\" \/><\/a><\/span><br \/>\n<!--\/\/-->\/\/ &gt;<!--\n hbspt.cta.load(744484, 'dc9fd1e1-c77d-4539-bb92-98a69448daac', {}); \n\/\/-->&lt;!<br \/>\n<\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Under the Insurance Distribution Directive (IDD), insurance distributors are now required to collect data about prospective customers. They can thus prove that recommendations made to a consumer meet their needs as closely as possible. Customer knowledge is no longer just a marketing requirement to improve conversion rates, but a legal obligation. A smart survey solution&#8230;<\/p>\n","protected":false},"author":5,"featured_media":22563,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[160,136],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Insurance: 7 reasons to use a smart survey solution - Skeepers<\/title>\n<meta name=\"description\" content=\"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Insurance: 7 reasons to use a smart survey solution - Skeepers\" \/>\n<meta property=\"og:description\" content=\"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2020-01-29T23:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:20:26+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smartsurvey.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/\",\"name\":\"Insurance: 7 reasons to use a smart survey solution - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2020-01-29T23:00:00+00:00\",\"dateModified\":\"2023-09-15T12:20:26+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insurance: 7 reasons to use a smart survey solution\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Insurance: 7 reasons to use a smart survey solution - Skeepers","description":"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/","og_locale":"en_US","og_type":"article","og_title":"Insurance: 7 reasons to use a smart survey solution - Skeepers","og_description":"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.","og_url":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/","og_site_name":"Skeepers","article_published_time":"2020-01-29T23:00:00+00:00","article_modified_time":"2023-09-15T12:20:26+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/insurance-smartsurvey.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/","url":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/","name":"Insurance: 7 reasons to use a smart survey solution - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2020-01-29T23:00:00+00:00","dateModified":"2023-09-15T12:20:26+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"To help you understand how to benefit from a feedback management tool, we have selected 7 use cases that have proven their effectiveness.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/insurance-smart-survey-solution\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"Insurance: 7 reasons to use a smart survey solution"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15891"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15891"}],"version-history":[{"count":9,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15891\/revisions"}],"predecessor-version":[{"id":120508,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15891\/revisions\/120508"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/22563"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15891"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}