{"id":15985,"date":"2020-10-28T23:00:00","date_gmt":"2020-10-28T23:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/customer-relationship-experience-post-covid\/"},"modified":"2023-09-15T13:22:54","modified_gmt":"2023-09-15T12:22:54","slug":"customer-relationship-experience-post-covid","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/","title":{"rendered":"How the Customer Experience has Changed Post-Covid"},"content":{"rendered":"<p>The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience. This in turn entails transformations and changes, some of which are structural.<\/p>\n<p>It is important that your company adapts its strategy to these changes and new customer experience standards.<\/p>\n<p>This article will present the very interesting findings of a recent KPMG study, conducted with a sample group of 12,000 consumers. We will then take a look at the best practices to put in place a successful Voice of the Customer programme. You will find out how and why surveys are precious tools for understanding post-Covid buying habits and customer expectations.<\/p>\n<p>This article is a summary of our last webinar with Aurore Beugniez, co-founder &amp; COO of MyFeelBack, Eric Vibert, MyFeelBack Head of Customer Success, François-Xavier Leroux, Partner – Digital &amp; Customer KPMG, and finally Valentin Collet, KPMG senior consultant. We would like to thank them for taking part and the quality of their discussions.<\/p>\n<h2>How the customer relationship and experience have changed post-Covid<\/h2>\n<p>In June 2020, KPMG conducted a large study with 12,000 consumers in 12 countries to understand the impact of the Covid-19 crisis on the customer experience: <a href=\"https:\/\/home.kpmg\/xx\/en\/home\/insights\/2020\/06\/consumers-and-the-new-reality.html\" target=\"_blank\" rel=\"noopener\">KPMG Global Customer Analysis – June 2020<\/a>.<\/p>\n<p>As you will see, the health and economic crisis has brought about significant changes in customer buying motivations, trust in brands or preferred channels…<\/p>\n<h3>The 3 main trends highlighted by KPMG’s study<\/h3>\n<p>A new consumer profile has emerged since the Covid-19 crisis began. This consumer has three characteristics:<\/p>\n<h4>1 — Price sensitivity<\/h4>\n<p>The study shows that consumer price sensitivity has increased to varying degrees depending on the country. Price sensitivity is at its strongest in countries that provided households with little financial assistance, such as Italy. In countries where measures were implemented to support households (furlough for example), price sensitivity has not increased to the same extent.<\/p>\n<h4>2 — The digitalisation of the customer journey<\/h4>\n<p>The Covid-19 crisis and lockdowns have led to a digitalisation of the customer journey, customer relationship and, more generally, the customer experience. Consumers have had to become familiar with digital channels and\/or increase their use. This is particularly notable in the retail industry for example, where online channels have momentarily replaced offline channels.<\/p>\n<h4>3 — Responsible consumers<\/h4>\n<p>The Covid-19 crisis has developed consumer awareness of the social and societal consequences of their consumption. More and more consumers want to consume in a more ethical, responsible and environmentally friendly manner.<\/p>\n<h3>“These trends are accelerating”<\/h3>\n<p>These three trends are shaping a new consumer profile and <strong>new customer experience expectations.<\/strong> But as François-Xavier Leroux pointed out during the webinar, the Covid-19 crisis has accelerated trends that were already emerging before the pandemic.<\/p>\n<p>Consumer financial constraints due to a drop in purchasing power, the digitalisation of the customer journey and experience, a rise in economic and social awareness… All these trends have been around for several years.<\/p>\n<h3>The most important factors in the buying decision<\/h3>\n<p>What are the key factors in the buying decision? What plays an important role in the act of buying in the post-Covid era? The study conducted out by KPMG provides answers to these questions.<\/p>\n<p>Here are the 13 main factors in the buying decision:<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 453px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/tendances-experience-client.jpg\" alt=\"Main factors for buying decision\" \/><\/p>\n<p class=\"rtecenter\"><em><span style=\"font-size: 11px;\">Credit: KPMG Global Customer Analysis – June 2020<\/span><\/em><\/p>\n<p><strong>Value for money <\/strong>is the first. 63% of consumers say this is a key purchasing criteria. The Covid-19 crisis, and its social and economic impact, has further increased this factor. But it is important not to focus solely on this factor.<\/p>\n<p>The 2nd and 3rd factors are a reminder that brand experience still plays a key role in the buying decision:<\/p>\n<ul>\n<li><strong>Ease of buying, i.e. the buying experience<\/strong>, seamlessness and quality of the purchasing journey, is important for 42% of respondents.<\/li>\n<li><strong>Trust in the brand<\/strong> is important for 41% of consumers.<\/li>\n<\/ul>\n<p>Consumers are looking for good value, but also a quality experience. It’s not all about the price. We agree with this analysis.<\/p>\n<h3>Focus on digital customer relationship trends<\/h3>\n<p>As explained above, one of the main trends that has been reinforced by the Covid-19 crisis is the digitalisation of the customer journey and consumers’ increasing use of digital channels, whether to buy a product or contact a company. Let’s take a moment to explore this strategic point further.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 469px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/tendances-relation-client-stat.jpg\" alt=\"Digital customer relationships trends\" \/><\/p>\n<p class=\"rtecenter\"><span style=\"font-size: 11px;\"><strong>Graph A.<\/strong> <em>Credit: KPMG Global Customer Analysis – June 2020<\/em><\/span><\/p>\n<p>Graph A shows how consumer behaviour has changed before and after Covid-19. There is a clear drop in physical (in-store visits) and traditional (telephone) channels, as well as <strong>an increase in the use of digital channels<\/strong> – websites, phone apps, email, online communities \/ forums, messaging apps, social media, video calls, etc.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 413px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/tendances-relation-client-statistique.jpg\" alt=\"Customers experience trends\" \/><\/p>\n<p class=\"rtecenter\"><span style=\"font-size: 11px;\"><strong>Graph B.<\/strong> <em>Credit: KPMG Global Customer Analysis – June 2020<\/em><\/span><\/p>\n<p>Graph B shows that buying factors that have been strengthened by the Covid-19 crisis – personal safety, but also the importance of buying local, social and economic awareness, people policy and brand values. These changes are the most obvious among 18 to 44 year olds, as well as over 45s.<\/p>\n<p>Customer requests, expectations and priorities have also changed following the Covid-19 crisis. It is important for companies to adapt and rethink their promise in terms of products, services and experience. How? By implementing a Voice of the Customer programme, based on the collection and activation of customer feedback.<\/p>\n<p class=\"discover_more\"><strong>Discover our article <a href=\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-during-crisis\/\">Customer Relationship Management During a Crisis – Advice &amp; Best Practices<\/a><\/strong><\/p>\n<h2>The keys for a successful Voice of the Customer programme<\/h2>\n<p>You need to adapt to new customer expectations in general but also, and above all, to YOUR customers’ new expectations. You can only do this if you know your customers, listen to them, give them a voice, and analyse their expectations. Which is why managing feedback is key. Over the past few years, we have observed a renewed interest in the Voice of the Customer. This is an increasingly strategic issue for companies.<\/p>\n<p>Your company must have the tools and be organised. A successful programme is based on:<\/p>\n<ul>\n<li>Collecting customer feedback.<\/li>\n<li>Activating customer feedback.<\/li>\n<\/ul>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 474px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/enrich-crm-customer-data.jpg\" alt=\"Enrich your CRM with customer data\" \/><\/p>\n<p>We will now take a look at the best techniques for collecting and activating feedback.<\/p>\n<h3>Targeted and personalised customer surveys<\/h3>\n<p>The best way to collect customer feedback is to send your customers surveys.<\/p>\n<p><em><strong>Important<\/strong>: your surveys should be targeted.<\/em><\/p>\n<p>It’s important to accurately target your customers by sending surveys at the right time.<\/p>\n<p>Asking for feedback once, twice or three times a year is no longer enough. Today, the best practice is <strong>to contact your customers for feedback immediately<\/strong>, i.e. right after an interaction or stage of their journey that you want to rate – an in-store purchase, an online order, an exchange with customer services, etc. Targeting allows to increase customer survey response rates and the number of answers collected.<\/p>\n<p>But targeting is not just about timing (sending survey straight away), it is also about channels. It is important to deploy your surveys on channels that your customers use. <strong>A targeted survey is a message sent at the right time, to the right person, on the right channel.<\/strong> At MyFeelBack, we take a multichannel approach. We have enriched our solution so that your company can deploy surveys via your customers’ preferred channels – email, website, social media, instant messaging, chatbot, etc.<\/p>\n<p><em><strong>Secondly: <\/strong>your surveys should be personalised<\/em><\/p>\n<p>Your surveys should be personalised depending on the customer and stage of the journey.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 695px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/leading-question-survey.png\" alt=\"Customer survey customisation\" \/><\/p>\n<p>Personalisation has become firmly rooted in marketing culture. Today, most emails are personalised. This has become standard. But personalisation is still rare when it comes to customer surveys. This can mainly be explained by technology. Until recently, few technologies allowed to personalise surveys. This is no longer the case. MyFeelBack’s solution offers a high level of customer survey personalisation.<\/p>\n<p>Targeting and personalisation are therefore two key ingredients for successful feedback collection.<\/p>\n<h3>Transforming customer feedback into actions<\/h3>\n<p>The second area to deal with is activating feedback. How can you activate the answers you collect? How can you transform customer feedback into actions and business value for your company?<\/p>\n<p>Les feedbacks ont deux principaux usages. Ils génèrent de la valeur business à deux niveaux : un niveau indirect et un niveau direct.<\/p>\n<p>Feedback has two main uses. It generates business value at two levels – an indirect level and a direct level.<\/p>\n<p><em>The indirect value of feedback – reporting and analysis<\/em><\/p>\n<p>Survey answers can be <strong>analysed statistically<\/strong>. Aggregating and cross-referencing answers will help you identify weaknesses and areas for improvement within your organisation, management and working methods. Data from your survey can be fed into your reports and dashboards, and then shared with your employees.<\/p>\n<p>For your reports to be real decision-making aids, it is essential to build your dashboards with <strong>highly operational indicators<\/strong>. For example, there is not much point in adding an overall satisfaction score to a report for operational teams. This score is too general and will be difficult to act on in the field. On the other hand, it is useful and interesting to cross-reference a satisfaction score with: a stage of the customer journey, a geographical area, a customer type, a product or product range, etc. This will provide you with tangible indicators that your operational teams can use in the field.<\/p>\n<p class=\"rtecenter\"><img decoding=\"async\" style=\"width: 650px; height: 616px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/dashboard-nps-en.jpg\" alt=\"Customer satisfaction dashboard\" \/><\/p>\n<p><em>The direct value of feedback – individual customer care<\/em><\/p>\n<p>Customer feedback should not only be used to build dashboards, although this is important. You should also <strong>process feedback individually<\/strong>, by implementing appropriate processes. For example:<\/p>\n<ul>\n<li>Triggering an alert to generate a customer service reminder when a customer expresses dissatisfaction.<\/li>\n<li>Inviting satisfied customers to join your refer-a-friend programme, etc.<\/li>\n<\/ul>\n<p>It is up to your company to determine which actions to trigger depending on the customer’s answers. This makes customer feedback a direct business lever. It either enables you to avoid a loss in revenue (handling of dissatisfied customers), or to generate additional revenue (handling of satisfied customers).<\/p>\n<h3>Integrating customer feedback in your customer information system<\/h3>\n<p>A customer feedback solution should always be integrated to your company’s <strong>software ecosystem<\/strong>. Particularly to your CRM, which still serves as a customer database for a lot of companies, but also to your customer service software, or analytics software (Google Analytics etc.). To make this integration as easy as possible and to enrich all your tools, MyFeelBack <a href=\"https:\/\/www.myfeelback.com\/en\/integrations\" target=\"_blank\" rel=\"noopener\">has developed several connectors<\/a>.<\/p>\n<p>Sending a survey to a customer is a touchpoint in itself. This touchpoint should be part of your overall marketing plan. <strong>This is essential to coordinate your communication and manage the marketing pressure in a global way.<\/strong> The quality of your customer relationship is at stake.<\/p>\n<p>Let’s take a practical example. There are two ways to deploy a survey by email:<\/p>\n<ul>\n<li>Via your customer knowledge solution, for example MyFeedBack<\/li>\n<li>Via your marketing solution, for example Adobe Campaign, Salesforce Marketing Cloud, etc.<\/li>\n<\/ul>\n<p>We recommend the second solution. Below is the process to follow:<\/p>\n<ul>\n<li>Create your survey using your customer knowledge solution.<\/li>\n<li>Add it to your campaign or email scenario in your marketing solution.<\/li>\n<li>Synchronise your answers with your customer knowledge solution. They are then valued, analysed and processed before being fed back into your company’s different tools.<\/li>\n<\/ul>\n<p>Implementing a customer feedback programme will enable your company to:<\/p>\n<ul>\n<li>Understand new customer expectations – buying intent, journeys, new habits, etc.<\/li>\n<li>Qualify incoming after-sales service requests – relieve pressure on customer services, direct requests, refer to help centre content.<\/li>\n<li>Monitor customer satisfaction with any measures you take – offer adapted services, rate the effectiveness of certain measures, etc.<\/li>\n<\/ul>\n<p>We hope this article has helped you understand the importance of the Voice of the Customer in this post-Covid transformation of the customer relationship, marketing strategies and customer experience. Feel free to contact us if you have any questions!<\/p>\n<p><!--HubSpot Call-to-Action Code --><span id=\"hs-cta-wrapper-7b84010b-8ac9-4c08-a18a-6e4c710c1fd9\" class=\"hs-cta-wrapper\"><span id=\"hs-cta-7b84010b-8ac9-4c08-a18a-6e4c710c1fd9\" class=\"hs-cta-node hs-cta-7b84010b-8ac9-4c08-a18a-6e4c710c1fd9\"><!-- [if lte IE 8]>\n\n\n<div id=\"hs-cta-ie-element\"><\/div>\n\n\n<![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/744484\/7b84010b-8ac9-4c08-a18a-6e4c710c1fd9\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" id=\"hs-cta-img-7b84010b-8ac9-4c08-a18a-6e4c710c1fd9\" class=\"hs-cta-img\" style=\"border-width: 0px;\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/7b84010b-8ac9-4c08-a18a-6e4c710c1fd9-1.png\" alt=\"Download your memo\" \/><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"><br \/>\n<!--\/\/-->\/\/ ><!--\n hbspt.cta.load(744484, '7b84010b-8ac9-4c08-a18a-6e4c710c1fd9', {}); \n\/\/--><!\n<\/script><\/span><!-- end HubSpot Call-to-Action Code --><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience. This in turn entails transformations and changes, some of which are structural. It is important that your company adapts its strategy to these changes and new customer experience standards. This article will present the very interesting&#8230;<\/p>\n","protected":false},"author":5,"featured_media":23060,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[160,136],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How the Customer Experience has Changed Post-Covid - Skeepers<\/title>\n<meta name=\"description\" content=\"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How the Customer Experience has Changed Post-Covid - Skeepers\" \/>\n<meta property=\"og:description\" content=\"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-28T23:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:22:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-relationship-experience-post-covid.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1024\" \/>\n\t<meta property=\"og:image:height\" content=\"512\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/\",\"name\":\"How the Customer Experience has Changed Post-Covid - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2020-10-28T23:00:00+00:00\",\"dateModified\":\"2023-09-15T12:22:54+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How the Customer Experience has Changed Post-Covid\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How the Customer Experience has Changed Post-Covid - Skeepers","description":"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/","og_locale":"en_US","og_type":"article","og_title":"How the Customer Experience has Changed Post-Covid - Skeepers","og_description":"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.","og_url":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/","og_site_name":"Skeepers","article_published_time":"2020-10-28T23:00:00+00:00","article_modified_time":"2023-09-15T12:22:54+00:00","og_image":[{"width":1024,"height":512,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/customer-relationship-experience-post-covid.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/","url":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/","name":"How the Customer Experience has Changed Post-Covid - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2020-10-28T23:00:00+00:00","dateModified":"2023-09-15T12:22:54+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"The health and economic crisis caused by Covid-19 has strongly impacted certain aspects of the customer relationship and experience.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/customer-relationship-experience-post-covid\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"How the Customer Experience has Changed Post-Covid"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15985"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=15985"}],"version-history":[{"count":4,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15985\/revisions"}],"predecessor-version":[{"id":91537,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/15985\/revisions\/91537"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/23060"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=15985"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=15985"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=15985"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=15985"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}