{"id":16005,"date":"2020-08-04T22:00:00","date_gmt":"2020-08-04T22:00:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/"},"modified":"2023-09-15T13:22:11","modified_gmt":"2023-09-15T12:22:11","slug":"service-companies-b2b-indicators-customer-satisfaction-dashboards","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/","title":{"rendered":"B2B: Which indicators for your customer satisfaction dashboards"},"content":{"rendered":"\n<p>Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Then you’ve come to the right place.&nbsp;&nbsp;<\/p>\n\n\n\n<p>This article presents the basics and explains which main indicators to use to build an operational system.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap1\">Choosing customer satisfaction indicators&nbsp;<\/h2>\n\n\n\n<p>When building any kind of dashboard, there are two things to consider:<\/p>\n\n\n\n<ul>\n<li><strong>What to include on your dashboards?<\/strong> What information would you like to display? This will vary depending on your objectives and dashboard use cases.<\/li>\n\n\n\n<li><strong>How to design your dashboards?<\/strong> How do you want the information to be displayed?<\/li>\n<\/ul>\n\n\n\n<p>This article focuses on the first question, although both are linked. If you want to measure a breakdown (e.g. the breakdown of your B2B clients by industry sector), then you could use a pie chart. You will not, however, be able to represent this breakdown with a curve. The content of the information determines the way it is represented.&nbsp;<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/service-b2b-indicators-customer-satisfaction-dashboards.jpg\" alt=\"dashboard customer satisfaction sector\" class=\"wp-image-27062\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"three-key-customer-satisfaction-indicators-nps-csat-and-ces\">Three key customer satisfaction indicators: NPS, CSAT and CES<\/h3>\n\n\n\n<p>When building a customer satisfaction dashboard, you have to select one or more customer satisfaction “indicators”. Below are the three main ones:<\/p>\n\n\n\n<ul>\n<li>The <strong>Net Promoter Score (NPS)<\/strong>, which measures the likelihood that your clients or users will recommend you to others. It is obtained by aggregating the answers to the following question: “<em>On a scale of 0 to 10, how likely are you to recommend our [Company \/ Brand \/ Service \/ Product] to others?<\/em>”<\/li>\n\n\n\n<li>The <strong>Customer Satisfaction Score (CSAT)<\/strong>, which measures your clients’ satisfaction on a global level or in response to a specific client interaction, service etc. It is obtained by aggregating the answers to the following question: “<em>Are you satisfied with X?<\/em>”. The respondent can choose from 4 or 5 answers.<\/li>\n\n\n\n<li>The <strong>Customer Effort Score (CES)<\/strong>, which measures the effort exerted by a client when using a service. It is obtained by asking your B2B clients the following question: “<em>What level of effort did you have to exert to [Perform action X]?<\/em>”<\/li>\n<\/ul>\n\n\n\n<p>We have already written at length about these satisfaction indicators. To find out more about each one of them and how to use them, take a look at our blog. We particularly recommend reading this <a href=\"https:\/\/skeepers.io\/en\/blog\/7-kpis-to-measure-your-customer-experience\/\" target=\"_blank\" rel=\"noreferrer noopener\">article<\/a>!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"choosing-satisfaction-indicator-analysis-axes\">Choosing satisfaction indicator analysis axes&nbsp;<\/h3>\n\n\n\n<p>You can choose to focus on one indicator: NPS, CSAT or CES. Or you may decide to use two, or even three. It is worth nothing though that CES has a special status. It is generally used as a complementary indicator alongside the NPS or CSAT, but rarely alone.&nbsp;<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/companies-b2b-indicators-customer-satisfaction.jpg\" alt=\"customer satisfaction survey\" class=\"wp-image-27060\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Once you have chosen your indicators, it is time to build the process that will allow you to collect answers from your clients: design a survey, deploy it to a targeted audience, collect the answers, synchronise the answers with your dashboards.&nbsp;<\/p>\n\n\n\n<p>You then need to choose three analysis axes. Take the Net Promoter Score, for example. There are at least 3 potential analysis axes:<\/p>\n\n\n\n<ul>\n<li><strong>Overall NPS score<\/strong>, which is expressed as a number between -100 and 100.<\/li>\n\n\n\n<li><strong>Client breakdown by: Promoters \/ Passives \/ Detractors<\/strong>. This indicator allows to group clients into 3 categories. You can represent the data in the form of bars or a pie chart.<\/li>\n\n\n\n<li><strong>Monitoring the monthly NPS evolution<\/strong>, represented in the form of a curve for example. Monitoring the evolution of your satisfaction indicators over time is essential.<\/li>\n<\/ul>\n\n\n\n<p>If you choose this indicator, we recommend incorporating these three axes into your dashboards. But&nbsp; it is also interesting to measure customer satisfaction at every step of the customer journey, with every service, product, etc. We will come back to this in a moment, but first let’s take a look at one last way to measure your overall customer satisfaction.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"measuring-your-clients-perception-of-your-strengths-and-weaknesses\">Measuring your clients’ perception of your strengths and weaknesses<\/h3>\n\n\n\n<p>Strengths generate satisfaction. Weaknesses generate client dissatisfaction and frustration. It therefore makes perfect sense to <strong>measure your perceived strengths and weaknesses<\/strong> on a customer satisfaction dashboard.<\/p>\n\n\n\n<p>We strongly recommend asking your B2B clients what, in their opinion, your company’s strengths and weaknesses are, via a survey. Ask: “<em>In your opinion, what are our main strengths?<\/em>”. You can also ask the question indirectly, for example: “<em>In your opinion, what do we do better than our direct competitors?<\/em>”. And, of course, don’t forget to ask your B2B clients about your weaknesses:<\/p>\n\n\n\n<ul>\n<li><strong>Your strengths<\/strong>, as seen by your clients, are areas you should capitalise on. These are things to highlight in your value proposition and sales pitch.&nbsp;<\/li>\n\n\n\n<li><strong>Your weaknesses<\/strong> enable you to identify areas for improvement, whether in your company, services, or products. These should be part of your continuous improvement strategy.&nbsp;<\/li>\n<\/ul>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/service-companies-b2b-indicators-customer-satisfaction-1.jpg\" alt=\"Keywords\" class=\"wp-image-27063\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap2\">Measuring customer satisfaction with your customer journey, services, and offers<\/h2>\n\n\n\n<p>Let’s come back to our earlier topic. NPS or <a href=\"https:\/\/blog.hubspot.com\/service\/customer-satisfaction-score\" target=\"_blank\" rel=\"noreferrer noopener\">CSAT<\/a> scores should not only be measured at a global level. You should also measure client satisfaction with your customer journeys, services, and offers.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"measuring-satisfaction-at-every-step-of-the-customer-journey\">Measuring satisfaction at every step of the customer journey<\/h3>\n\n\n\n<p>The quality of your customer journey has an impact on client acquisition and retention. Client journeys directly impact <strong>customer experience<\/strong>.<\/p>\n\n\n\n<p>Let’s take the sales phase, for example. The sales stages at the beginning of the customer journey have a major impact on your commercial performance as a service provider, i.e. your ability to turn leads into clients. Why not ask your leads about their satisfaction at this stage?<\/p>\n\n\n\n<p>You could, for example, send your leads a satisfaction survey during the conversion phase, including a CSAT question: “<em>Are you satisfied with our sales team?<\/em>”. You could go even further and enrich your survey by asking your leads about the quality of the documentation they received, your sales representatives’ availability, understanding of their needs, etc.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/companies-b2b-indicators-customer-satisfaction-dashboards.jpg\" alt=\"customer satisfaction question\" class=\"wp-image-27061\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>At the other end of the customer journey, you may find it interesting to ask your clients about their satisfaction with <strong>Customer Success<\/strong>. Customer Success Management significantly impacts customer retention. What do your B2B clients think of the support provided by their account manager?<\/p>\n\n\n\n<p>Once again, don’t hesitate to use these surveys to ask your clients about your strengths and weaknesses. E.g.: “<em>What do you appreciate the most about our Customer Success?<\/em>”, “<em>How do you think we could improve the support provided by our sales representatives?<\/em>”, etc.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"measuring-satisfaction-with-your-services\">Measuring satisfaction with your services<\/h3>\n\n\n\n<p>Customer experience is the sum of all your clients’ experiences at the different touchpoints of your customer journey, and also in their use of your products and services. You can offer a flawless customer service, but if your products and services do not satisfy your clients, they will eventually leave.<\/p>\n\n\n\n<p>You should therefore measure your clients’ satisfaction with the services and products provided by your B2B company. Once again, the easiest way to do so is to send surveys to the companies using your services. If you offer several services, products, software, or modules, then ask your clients for feedback about each one. Ask which ones they appreciate most, which ones add the most value, and which ones bring the most satisfaction. Then, incorporate the satisfaction data you collect into your dashboards.&nbsp;<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/b2b-indicators-customer-satisfaction-dashboards.jpg\" alt=\"customer segmentation\" class=\"wp-image-27066\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>You can use NPS, CSAT and CES indicators for this. You can also use the strengths and weaknesses axe again. The aim: to ensure that your clients are satisfied with your services and products, and that the latter are meeting their needs and expectations.<\/p>\n\n\n\n<p>One last tip: feel free to ask questions about specific aspects of your services or products. For example, if you are a <strong>SaaS solution developer<\/strong>, ask your clients about the interface, different features, etc.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"measuring-satisfaction-with-your-offers\">Measuring satisfaction with your offers<\/h3>\n\n\n\n<p>For a digital services company, designing offers and choosing a pricing model can be complex. Single pricing, custom pricing, bundled pricing, pay-per-use pricing, staggered pricing…? The choice of pricing model is a defining element for companies – particularly in the SaaS software world.<\/p>\n\n\n\n<p>Pricing models can be adjusted and continually improved. So, why not ask your B2B clients what they think about your pricing and offers? Reach out to your clients to optimise your offers and ensure that they match your target clientele’s expectations.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"two-bonus-ideas-to-enrich-your-customer-satisfaction-dashboards\">Two bonus ideas to enrich your customer satisfaction dashboards<\/h3>\n\n\n\n<p>You can produce complete, accurate, and informative customer satisfaction dashboards using all the information listed above. You could also enrich them with additional information. We have two suggestions for this.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"add-a-customer-knowledge-layer-to-your-dashboards\">Add a Customer Knowledge layer to your dashboards<\/h3>\n\n\n\n<p>You are a service provider. You have clients. These clients are companies. But who are these companies? Do you know your clients? You want to measure your clients’ satisfaction &#8211; it therefore makes sense to include some information about them onto your dashboards, to get to know them better.<\/p>\n\n\n\n<p>We suggest including information about your clients based on <strong>firmographic criteria<\/strong>: size of company (small, medium, large company…), industry sector, number of employees, turnover, number of employees using your services within the company…<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"identify-your-acquisition-channels\">Identify your acquisition channels<\/h3>\n\n\n\n<p>Where do your B2B clients come from? How did they find out about you? These are important questions. The answers are even more so; they will help you improve your <strong>acquisition strategy<\/strong> and optimise the allocation of your marketing efforts.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/service-companies-indicators-customer-satisfaction-1.jpg\" alt=\"survey insights\" class=\"wp-image-27065\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>If you organise time-consuming and costly events, but only a handful of your clients discovered you in this way, is it worth continuing to invest so much in this acquisition lever? Similarly, if you invest 2&nbsp;000 euros a month in Google Ad campaigns, but none of your clients discovered you by clicking on a Google Ad, then this acquisition channel may not be well suited (or your advertising campaigns are not well designed, which is another possibility!).<\/p>\n\n\n\n<p>On the flip side, if most of your clients discovered you through your website, then it is in your interest to focus your efforts on this channel. Etc. Etc.&nbsp;<\/p>\n\n\n\n<p>It is important to have a <strong>clear understanding of your sources, levers, and acquisition channels<\/strong>. Ask your clients about them and include their answers in your dashboards.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap3\">Conclusion<\/h2>\n\n\n\n<p>This article is now drawing to an end. We hope that it has answered at least some of your questions. We have provided you with some general guidelines, but of course each company has its own objectives, specificities, and organisation, from which to build <strong>operational dashboards<\/strong> – the purpose of dashboards being to facilitate the transformation of information into action.<\/p>\n\n\n\n<p>You will need to use surveys to collect data to feed into your customer satisfaction dashboards. If you don’t have any tools yet to build and deploy surveys, then please note that <a href=\"https:\/\/www.skeepers.io\/en\/cx-management-en\/\" target=\"_blank\" rel=\"noreferrer noopener\">CX Management<\/a> offers a complete customer knowledge solution. Get in touch with our teams to find out more.<\/p>\n\n\n\n<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-50ae5644-02d5-4330-9b0d-0e79812f8ce1\"><span class=\"hs-cta-node hs-cta-50ae5644-02d5-4330-9b0d-0e79812f8ce1\" id=\"hs-cta-50ae5644-02d5-4330-9b0d-0e79812f8ce1\">&lt;!&#8211;[if lte IE 8]&gt;<div id=\"hs-cta-ie-element\"><\/div>&lt;![endif]&#8211;&gt;<a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/50ae5644-02d5-4330-9b0d-0e79812f8ce1\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"hs-cta-img\" id=\"hs-cta-img-50ae5644-02d5-4330-9b0d-0e79812f8ce1\" style=\"border-width:0px\" height=\"223\" width=\"700\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/50ae5644-02d5-4330-9b0d-0e79812f8ce1.png\" alt=\"15 questions to know your customers needs and expectations\"><\/a><\/span> hbspt.cta.load(20304540, &#8217;50ae5644-02d5-4330-9b0d-0e79812f8ce1&#8242;, {&#8220;useNewLoader&#8221;:&#8221;true&#8221;,&#8221;region&#8221;:&#8221;na1&#8243;}); <\/span><!-- end HubSpot Call-to-Action Code -->\n","protected":false},"excerpt":{"rendered":"<p>Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Then you’ve come to the right place.&nbsp;&nbsp; This article presents the basics and explains which main indicators to use to build an operational system. Choosing customer satisfaction indicators&nbsp; When building any kind of dashboard, there are two&#8230;<\/p>\n","protected":false},"author":5,"featured_media":23174,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>B2B: Which indicators for your customer satisfaction dashboards - Skeepers<\/title>\n<meta name=\"description\" content=\"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"B2B: Which indicators for your customer satisfaction dashboards - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-04T22:00:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:22:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/service-companies-b2b-indicators-customer-satisfaction-dashboards-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1080\" \/>\n\t<meta property=\"og:image:height\" content=\"514\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/\",\"name\":\"B2B: Which indicators for your customer satisfaction dashboards - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2020-08-04T22:00:00+00:00\",\"dateModified\":\"2023-09-15T12:22:11+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"B2B: Which indicators for your customer satisfaction dashboards\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"B2B: Which indicators for your customer satisfaction dashboards - Skeepers","description":"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/","og_locale":"en_US","og_type":"article","og_title":"B2B: Which indicators for your customer satisfaction dashboards - Skeepers","og_description":"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!","og_url":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/","og_site_name":"Skeepers","article_published_time":"2020-08-04T22:00:00+00:00","article_modified_time":"2023-09-15T12:22:11+00:00","og_image":[{"width":1080,"height":514,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/service-companies-b2b-indicators-customer-satisfaction-dashboards-1.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/","url":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/","name":"B2B: Which indicators for your customer satisfaction dashboards - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2020-08-04T22:00:00+00:00","dateModified":"2023-09-15T12:22:11+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Does your company provide B2B clients with digital services? Would you like to set up customer satisfaction dashboards? Read here!","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/service-companies-b2b-indicators-customer-satisfaction-dashboards\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"B2B: Which indicators for your customer satisfaction dashboards"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16005"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16005"}],"version-history":[{"count":6,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16005\/revisions"}],"predecessor-version":[{"id":121730,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16005\/revisions\/121730"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/23174"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16005"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16005"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16005"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16005"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}