{"id":16109,"date":"2021-11-05T15:42:00","date_gmt":"2021-11-05T15:42:00","guid":{"rendered":"https:\/\/skeepers.io\/blog\/new-ways-working-satisfaction\/"},"modified":"2024-03-06T10:20:11","modified_gmt":"2024-03-06T09:20:11","slug":"new-ways-working-satisfaction","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/","title":{"rendered":"New Ways of Working &amp; Satisfaction at Work"},"content":{"rendered":"\n<p>As the song says, “The Times They Are a-Changin”. Times are changing and new ways of working are emerging. Some suddenly appear unexpectedly, such as remote working, whereas others are slower to appear, but just as relevant.<\/p>\n\n\n\n<p>These are the NWOW (New Ways of Working) to use the term that is trending today. The Covid-19 pandemic has accelerated these transformations at work, of course, but these changes have actually been around for a while.<\/p>\n\n\n\n<p>So, what are these NWOW? What are their benefits for both employees and businesses? This article will answer these questions and present a few initiatives and practical examples to think about.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap1\">New Ways of Working, a Win-Win Approach<\/h2>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"what-are-the-nwow\">What are the NWOW?<\/h3>\n\n\n\n<p>NWOW is a concept encompassing all the new forms of work organization that have appeared over the past few years: remote working, flexible hours, horizontal and collaborative management, transformation of workspaces into living spaces…<\/p>\n\n\n\n<p>NWOW is the abbreviation of “New Ways of Working”, but some prefer to talk about a “New World of Working”. We personally prefer New Ways of Working because it highlights the diversity of the initiatives and transformations. But in the end, reality is more important than the words. The fact is that:<\/p>\n\n\n\n<ul>\n<li>Lots of experts from the business world or civil society are currently reflecting on the desirable and\/or ongoing developments at work.<\/li>\n\n\n\n<li>More and more companies are deploying initiatives to change their organization at work, at their scale.<\/li>\n\n\n\n<li>Some companies are true role models and play a leading role in promoting and developing “New Ways of Working”.<\/li>\n<\/ul>\n\n\n\n<p>The Covid-19 pandemic has accelerated the adoption of these NWOW. We are of course referring to remote working, which has taken on an unprecedented role in the organization of companies.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"aligning-employee-satisfaction-and-company-interests\">Aligning Employee Satisfaction and Company Interests<\/h3>\n\n\n\n<p>All of these practices share an ambition to better align company and employee interests. Implementing these New Ways of Working is beneficial for employees, as well as the company, making it a win-win approach.<\/p>\n\n\n\n<p>Let’s start with the employee benefits. They can be summed up by two terms and concepts: wellbeing and freedom. New Ways of Working consist of deploying a new work organization and working conditions to improve employee wellbeing and provide them with greater freedom:<\/p>\n\n\n\n<ul>\n<li>To manage their time.<\/li>\n\n\n\n<li>To manage their space.<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"the-flexibility-of-space-and-time\">The flexibility of space and time.<\/h4>\n\n\n\n<p>Remote working is emblematic of these New Ways of Working. It provides:<\/p>\n\n\n\n<ul>\n<li>Freedom of space: the employee is no longer a “prisoner” of his or her desk and daily commutes between their home and workplace. They can work wherever they like: at home, in a co-working space, in a café…<\/li>\n\n\n\n<li>Greater freedom in managing their working hours. Remote working allows flexible working hours.<\/li>\n<\/ul>\n\n\n\n<p>To recap, remote working, when implemented in an intelligent manner, with <a href=\"https:\/\/skeepers.io\/en\/blog\/employee-satisfaction-drives-customer-satisfaction\/\" target=\"_blank\" rel=\"noreferrer noopener\">employee satisfaction<\/a> in mind, enables greater flexibility of space and time.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"horizontal-management-and-the-search-for-wellbeing\">Horizontal Management and the Search for Wellbeing<\/h3>\n\n\n\n<p>Flexibility of space, flexibility of time, but also flexibility of management. Horizontal forms of management are at the heart of these new ways of working. They are in opposition with the hierarchical constraints of traditional management. Horizontal management encourages greater collaboration.<\/p>\n\n\n\n<p>&nbsp;NWOW therefore lean toward greater freedom for employees… and greater wellbeing. It’s about making employees feel better at work. More horizontal management and flexible time\/space policies contribute to this objective of employee wellbeing, as does the design of workspaces which some companies have transformed into real living spaces.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"new-ways-of-working-that-also-benefit-companies\">New Ways of Working that Also Benefit Companies<\/h3>\n\n\n\n<p>We mentioned earlier the concept of a win-win situation. Indeed, if NWOW are generally employee-centric, they also benefit the company’s interests. Of course, implementing remote working reduces office space costs. But what companies are really expecting from these changes is increased productivity.<\/p>\n\n\n\n<p>For a simple and fundamental reason. Several studies have proved that there is a link between wellbeing at work and productivity. The more relaxed and empowered an employee feels at work, the more productive they are. We discuss this further in our article about the&nbsp;symmetry of attention, a concept that explains why you need to pay attention to your employees as well as your customers. By implementing or approving these new ways of working, companies are seeking to boost their employees’ motivation and productivity.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/new-ways-working-satisfaction-attention.jpg\" alt=\"new ways of working attention\" class=\"wp-image-22502\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>There’s another reason that New Ways of Working encourage productivity… For the most part, they require the use of new technologies and therefore the digitalization of work. Which leads to productivity gains, particularly by automating certain tasks with low added-value.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap2\">How to Build your New Way of Working and Measure Satisfaction at Work<\/h2>\n\n\n\n<p>You can’t talk about New Ways of Working without discussing job satisfaction. As mentioned above, these new ways of working that are spreading through the business world aim to increase employee wellbeing and freedom at work. Company benefits are also directly linked to job satisfaction, since productivity goes hand in hand with employee satisfaction.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-steps-to-design-new-ways-of-working\">2 Steps to Design New Ways of Working<\/h3>\n\n\n\n<p>It is important to identify these new ways of working. Which ones should you put in place? How can you deploy them? For example, there are several ways to organize remote working. In other words, you need to successfully move from theory to practice. We recommend following these 2 steps:<\/p>\n\n\n\n<ol type=\"1\">\n<li>Research and identify new ways of working that could, technically, be deployed in your company. Take a look at what other companies are doing – leading NWOW companies, as well as those similar to your own (your competitors).<\/li>\n\n\n\n<li>Second, get your employees involved by presenting the different options and building new ways of working with them. The ones that best meet employee expectations and company interests.<\/li>\n<\/ol>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"the-use-of-employee-surveys\">The Use of Employee Surveys<\/h3>\n\n\n\n<p>For the second step, we recommend sending your employees surveys. Employee surveys are great tools to build a NWOW strategy and ensure that the company and the people that make it up are aligned.<\/p>\n\n\n\n<p>Let’s take a simple example. Maybe you want to install a spa in your company offices. And… you think that your employees will love it. But are you sure? To avoid any mistakes and ensure that you create new ways of working that meet your employees’ expectations, ask them and involve them in the decision-making process. Don’t leave them out.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/new-ways-working-satisfaction-emoji.jpg\" alt=\"working environment\" class=\"wp-image-22503\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap3\">4 Things to Think About and Real-Life Examples<\/h2>\n\n\n\n<p>Let’s end with an overview of some of these NWOW.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"1-remote-working\">1 – Remote Working<\/h3>\n\n\n\n<p>Remote working consists in performing your work tasks outside of the company walls, away from the brick and mortar office. Remote working can be done at home or somewhere else: co-working spaces, a café, etc.<\/p>\n\n\n\n<p>New technology has made remote working possible and, as a result, encourages employees to adopt these new technologies. In this sense, remote working is a catalyst of digital transformation.<\/p>\n\n\n\n<p>There are several ways to organize remote working: full-time, hybrid home and office, remote working X days per week, etc. We recommend asking your employees about their preferences. Feel free to look at our survey template to get to know employee expectations in terms of remote working.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter size-full\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/new-ways-working-satisfaction-nps.jpg\" alt=\"NPS question new ways of working\" class=\"wp-image-22504\"\/><\/figure>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-flexibility-of-work-hours\">2 – Flexibility of Work Hours<\/h3>\n\n\n\n<p>Flexible working hours has become more valued in NWOW, whether working from home or at the office. Some studies have showed that letting employees manage their own working hours improves motivation and productivity. The work-sleep daily routine can be an obstacle to motivation.<\/p>\n\n\n\n<p>The reality is that certain tasks don’t need to be done at fixed times. Lots of companies are therefore becoming more flexible and letting employees manage their own time. If your company is ready to change its ways of working, this is certainly something to think about.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"3-the-4-day-week\">3 – The 4-Day Week<\/h3>\n\n\n\n<p>The 4-day a week is a practice that is becoming more and more widespread throughout the world. Several large companies have already implemented it. Take for example the NGO WWF, that has introduced “Panda Fridays”. Some companies have taken a more individualized approach and offer employees the possibility to earn days off by working longer hours – which reflects the link between flexible working hours and the 4-day week.<\/p>\n\n\n\n<p>These initiatives can also be state-led. For example, Iceland ran a pilot program between 2015 and 2019 to introduce a 4-day week and a 35-36 hour working week, with no reduction in pay. More than 1% of the working population benefitted from this program and the results in wellbeing and productivity were very positive.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"4-redesigning-workspaces\">4 – Redesigning Workspaces<\/h3>\n\n\n\n<p>Another area of development is to improve the workspace design, in particular by implementing services dedicated to wellbeing, to transform the workplace into a living space. Some big companies have taken this idea to the next level, such as the Silicon Valley giants:<\/p>\n\n\n\n<ul>\n<li><strong>Apple and its Apple Park<\/strong>, the brand’s new headquarters for 12,000 employees. The 26,000 hectare campus, that cost more than $5 billion dollars, includes a medical center, a gym, an auditorium, a research center… all powered by solar panels on the roof. The Apple Park is named after the 10,000 trees planted on its grounds.<\/li>\n\n\n\n<li><strong>Google and its GooglePlex<\/strong>. The Google headquarters is home to restaurants, shops, nurseries, gyms… A real village dedicated to employee wellbeing!<\/li>\n<\/ul>\n\n\n\n<p>Of course, not all companies can build an Apple Park or a GooglePlex. But more and more companies are investing in gyms, such as Canal+ or SFR. Even smaller companies can take initiatives to make the workplace more relaxed and enjoyable.<\/p>\n\n\n\n<p>These are four areas to explore when deploying new ways of working within your organization. We hope to have convinced you of the benefits that can result from these New Ways of Working. As for how to implement them, we recommend once more following these two steps: 1. Find out what’s happening elsewhere and 2. Make decisions after actively involving your employees. This way, you will be sure to align your NWOW with job satisfaction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the song says, “The Times They Are a-Changin”. Times are changing and new ways of working are emerging. Some suddenly appear unexpectedly, such as remote working, whereas others are slower to appear, but just as relevant. These are the NWOW (New Ways of Working) to use the term that is trending today. The Covid-19&#8230;<\/p>\n","protected":false},"author":28,"featured_media":23775,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>New Ways of Working &amp; Satisfaction at Work - Skeepers<\/title>\n<meta name=\"description\" content=\"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"New Ways of Working &amp; Satisfaction at Work - Skeepers\" \/>\n<meta property=\"og:description\" content=\"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-11-05T15:42:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-06T09:20:11+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/new-ways-working-satisfaction.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1080\" \/>\n\t<meta property=\"og:image:height\" content=\"514\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Juanita Solano\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Juanita Solano\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/\",\"name\":\"New Ways of Working &amp; Satisfaction at Work - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-11-05T15:42:00+00:00\",\"dateModified\":\"2024-03-06T09:20:11+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb\"},\"description\":\"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"New Ways of Working &amp; Satisfaction at Work\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb\",\"name\":\"Juanita Solano\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g\",\"caption\":\"Juanita Solano\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"New Ways of Working &amp; Satisfaction at Work - Skeepers","description":"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/","og_locale":"en_US","og_type":"article","og_title":"New Ways of Working &amp; Satisfaction at Work - Skeepers","og_description":"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!","og_url":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/","og_site_name":"Skeepers","article_published_time":"2021-11-05T15:42:00+00:00","article_modified_time":"2024-03-06T09:20:11+00:00","og_image":[{"width":1080,"height":514,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/new-ways-working-satisfaction.jpg","type":"image\/jpeg"}],"author":"Juanita Solano","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Juanita Solano","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/","url":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/","name":"New Ways of Working &amp; Satisfaction at Work - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-11-05T15:42:00+00:00","dateModified":"2024-03-06T09:20:11+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb"},"description":"What are the New Ways Of Working? What are their benefits for both employees and businesses? This article will answer these questions!","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/new-ways-working-satisfaction\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"New Ways of Working &amp; Satisfaction at Work"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb","name":"Juanita Solano","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g","caption":"Juanita Solano"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16109"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16109"}],"version-history":[{"count":6,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16109\/revisions"}],"predecessor-version":[{"id":140217,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16109\/revisions\/140217"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/23775"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16109"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16109"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16109"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16109"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}