{"id":16121,"date":"2020-09-17T07:35:34","date_gmt":"2020-09-17T07:35:34","guid":{"rendered":"https:\/\/skeepers.io\/?p=16121"},"modified":"2023-12-07T16:08:54","modified_gmt":"2023-12-07T15:08:54","slug":"interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/","title":{"rendered":"[INTERVIEW] David Le Douarin: &#8220;The closer we are to consumer needs, the more we tend to forget about marketing&#8221;"},"content":{"rendered":"<p><span>For David Le Douarin, co-founder of the Advalo platform, personalized marketing offers retailers the opportunity to respond effectively to the needs of consumers at any given time. In an exclusive interview for Actu Retail, he discusses the evolution of marketing and the rise of personalization in business-to-consumer relations in light of the economic crisis.<\/p>\n<p><\/span><\/p>\n<p><!--more--><\/p>\n<p style=\"text-align: justify;\"><strong>1° -How has marketing evolved towards an individualized relationship and how is Advalo changing the game?<\/strong><\/p>\n<p><span>&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>David Le Douarin <\/strong>: My cofounder &#8211; Olivier Marc &#8211; and I made a simple observation: retailers were seeing significant reductions in in-store traffic. What can we do to generate more traffic? One of the retailers&#8217; responses, which we felt was the most inept, was to resort to mass marketing. Hundreds of emails sent to their customers ended up directly in the spam box. Generally speaking, they tried to find ways to get a lot of traffic, considering that they had to &#8220;push&#8221;, using mass marketing, which is, by nature, quite polluting and intrusive. The other response was to resort to promotional marketing. Retailers thought, in an unconsidered way, that it was necessary to add promotion to increase traffic. I think, as consumers, we are all &#8221; bombarded &#8221; with -30%, -40%, and this completely called into question the business model of the retailer.&nbsp;<\/p>\n<p><span>&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">At Advalo, we offer a third response to enable retailers to move away from these inefficient models and to orient them towards individualized marketing, which is the retailer&#8217;s real job. Through individualized marketing, it is possible to understand who the retailer is talking to and which are the right products to trigger the act of buying at the right time. Our data platform enables us to collect data from a consumer and to know what he\/she needs or may need in the near future, in order to lead him\/her to buy on an e-commerce site or in a physical shop.&nbsp;<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><span style=\"color: #666666;\">But Advalo not only aggregates online and offline data, we also add value. We aggregate the raw data and process it with predictive models. Artificial intelligence is used to predict future consumer needs. Predictive marketing, used by Advalo, allows us to determine at any given moment that a particular customer has an intention to buy a sofa for example, that another customer is leaving the shop, that another came last season, but not this time etc&#8230; So we have to find the right product<\/span> <\/span>that will make them want to come into the shops. With the help of about fifty predictive models, we are able to tell marketers which customers are currently &#8220;hot&#8221;, which ones are no longer coming, and which aspects are going to encourage them to come to the shops in the near future. Predictive marketing is going to allow us to calculate all of this and in parallel, we are going to send this data to Google and Facebook, to deliver fully personalized, individualized marketing. Our platform allows us to send a different email to each consumer. To this end, we are going to personalize the relationship in a sustainable way, while making life easier for retailers by administering this process.&nbsp;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\"><\/p>\n<p><\/span><\/p>\n<p style=\"text-align: justify;\"><strong>2° &#8211; How has consumer behavior changed? How has it changed marketing and retailer practices?&nbsp;<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>D.L <\/strong>: Understanding the consumer is the starting point for marketing. To do this, you need to have data on who they are, what they may have bought in the past and, above all, know what they are interested in today in order to try to offer them relevant choices in the future.&nbsp;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">In my opinion, two key elements must be taken into account:&nbsp;<\/p>\n<p style=\"text-align: justify;\">1\/ To know who they are and what they have bought in the past: this data is easily identifiable thanks to the cash register systems. It&#8217;s possible to collect them when you fill in your surname, first name, e-mail address, etc. We are an integral part of the shop&#8217;s CRM [Customer Relationship Management] database. The retailer uses this data to find out about a customer&#8217;s previous purchases.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">2\/ The problem is that it seems more complex to analyze the purchasing journey of a consumer who goes to the retailer&#8217;s e-commerce site, before going to buy in a physical shop. The consumer, who does not identify themselves on the site, does not leave any contact details. They will simply look at the product in question, to see if there is stock in the shop before going to buy. This hot data (website) is less traceable. If a customer visits a shop&#8217;s website, it is because they have developed a short-term purchase intention. We must then be able to collect this data and correlate it with what we have done in the past (the cold data). If you bought a dress three months ago from a retailer, for example, and you now find yourself interested in a jumper, the challenge will be to anticipate your next purchase using these two elements. Advalo is unique in that it collects this data (cold and hot) in order to obtain reliable data, capable of making the past speak for itself and predicting the future interest of the consumer.&nbsp;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>3° &#8211; How can personalized marketing optimize cross-channel strategies?&nbsp;<\/strong><\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\"><strong>D.L <\/strong>: The reality is that when a retailer has a customer base, it reacts less and less to its emails nowadays. If you do the math, you can see that out of every 100 customers in the customer base, there are more or less &#8211; only 10% &#8211; who open the emails they send. In other words, 90% of people no longer open their emails. There is therefore an absolute necessity to go and talk to this proportion of customers.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">Luckily, other channels exist. This is where omnicanality brings value. I&#8217;m going to use personalized campaigns via Google, Facebook or Criteo [specializing in retargeting on the Internet] to reach out to that remaining 90% and make sure they continue to see my brand, even if they don&#8217;t open their email. Through omnicanality, I will be able to reach the consumer wherever he or she is preparing their entire buying journey. Instead of being satisfied with just the cold data &#8211; that of the shop &#8211; I will look at both the shop data and the e-commerce site data. This store\/e-commerce complementarity will finally give us the most accurate view of the consumer&#8217;s needs at any given moment.<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #000000;\">&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">Digital plays a key role in this omnichannel strategy, with a strong emphasis on human relations, in complete synergy with what a salesperson must do in a shop. You have to be able to harmonize all the strategies and maintain the contacts that you will have with a consumer, both on a digital and physical level. And this digital response has all its relevance since we consume media every day.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong>4° &#8211; What are the benefits\/advantages for businesses and consumers?&nbsp;<\/strong><\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong>D.L <\/strong>: For the consumer it&#8217;s quite simple. I don&#8217;t know if you&#8217;ve ever walked into a shop about ten times and had the following experience: the first time, the staff doesn&#8217;t know you, the second time they know you a little bit more, and the third time they say hello and call you by your first name and ask you if you liked the product. In short, a real relationship is created. If a good relationship develops, chances are you will return to this shop. For both sides, the individualization of the relationship &#8211; and especially the marketing relationship you have with the consumer &#8211; offers many advantages: the closer you are to the consumer&#8217;s need, the more you tend to forget about marketing. If I am restoring my garden with Leroy Merlin and I want to buy a garden shed, and the shop gives me information about it, from a customer point of view, it will not be marketing but a service. In short, the closer the retailer is to the consumer&#8217;s needs, the more effective marketing will be, not only because the retailer will come to the consumer for what interests them, but also because the retailer will be invisible, perceived as a service by the consumer themselves.&nbsp;<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">As a result of individualized marketing, the company is able, in terms of return on investment (ROI), to generate an additional 2 to 4% of its total turnover. Individualization brings both consumer benefit -by being better addressed and supported- and commercial performance on the retailer&#8217;s side.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">Over a long period of time, the strategy of individualization helps to build customer loyalty. Since 2015, for example, we have been working with the Beaumanoir group [a ready-to-wear distribution and logistics group], which has seen an improvement in customer value (i.e. spending per customer on their database) year after year. They realized that through a more individualized marketing approach, they were able to develop customer value, which entails an additional expense per individual.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong>5° &#8211; How is BUT (furniture retailer) representative of your work?&nbsp;<\/strong><\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong>D.L <\/strong>: BUT is a good example in terms of business performance and internal company transformation. It&#8217;s easy to see why: they have 80 million visits to their website every year, including 4 million customers who actually come to buy in shops or e-commerce. So there are 76 million potential customers who at one time or another had an interest in products marketed by the brand, but this interest was not converted, or at least not at BUT.&nbsp;<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">The problem posed by Thierry Lernon, Managing Director of marketing, customer experience, data and e-commerce at BUT, is as follows : how to identify, among the 76 million individuals, those who potentially still have an interest and who we will be able to work in a particular way in terms of marketing to bring them to conversion? Thanks to the Advalo solution, in the space of six months, the brand generated an additional 1% incremental turnover, out of a total turnover of 1 billion euros.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">In terms of marketing expertise, this example shows that we know how to generate sales performance. And not only that. The company has undergone major changes internally. The CRM team, which sent emails, letters, catalogues, etc., had little or no communication with the digital team that ran the e-commerce site and bought campaigns on Facebook, Google and other media. Bringing them a platform that pushes them towards omnicanality has allowed these two poles to meet, which complement each other since they are the same consumer, whether on Facebook, the But website or in the shop. This internal collaboration, driven by Advalo, has enabled the company to evolve.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">This is all the more striking since the retailer has to manage different purchasing journeys. You can go to a But shop to buy small items as well as larger ones, and this will have an impact on the purchasing journeys, which will be either very short or longer. Buying a kitchen, for example, involves several weeks of reflection. You therefore need to know how to adapt to the different challenges of the brand: small products, which are not very engaging, or large products, which are more engaging, such as a kitchen. For customers, buying a kitchen represents a real engaging purchase. It is therefore necessary to be able to accompany the consumer during the 40-day reflection period when starting a kitchen project.<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><span style=\"color: #666666;\">This project has enabled us to convince brands such as Leroy Merlin, with whom we have just started a collaboration and who have similar challenges.&nbsp;<\/span><\/p>\n<p style=\"text-align: justify;\">\n<p style=\"text-align: justify;\"><strong>6° &#8211; In what ways has the current crisis reshuffled the cards when it comes to marketing? And what lessons have you learned?&nbsp;&nbsp;<\/strong><\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\"><strong>D.L <\/strong>: The crisis has reshuffled the cards in two ways in my opinion:&nbsp;<\/p>\n<p style=\"text-align: justify;\">1\/ The crisis has hurt companies&#8217; balance sheets, with shops being closed, so no turnover, very little income. The first subject was to say that we can no longer have mass marketing, which is too expensive. The costs of acquiring a campaign on Facebook are increasingly high. It is therefore no longer possible to spend for everyone, all the time, and it becomes essential to choose the right budget allocation for the best return on investment. Advalo has the ability to better target individuals who are likely to be the most reactive. The solution allows you to spend less, while maintaining the same level of efficiency.&nbsp;&nbsp;<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">2\/ Many retailers respond to a crisis by doing even more promotions and sending even more emails, which is harmful in every way. The more emails I receive, the less I&#8217;m going to want to read them, so I&#8217;m going to put them in the spam box directly, and we lose potential customers in the process. The more you get customers used to consuming at -30%, -40%, the more the perception of a brand is degraded. Finally, the customer may consider that it is no longer worthwhile to buy at full retail price because it is on sale all the time. He or she will therefore wait for the next sales promotions.&nbsp;<\/p>\n<p style=\"text-align: justify;\">&nbsp;<\/p>\n<p style=\"text-align: justify;\">Advalo&#8217;s mission is to help retailers break out of this downward spiral in terms of customer relations and margins. The real change is to achieve this transition.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p><span>Need more information? Please contact us. Our experts will be delighted to discuss your marketing issues with you.<\/span><\/p>\n<p>&nbsp;<\/p>\n<p><span>{{cta(&#8216;b370ed6a-b67d-480b-af9a-127a2f932dfb&#8217;,&#8217;justifycenter&#8217;)}}<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>For David Le Douarin, co-founder of the Advalo platform, personalized marketing offers retailers the opportunity to respond effectively to the needs of consumers at any given time. In an exclusive interview for Actu Retail, he discusses the evolution of marketing and the rise of personalization in business-to-consumer relations in light of the economic crisis.<\/p>\n","protected":false},"author":28,"featured_media":16122,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>[INTERVIEW] David Le Douarin: &quot;The closer we are to consumer needs, the more we tend to forget about marketing&quot; - Skeepers<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"[INTERVIEW] David Le Douarin: &quot;The closer we are to consumer needs, the more we tend to forget about marketing&quot; - Skeepers\" \/>\n<meta property=\"og:description\" content=\"For David Le Douarin, co-founder of the Advalo platform, personalized marketing offers retailers the opportunity to respond effectively to the needs of consumers at any given time. In an exclusive interview for Actu Retail, he discusses the evolution of marketing and the rise of personalization in business-to-consumer relations in light of the economic crisis.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-17T07:35:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-12-07T15:08:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/David-Le-Douarin-1-scaled-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1306\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Juanita Solano\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Juanita Solano\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/\",\"name\":\"[INTERVIEW] David Le Douarin: \\\"The closer we are to consumer needs, the more we tend to forget about marketing\\\" - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2020-09-17T07:35:34+00:00\",\"dateModified\":\"2023-12-07T15:08:54+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb\"},\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"[INTERVIEW] David Le Douarin: &#8220;The closer we are to consumer needs, the more we tend to forget about marketing&#8221;\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb\",\"name\":\"Juanita Solano\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g\",\"caption\":\"Juanita Solano\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"[INTERVIEW] David Le Douarin: \"The closer we are to consumer needs, the more we tend to forget about marketing\" - Skeepers","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/","og_locale":"en_US","og_type":"article","og_title":"[INTERVIEW] David Le Douarin: \"The closer we are to consumer needs, the more we tend to forget about marketing\" - Skeepers","og_description":"For David Le Douarin, co-founder of the Advalo platform, personalized marketing offers retailers the opportunity to respond effectively to the needs of consumers at any given time. In an exclusive interview for Actu Retail, he discusses the evolution of marketing and the rise of personalization in business-to-consumer relations in light of the economic crisis.","og_url":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/","og_site_name":"Skeepers","article_published_time":"2020-09-17T07:35:34+00:00","article_modified_time":"2023-12-07T15:08:54+00:00","og_image":[{"width":2560,"height":1306,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/David-Le-Douarin-1-scaled-1.jpg","type":"image\/jpeg"}],"author":"Juanita Solano","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Juanita Solano","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/","url":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/","name":"[INTERVIEW] David Le Douarin: \"The closer we are to consumer needs, the more we tend to forget about marketing\" - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2020-09-17T07:35:34+00:00","dateModified":"2023-12-07T15:08:54+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb"},"breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/interview-david-le-douarin-the-closer-we-are-to-consumer-needs-the-more-we-tend-to-forget-about-marketing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"[INTERVIEW] David Le Douarin: &#8220;The closer we are to consumer needs, the more we tend to forget about marketing&#8221;"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/93d2c60d6a3ca8f7920ff2416c3a39eb","name":"Juanita Solano","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/e3406711fa027834d6dd585335fd418e?s=96&d=mm&r=g","caption":"Juanita Solano"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16121"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16121"}],"version-history":[{"count":1,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16121\/revisions"}],"predecessor-version":[{"id":23826,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16121\/revisions\/23826"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/16122"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16121"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}