{"id":16229,"date":"2021-09-09T05:47:27","date_gmt":"2021-09-09T05:47:27","guid":{"rendered":"https:\/\/skeepers.io\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/"},"modified":"2023-09-15T13:26:07","modified_gmt":"2023-09-15T12:26:07","slug":"employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/","title":{"rendered":"6 reasons why you should use Employee Generated Content"},"content":{"rendered":"\n<p>What do Leroy Merlin, Petit Bateau and M·A·C Cosmetics have in common? All three of these retailers had the great idea of getting their employees to make videos showcasing their brand’s products. This is what’s called an employee-generated content (or EGC) strategy. And as you will see here, it gets results! But before we present these three case studies, let’s start from the beginning:<\/p>\n\n\n\n<ul id=\"block-11a92ff7-19af-4546-97fa-cc7ef0527b67\"><li>What is employee-generated video content?<\/li><li>What are the main benefits and the biggest reasons to invest in this type of initiative?<\/li><\/ul>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"block-5f465a26-a205-4b67-8008-9f5bb29184d9\"><strong>What is employee-generated video content? [Definition]<\/strong><\/h2>\n\n\n\n<p id=\"chap1\">You might be familiar with UGC or&nbsp;<a href=\"https:\/\/teester.com\/en\/blog\/what-is-user-generated-content\/\">user-generated content<\/a>. UGC is the term given to all content produced by customers and users, including online reviews, comments on articles or social media, testimonials and so on.&nbsp;User-generated videos are another example of UGC.&nbsp;<\/p>\n\n\n\n<p>The odds are high that you’ve never heard of EGC or employee-generated content, though. So, what is it? You’ve probably guessed; the principle is the same as for UGC.&nbsp;<strong>EGC is the content your employees create about your products.<\/strong>&nbsp;Some people call it ‘employee UGC’. But whatever the term used for it, the innovative idea behind it is to&nbsp;<strong>get the company’s teams to create original and authentic content that will increase customer engagement.<\/strong>&nbsp;<\/p>\n\n\n\n<p>It might seem like there’s only a very fine line between EGC and brand content, but we’re going to show you the fundamental difference between the two by way of a concrete use case. We’re going to talk about a content format that we’re particularly fond of here at SKEEPERS: video. Have you already thought of getting your employees to <strong>make how-to videos or expert videos for your website and social media accounts<\/strong>? If so, then you’re already making employee-generated video content without knowing it!&nbsp;<\/p>\n\n\n\n<p>Later on, we’ll show you three great initiatives rolled out by our customers and partners. But first, here are six excellent reasons to get your employees involved in creating videos about your products and brand.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"six-reasons-to-get-your-staff-involved-in-making-videos-to-talk-about-your-products\"><strong>Six reasons to get your staff involved in making videos to talk about your products<\/strong><\/h2>\n\n\n\n<p id=\"chap2\">Each of these is a good enough reason to dive into the employee-generated video (EGV) adventure !<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"1-increase-customer-engagement-thanks-to-your-employees\"><strong>1 – Increase customer engagement thanks to your employees<\/strong><\/h3>\n\n\n\n<p>Getting your employees to make videos for you is an excellent way to increase customer <a href=\"https:\/\/skeepers.io\/en\/blog\/why-is-customer-engagement-a-key-marketing-lever\/\" target=\"_blank\" rel=\"noreferrer noopener\">engagement<\/a>. Let’s take the example of a product page on an e-commerce site. What generally deters people from buying? A lack of details about the product, a lack of understanding of the product, and the inability to touch and test the product. The digital medium creates distance between the product and the customer. Integrating a video that features the product directly into the product page gives it a human touch and&nbsp;<strong>helps<\/strong>&nbsp;<strong>bridge the distance the digital medium creates between the product and the consumer<\/strong>. Employee-generated videos become vectors of customer engagement and contribute to increasing conversions.<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/image-3-1.png\" alt=\"customer interactions\" class=\"wp-image-656\" width=\"650\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-give-customers-a-glimpse-behind-the-curtain\"><strong>2 – Give customers a glimpse behind the curtain&nbsp;<\/strong><\/h3>\n\n\n\n<p>Your employees are the life and soul of your company, yet your customers rarely get to see them because they generally work behind the scenes.&nbsp;<strong>Involving your employees in the creation of user-generated videos is a great way to put them in the spotlight<\/strong>&nbsp;and show your customers the people behind the brand, the faces behind the products.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"3-increase-employee-engagement\"><strong>3 – Increase employee engagement<\/strong><\/h3>\n\n\n\n<p>Getting your employees to make user-generated videos can make their job feel more rewarding and meaningful.&nbsp;<strong>Employee-generated videos help show your teams that you value their work.<\/strong>&nbsp;A lot of companies look for ways to increase employee engagement. Actively involving your employees in the creation of expert or how-to videos is an excellent way to achieve this objective and&nbsp;<strong>create a positive dynamic within your company<\/strong>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"4-deliver-your-customers-expert-advice\"><strong>4 – Deliver your customers expert advice<\/strong><\/h3>\n\n\n\n<p>Customers don’t always know how to make the best use of the products they buy. Some products have a “technical” component that makes them complex to set up and use. And actually, in e-commerce, this is often a barrier to conversion. “<em>I like this product and I wouldn’t mind buying it, but I’m not sure I’d know how to use it. I’d prefer to go to a store and get advice from a sales assistant…<\/em>” We’ve all thought this at some point!&nbsp;<\/p>\n\n\n\n<p>With how-to videos and advice videos made by your employees,&nbsp;<strong>you can set your customers’ mind at ease and help them make the best possible use of their products<\/strong>. By educating, you can really highlight your products and their benefits. It’s an authentic way to present the advantages of your products without the hype, so it’s more effective.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"5-humanize-remote-customer-relationships\"><strong>5 – Humanize remote customer relationships<\/strong><\/h3>\n\n\n\n<p>Through your presence on the digital channels (website and social media), you build remote relationships with your customers; you offer them a remote customer experience. This has a number of advantages, but also some disadvantages:&nbsp;<strong>the screen barrier dehumanizes customer relationships and the customer experience<\/strong>. There again, employee-generated videos are a way to bridge the distance created by the digital medium and&nbsp;<strong>add an essential layer of humanity to your digital channels<\/strong>.<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/le-buzz-KiEiI2b9GkU-unsplash-scaled-1-1024x683-1.jpeg\" alt=\"employee video computer\" class=\"wp-image-657\" width=\"650\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"6-share-the-brand-s-values\"><strong>6 – Share the brand’s values<\/strong><\/h3>\n\n\n\n<p>Finally, employee-generated videos are a chance to share your brand’s values. Videos allow you to authentically and naturally communicate the values that underpin your brand.&nbsp;<\/p>\n\n\n\n<p><strong>Making your teams the stars of your <a href=\"https:\/\/skeepers.io\/en\/solution-user-generated-video-en\/\" target=\"_blank\" rel=\"noreferrer noopener\">user-generated videos<\/a><\/strong> is a logical next step to user-generated videos made by and for your customers. This innovative approach lets you leverage the now-essential video medium even more.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"three-examples-of-how-staff-were-involved-in-the-production-of-employee-generated-video-content\"><strong>Three examples of how staff were involved in the production of employee-generated video content<\/strong><\/h2>\n\n\n\n<p id=\"chap3\">Now that we’ve covered the theory, let’s get down to how this all looks in practice. Several of SKEEPERS&#8217; partners and clients have made the choice to roll out employee-generated video content. A lot can be learned from these highly imaginative initiatives. Looking at concrete examples is the best way to fully grasp the benefits of implementing EGC. We’ve decided to show you what Leroy Merlin, Petit Bateau and M·A·C Cosmetics have done.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-1-leroy-merlin\"><strong>Example 1: Leroy Merlin<\/strong><\/h3>\n\n\n\n<p>The famous French DIY retailer turned to the digital medium at the height of the COVID-19 crisis. This pivot seemed like an obvious choice given how much time the French were spending on DIY during this period. For the retailer’s employees, it was also a way to&nbsp;<strong>make themselves useful to their customers during lockdown<\/strong>. Leroy Merlin started by offering online workshops run by staff members, but very quickly wanted to take things up a notch by diving head first into user-generated video.<\/p>\n\n\n\n<p>In September 2020, a new idea began to take root: Leroy Merlin wanted to directly involve its teams in the creation of how-to videos. The retailer had two goals in mind:&nbsp;<\/p>\n\n\n\n<ul><li><strong>Support consumers with<\/strong>&nbsp;<strong>high-value video content<\/strong>,&nbsp;to drive sales by generating new sources of&nbsp;on and offline traffic.<\/li><\/ul>\n\n\n\n<p><strong>Digitize the salesforce and have its employees appear in videos<\/strong> (how-to, tutorials and expert advice) to help customers just starting out in DIY.<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Image-1-Article-EGC-Content.png\" alt=\"employee videos\" class=\"wp-image-659\" width=\"650\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p><strong>Leroy Merlin leveraged SKEEPERS&#8217; Video Creator Platform to roll this out.<\/strong> Thanks to this platform, Leroy Merlin was able to:<\/p>\n\n\n\n<ul><li>Identify the most driven employees, through custom questionnaires and video castings managed via the platform.<\/li><li>Walk them through the creation of tutorial videos.<\/li><li>Automatically optimize and edit the videos for e-commerce.<\/li><li>Instantly post the videos on product pages and social media.<\/li><li>Analyze the impact of the videos on sales.<\/li><\/ul>\n\n\n\n<p>The videos were posted to “<a href=\"https:\/\/makeit.leroymerlin.fr\/\" target=\"_blank\" rel=\"noreferrer noopener\">Make It<\/a>”, the brand’s website devoted to DIY advice. They were also shared on social media and to the Leroy Merlin “Make It” page on YouTube. In total, more than 200 videos of 3 to 7 minutes each were made over a period of 6 months. Some one hundred Leroy Merlin employees were involved in the project. The brand is proud of this success and now plans to share the videos on its main website.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-2-m-a-c-cosmetics\"><strong>Example 2: M·A·C Cosmetics<\/strong><\/h3>\n\n\n\n<p>Here’s another example of how you could get your teams involved in making employee-generated video content. With a presence in over 90 countries, M·A·C is a leading player in the makeup sector. The brand wanted to enhance its product pages with videos made by its professional makeup artists. The approach M·A·C used is similar to the one described in the previous example. <strong>The goal was to shine a spotlight on the work of the brand’s makeup artists and give M·A·C Cosmetics customers pro tips on video.<\/strong><\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Image-3-article-EGC.png\" alt=\"computer video\" class=\"wp-image-660\" width=\"600\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>M·A·C Cosmetics used SKEEPERS&#8217; Video Creator Platform to automate the creation of the employee-generated videos. The videos are automatically optimized for posting on the product pages of the brand’s various e-commerce sites and on social media.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-3-petit-bateau\"><strong>Example 3: Petit Bateau<\/strong><\/h3>\n\n\n\n<p>Petit Bateau really wanted to put the teams behind their products in front of the camera. Who exactly are these people who are the beating heart of the company? Who does what? What role does each person play in the making of the products? The kids’ fashion label wanted to <strong>tell the story of its products<\/strong> and present the more “technical” ones, i.e. the ones that are perhaps a bit less straightforward to use.<\/p>\n\n\n\n<p>To achieve these goals, Petit Bateau placed its trust in SKEEPERS by using its user-generated video solution to encourage its employees to make videos. One of these videos was made by Petit Bateau’s longest-standing employee, a woman who joined the company at the age of 16. She started out as a seamstress and now manages a sewing team. Through these videos, Petit Bateau <strong>shows the transgenerational side of the brand<\/strong>. These videos are a way to share the brand’s values with its customers, as well as its commitments to CSR.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"in-a-nutshell\"><strong>In a nutshell<\/strong><\/h2>\n\n\n\n<p id=\"chap4\">Employee-generated video is a very promising form of employee-generated content. It is a great approach for bringing customers and employees closer together, <strong>creating a stronger connection between the customers and the brand.<\/strong> The rewards you can expect? A cost-effective increase in customer engagement and loyalty. SKEEPERS helps you achieve your ambitions:<\/p>\n\n\n\n<ul><li>By bringing you a platform that makes it really easy to create and share videos. Zero technical skills required!<\/li><li>By having video experts on hand to support you.<\/li><\/ul>\n\n\n\n<p>Ready to give EGV a go?<\/p>\n\n\n\n<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-cb2d0916-f405-47e9-bb18-4064b993938a\"><span class=\"hs-cta-node hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\" id=\"hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"><\/div><![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/cb2d0916-f405-47e9-bb18-4064b993938a\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"hs-cta-img\" id=\"hs-cta-img-cb2d0916-f405-47e9-bb18-4064b993938a\" style=\"border-width:0px;\" height=\"159\" width=\"700\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/cb2d0916-f405-47e9-bb18-4064b993938a.png\" alt=\"Discover our Solutions: Book your Demo\"><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"> hbspt.cta.load(20304540, 'cb2d0916-f405-47e9-bb18-4064b993938a', {\"useNewLoader\":\"true\",\"region\":\"na1\"}); <\/script><\/span><!-- end HubSpot Call-to-Action Code -->\n","protected":false},"excerpt":{"rendered":"<p>What do Leroy Merlin, Petit Bateau and M·A·C Cosmetics have in common? All three of these retailers had the great idea of getting their employees to make videos showcasing their brand’s products. This is what’s called an employee-generated content (or EGC) strategy. And as you will see here, it gets results! But before we present&#8230;<\/p>\n","protected":false},"author":5,"featured_media":91309,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[148,124],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>6 reasons why you should use Employee Generated Content - Skeepers<\/title>\n<meta name=\"description\" content=\"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"6 reasons why you should use Employee Generated Content - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-09-09T05:47:27+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:26:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/12\/pexels-anna-nekrashevich-12433030-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1707\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/\",\"name\":\"6 reasons why you should use Employee Generated Content - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-09-09T05:47:27+00:00\",\"dateModified\":\"2023-09-15T12:26:07+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"6 reasons why you should use Employee Generated Content\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"6 reasons why you should use Employee Generated Content - Skeepers","description":"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/","og_locale":"en_US","og_type":"article","og_title":"6 reasons why you should use Employee Generated Content - Skeepers","og_description":"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!","og_url":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/","og_site_name":"Skeepers","article_published_time":"2021-09-09T05:47:27+00:00","article_modified_time":"2023-09-15T12:26:07+00:00","og_image":[{"width":2560,"height":1707,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/12\/pexels-anna-nekrashevich-12433030-scaled.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/","url":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/","name":"6 reasons why you should use Employee Generated Content - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-09-09T05:47:27+00:00","dateModified":"2023-09-15T12:26:07+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Discover what is Employee Generated Content (EGC) and the 6 reasons why you should ask your teams to make videos showcasing your products!","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/employee-generated-content-6-reasons-why-your-teams-should-be-making-videos-about-your-brand\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"6 reasons why you should use Employee Generated Content"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16229"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16229"}],"version-history":[{"count":6,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16229\/revisions"}],"predecessor-version":[{"id":94787,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16229\/revisions\/94787"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/91309"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16229"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16229"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16229"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16229"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}