{"id":16227,"date":"2021-06-10T06:20:43","date_gmt":"2021-06-10T06:20:43","guid":{"rendered":"https:\/\/skeepers.io\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/"},"modified":"2023-09-15T13:25:08","modified_gmt":"2023-09-15T12:25:08","slug":"how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/","title":{"rendered":"travel &amp; tourism industry: increase your bookings thanks to UGC"},"content":{"rendered":"\n<figure class=\"wp-block-image size-large\"><\/figure>\n\n\n\n<p>Summer 2021 will be critical for the travel and tourism industries. To generate bookings, attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to <a href=\"https:\/\/skeepers.io\/en\/blog\/ugc-and-influencer-marketing-how-will-they-complement-each-other-in-2022\/\">User-Generated Content<\/a>.&nbsp;<\/p>\n\n\n\n<p>UGC is content that is created by the users of a brand, about a product, service or experience. You might be unfamiliar with the term, but you’ve definitely been exposed to UGC before. Text comments and customer reviews left on online platforms are all UGC. Instagram or Facebook stories and posts in which travellers share their experience are also UGC. Over the last few years, a new format of UGC has emerged on the scene: user-generated video.&nbsp;<\/p>\n\n\n\n<p>Why are travel and tourism companies turning to user-generated content to present their offerings?&nbsp; What are the most popular formats? And what impact does this content have on sales?&nbsp;<\/p>\n\n\n\n<p>We’ll tell you everything in this article!&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap1\"><strong>Consumers User-generated content (UGC) plays a key role in the buying process<\/strong>&nbsp;<\/h2>\n\n\n\n<p>The COVID crisis might have momentarily disrupted the market, but make no mistake: the choice of holiday packages and tourist destinations is broader than ever.<\/p>\n\n\n\n<p>The questions travellers are asking themselves before their trip haven’t changed:&nbsp;<\/p>\n\n\n\n<ul><li>Which destination should I choose out of everything that is available?&nbsp;<\/li><li>Which offer should I pick among all the options out there?&nbsp;<\/li><li>Who should I book through? (agency, tour operator, online platform, etc.).<\/li><\/ul>\n\n\n\n<p>We each have our own preferences, some prefer the mountains, others the sea. One thing is certain,&nbsp;<strong>85% of consumers start planning their trip or holiday by researching online.<\/strong>&nbsp;<\/p>\n\n\n\n<p>For this, they mainly use search engines (thanks, Google) and social media. The first level of information is usually what is presented by travel agencies, hotel chains, and price comparison websites. But to sort through all these results, consumers then look for&nbsp;<strong>a second level of information that is more credible, more authentic, and perceived as more trustworthy: user-generated content<\/strong>. That’s right, who better than another tourist to share their experience of a stay or help us choose our next destination?<\/p>\n\n\n\n<p>Whether it’s in the form of customer reviews, recommendations, shared posts on social media, photos or videos, it’s UGC that will seal the deal and confirm whether or not the destination is the right one and the service is up to par.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Capture-review-covid.png\" alt=\"\" class=\"wp-image-279\" title=\"Capture review covid\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap2\"><strong>8 reasons to leverage user-generated content in the tourism sector<\/strong><\/h2>\n\n\n\n<p>Let’s take a look at the main reasons for using UGC if you’re in the tourism industry.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"1-ugc-makes-your-customers-the-stars-of-the-show\"><strong>1 – UGC makes your customers the stars of the show<\/strong><\/h3>\n\n\n\n<p>You might say that user-generated content is about applying a true customer-centric approach when creating content. Unlike brand content designed FOR customers, UGC is content created BY customers. UGC takes you a step further along the customer-centric path. You could say it’s the customer-centric approach on steroids&nbsp;<\/p>\n\n\n\n<p>Integrating UGC into your marketing strategy is a way to show that you are a customer-centric brand that&nbsp;<strong>listens to its users<\/strong>. Your customers become actively involved in your communication. UGC helps to strengthen the relationship between your brand and your existing or potential customers.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"2-ugc-is-authentic-content-that-inspires-confidence\"><strong>2 – UGC is authentic content that inspires confidence<\/strong><\/h3>\n\n\n\n<p>User-generated content inspires more confidence in the people you are targeting. There’s a good reason for this: your users or customers are unbiased in their judgement, whereas the brand will understandably tend to talk up their offer.&nbsp;<\/p>\n\n\n\n<p>Consumers place more stock in a customer review than in promotional content produced by the brand. Several studies have shown the extent to which UGC, and customer reviews in particular, influence the decision to buy.&nbsp;<a href=\"https:\/\/www.brid.tv\/advantages-and-disadvantages-of-user-generated-content\/\">According to one of them<\/a>, 82% of consumers stated they believed that UGC played a significant role in their decision-making process. This brings us to our next point.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"3-user-generated-content-improves-the-effectiveness-of-your-online-channels\"><strong>3 – User-generated content improves the effectiveness of your online channels<\/strong><\/h3>\n\n\n\n<p>Players in the tourism sector have massively shifted to digital over the last few years. These days, for many of them, online channels are the main way to reach and convert new customers. Using and prominently displaying UGC increases the conversion rate on your website and social media. User-generated content is&nbsp;<strong>a tool for capturing new customers<\/strong>. Just to drive this point home, last year brands and retailers that featured user-generated videos on their product pages saw their conversion rate rise by&nbsp;<strong>68% on average<\/strong>!&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Image-musee-1024x822-1.png\" alt=\"\" class=\"wp-image-281\" title=\"Image musée\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"4-ugc-increases-engagement-on-social-media\"><strong>4&nbsp;– UGC increases engagement on social media<\/strong><\/h3>\n\n\n\n<p>Brands that share user-generated content (reviews, photos, etc.) on social media see a significant increase in customer engagement. This translates to more comments, more likes, more clicks on your landing pages. UGC is one of the most effective tools for&nbsp;<strong>creating a community spirit<\/strong>&nbsp;around your brand.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"5-ugc-increases-the-reach-of-your-communication\"><strong>5 – UGC increases the reach of your communication<\/strong><\/h3>\n\n\n\n<p>Content that is generated and shared by your users reaches their acquaintances, family, friends, peers. With UGC, you reach a lot more people. Leveraging UGC is a fantastic way to increase and accelerate positive word-of-mouth about your brand.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"6-ugc-reduces-your-marketing-costs\"><strong>6 – UGC reduces your marketing costs<\/strong><\/h3>\n\n\n\n<p>Basically, UGC allows you to delegate part of your content creation to your users. Your users create and share content about your brand for free. On top of being effective, UGC is cheaper to manage than brand content production or ad campaigns. UGC is the ideal&nbsp;<strong>combination of effectiveness and cost control<\/strong>!<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"7-ugc-improves-your-seo\"><strong>7 – UGC improves your SEO<\/strong><\/h3>\n\n\n\n<p>User-generated content has a&nbsp;<strong>positive impact on your website’s SEO<\/strong>. For several reasons:<\/p>\n\n\n\n<ul><li>It tends to increase the time spent on your site, which sends a positive signal to the Google algorithm.<\/li><li>Content creation is one of the key ways to achieve a good search engine ranking. So, by definition, user-generated text-based content boosts your SEO, particularly as it’s often full or key words and expressions.<\/li><li>UGC generates the creation of backlinks, i.e. external links that take users to your website.&nbsp;<\/li><\/ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"8-ugc-gives-you-massive-insight-into-your-customers\"><strong>8 – UGC gives you massive insight into your customers<\/strong><\/h3>\n\n\n\n<p>User-generated content is a&nbsp;<strong>precious source of customer feedback<\/strong>. UGC can give you a better understanding of the needs, expectations and motivations of your target customers.&nbsp;<\/p>\n\n\n\n<p>UGC also helps to identify areas for improvement, which is why even negative customer reviews can be a gold mine: they’re usually the ones that give you the best information on how to improve your offer, your service or your customer experience.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"chap3\"><strong>The main user-generated content formats<\/strong><\/h2>\n\n\n\n<p>UGC comes in different formats: text, images, videos…It can be posted and shared via different broadcast channels: website, social media, forums, etc.Let’s look at the UGC formats most widely used in the tourism industry.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"blog-comments\"><strong>Blog comments<\/strong><\/h3>\n\n\n\n<p>If your showcase website includes a blog, opening up the comments under your articles will encourage your visitors to produce content. Content management systems (CMS) all provide a comment functionality that allows comment moderation prior to publication on the website. You retain control while giving your visitors a means of expression.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Capture-3-the-Metropolitan-Museum-1024x866-1.png\" alt=\"\" class=\"wp-image-280\" title=\"Capture 3 the Metropolitan Museum\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"text-based-reviews-and-review-platforms-tripadvisor-booking-com-etc\"><strong>Text-based reviews and review platforms (Tripadvisor, Booking.com, etc.)<\/strong><\/h3>\n\n\n\n<p>Here’s a second example of a UGC format: the <a href=\"https:\/\/www.netreviews.com\/en\/blog\/how-to-utilize-positive-and-negative-reviews\/\">reviews consumers<\/a> leave about an offer, service or brand. These reviews can be collected on the website, on the product pages of your online shop if you have one, on forums and of course on social media. This type of UGC is very powerful for two reasons:<\/p>\n\n\n\n<ul><li>The reviews have a significant impact on a travel consumer’s decision-making process.<\/li><li>These reviews allow you, as a brand, to identify your strong points, what your customers don’t like, plus any areas for improvement.<\/li><\/ul>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Capture-Booking-1024x713-1.png\" alt=\"\" class=\"wp-image-282\" title=\"Capture Booking\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<p>But it’s on platforms, especially, that customer reviews are king. They are an integral part of their<br>value proposition. On platforms like Tripadvisor, Booking, Apartcity or Airbnb, customer reviews<br>make all the difference.<br>Example of customer reviews left on Apartcity:<br>And let’s not forget the reviews left on Google Shopping – these are featured prominently on the<br>search engine. In the tourism sector, signing up to Google Shopping is an absolute must.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Capture-Reviews-Airbnb.png\" alt=\"\" class=\"wp-image-283\" title=\"Capture Reviews Airbnb\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<p>And let’s not forget the reviews left on Google Shopping – these are featured prominently on the<br>search engine. In the tourism sector, signing up to Google Shopping is an absolute must.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Capture-google-reviews.png\" alt=\"\" class=\"wp-image-284\" title=\"Capture google reviews\"\/><\/figure>\n\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><\/figure>\n<\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"travel-photos\"><strong>Travel photos<\/strong>&nbsp;<\/h3>\n\n\n\n<p>Visual UGC is super effective in the travel and tourism world. As the saying goes,&nbsp;<strong>a picture is worth a thousand words<\/strong>. Visual UGC (photos) have a massive influence on consumers. Visual UGC is the mainstay of social media: of Instagram, of course, but also of Facebook, Pinterest, etc.The content can take the form of grid posts or stories.<\/p>\n\n\n\n<p>According to a&nbsp;<a href=\"https:\/\/www.telegraph.co.uk\/news\/2019\/04\/25\/instagram-replacing-travel-brochures-survey-finds-social-media\/\">survey conducted by the Telegraph<\/a>,&nbsp;<strong>55% of 18- to 65-year-olds are influenced by Instagram posts when they book a trip<\/strong>. You’re in the tourism sector and you’d like to shake up your marketing strategy? Set up an Instagram account! These days, it’s clearly a must-have.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"user-generated-videos\"><strong>User-generated videos<\/strong><\/h3>\n\n\n\n<p>If a picture is worth a thousand words, it would be fair to say that a video is worth a thousand pictures! After all, isn’t a video just a series of pictures? In all seriousness, over the last few years <strong>videos have been gaining major ground in marketing<\/strong>. Video is the most powerful medium for sharing a message, and it is <strong>the most popular and most consumed format among web users<\/strong>. For a long time, video was on the sidelines due to the high cost of production. But these days there are <a href=\"https:\/\/skeepers.io\/en\/solution-user-generated-video-en\/\">platforms that automate the creation of marketing videos<\/a>, and particularly of user-generated videos. <\/p>\n\n\n\n<p>To give you an idea of how this works in practice, let’s look at the&nbsp;<strong>Vacances Bleues example<\/strong>. The chain of hotels, resorts and clubs wanted to&nbsp;<strong>encourage its customers to make and share videos about their experience<\/strong>. The brand used the SKEEPERS UGV platform to help its best customers make user-generated videos, optimize the videos so they looked professional, and post the videos on social media and on their website. Vacances Bleues sent an invitation out to its top customers and received about a hundred video applications within a few days. Here’s the email they sent to encourage customers to become ambassadors and step in front of the camera.<\/p>\n\n\n\n<p>The campaign was a success and it allowed the brand to revamp its content strategy with the help of its satisfied customers.&nbsp;<\/p>\n\n\n\n<p><iframe loading=\"lazy\" style=\"border-radius: 10px;\" src=\"https:\/\/player.teester.com\/#id=f8294b8d-bbbf-40fb-90a1-1447ae751413\" width=\"700px\" height=\"394px\" frameborder=\"0\" align=\"center\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n\n\n\n<p>In fact, it was so successful that Vacances Bleues decided to launch another for the 2021 season, to collect more video content for its digital platforms and fill up its hotels on the strength of customer recommendations!&nbsp; If you’d like to find out more about our user-generated video solutions today, feel free to contact us! We’ll be happy to explain how it all works.<\/p>\n\n\n\n<p>In the era of advocacy marketing, your travel customers are your best ambassadors. Get them making videos to reassure and inspire other tourists and travellers before their holiday!&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Summer 2021 will be critical for the travel and tourism industries. To generate bookings, attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to User-Generated Content.&nbsp; UGC is content that is created by the users of a brand, about a&#8230;<\/p>\n","protected":false},"author":5,"featured_media":24234,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[100,160],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers<\/title>\n<meta name=\"description\" content=\"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-10T06:20:43+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-09-15T12:25:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/How-players-in-the-travel-tourism-industry-are-leveraging-user-generated-content-to-increase-their-booking-scaled-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"2022\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/\",\"name\":\"travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-06-10T06:20:43+00:00\",\"dateModified\":\"2023-09-15T12:25:08+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"travel &amp; tourism industry: increase your bookings thanks to UGC\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers","description":"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/","og_locale":"en_US","og_type":"article","og_title":"travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers","og_description":"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.","og_url":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/","og_site_name":"Skeepers","article_published_time":"2021-06-10T06:20:43+00:00","article_modified_time":"2023-09-15T12:25:08+00:00","og_image":[{"width":2560,"height":2022,"url":"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/How-players-in-the-travel-tourism-industry-are-leveraging-user-generated-content-to-increase-their-booking-scaled-1.jpg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/","url":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/","name":"travel &amp; tourism industry: increase your bookings thanks to UGC - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-06-10T06:20:43+00:00","dateModified":"2023-09-15T12:25:08+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Attract customers and reassure people in these challenging times, players in the tourism industry are having to double their efforts and are increasingly turning to UGC.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/how-players-travel-tourism-industry-leveraging-user-generated-content-increase-booking\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"travel &amp; tourism industry: increase your bookings thanks to UGC"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16227"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16227"}],"version-history":[{"count":5,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16227\/revisions"}],"predecessor-version":[{"id":132863,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16227\/revisions\/132863"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/24234"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16227"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16227"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16227"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16227"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}