{"id":16231,"date":"2021-09-09T06:16:58","date_gmt":"2021-09-09T06:16:58","guid":{"rendered":"https:\/\/skeepers.io\/blog\/where-and-how-to-use-user-generated-videos\/"},"modified":"2023-11-09T17:04:45","modified_gmt":"2023-11-09T16:04:45","slug":"where-and-how-to-use-user-generated-videos","status":"publish","type":"post","link":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/","title":{"rendered":"How to use user-generated videos to talk about your brand?"},"content":{"rendered":"\n<p>If you’re reading this article, you’re already sold on user-generated videos and their potential for marketing. At least we hope so! Now, you’re looking for use cases and the best ways to leverage the videos made by your users and customers.<\/p>\n\n\n\n<p>E-commerce product pages, social media, newsletters… In this article, we look at some ideas for sharing your user-generated videos and we give you some concrete examples of what our clients are doing.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"publish-user-generated-videos-on-your-product-pages\"><strong>Publish user-generated videos on your product pages<\/strong><\/h2>\n\n\n\n<p id=\"chap1\">Have you ever thought about adding user-generated videos to your product pages to <a href=\"https:\/\/skeepers.io\/en\/boost-website-conversions\/\">boost conversions<\/a>, reassure consumers, and improve the <a href=\"https:\/\/skeepers.io\/en\/solution-user-generated-video-en\/\" target=\"_blank\" rel=\"noreferrer noopener\">user experience<\/a>? Find out why it’s an idea you really should consider, and take a look at how one company is doing it.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"improving-product-pages-is-crucial-for-the-user-experience\"><strong>Improving product pages is crucial for the user experience<\/strong><\/h2>\n\n\n\n<p id=\"chap2\">In retail, <strong>viewing product pages is a key step in the buying process<\/strong>. The quality, relevance and level of detail on the product page all have a major impact on the conversion rate. Anyone working in <a href=\"https:\/\/skeepers.io\/en\/blog\/questions-e-commerce-buyers-journey\/\" target=\"_blank\" rel=\"noreferrer noopener\">e-commerce<\/a> knows this. And it’s why fine-tuning or reworking product pages is one of the most important things you can do to boost the performance of an online store. Improving them and enriching them should be a top priority.<\/p>\n\n\n\n<p>There’s a good reason why there are so many articles and guides out there on<strong> improving product pages<\/strong>. You’re probably already familiar with the standard advice &amp; best practices:<\/p>\n\n\n\n<ul>\n<li><strong>Use images that really show off the product.<\/strong> Visuals must be high-quality, high-definition, and show the product from different angles.<\/li>\n\n\n\n<li>The page should provide an engaging and sufficiently detailed <strong>description of the product<\/strong>. The general consensus is that it’s more important to emphasize the benefits of the product and its promise rather than focusing on its characteristics and technical features. Keep that in mind!<\/li>\n\n\n\n<li>To answer the questions visitors are asking themselves about the product, it’s a good idea to <strong>add an FAQ to the product page<\/strong>. This will help bulk up the page content too, which always helps with SEO.<\/li>\n\n\n\n<li><strong>All practical information should be easily accessible. <\/strong>That includes the price, shipping options and delivery lead times, payment options, terms and conditions, etc.<\/li>\n<\/ul>\n\n\n\n<p>Of course, we could add more to that list. But let’s get right to the point we want to drive home. Once you’ve applied all the standard advice and implemented best practices, how do you further improve your product pages and, as a knock-on effect, boost their conversion rate?<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"user-generated-videos-add-a-third-dimension-to-your-product-pages\"><strong>User-generated videos add a third dimension to your product pages<\/strong><\/h2>\n\n\n\n<p id=\"chap3\">You’ve probably guessed the answer. With user-generated videos, of course! Several of our clients have had the great idea of using SKEEPERS&#8217; <a href=\"https:\/\/skeepers.io\/en\/fashion-industry\/\" target=\"_blank\" rel=\"noreferrer noopener\">user-generated videos<\/a> to add this new dimension to their product pages. Petit Bateau is one, Decathlon is another. These two examples happen to be from the retail sector but, to be clear, user-generated videos can be added to the product pages of any company selling physical products or, in some cases, even intangible products. Their use isn’t limited to the retail sector.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-decathlon-s-orao-brand\"><strong>Example: Decathlon’s Orao brand <\/strong><\/h3>\n\n\n\n<p>Orao is a kitesurfing brand created by French sporting goods giant Decathlon. To promote the brand’s new products on its website, Decathlon had the great idea of getting its community of kitesurfers involved.<\/p>\n\n\n\n<p>How? By having them make user-generated videos. Decathlon leveraged SKEEPERS&#8217; Video Creator Platform to:<\/p>\n\n\n\n<ul>\n<li>Identify the best kitesurfer profiles by having applicants fill out a questionnaire.<\/li>\n\n\n\n<li>Walk them through the video creation process.<\/li>\n\n\n\n<li>Optimize the format of the videos for e-commerce.<\/li>\n\n\n\n<li><strong>Instantly post the videos on the relevant product pages<\/strong>.<\/li>\n\n\n\n<li>Analyze the impact of the user-generated videos on conversion rates and sales figures.<\/li>\n<\/ul>\n\n\n\n<p>The video player is integrated into the image carousel:<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Image-Blog-idees-videos-1.png\" alt=\"\" class=\"wp-image-671\" width=\"650\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"the-goal-of-this-move\"><strong>The goal of this move? <\/strong><\/h3>\n\n\n\n<ul>\n<li>Raise <a href=\"https:\/\/skeepers.io\/en\/brand-awareness\/\">awareness<\/a> of the new surf products within the community of customers.<\/li>\n\n\n\n<li>Capture new customers.<\/li>\n\n\n\n<li>Educate, reassure and inspire consumers.<\/li>\n<\/ul>\n\n\n\n<p>This initiative by Decathlon boosted the conversion rate of the Orao range of products.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"social-media-there-s-no-better-place-for-sharing-your-videos-and-growing-your-community-of-users\"><strong>Social media: there’s no better place for sharing your videos and growing your community of users<\/strong><\/h2>\n\n\n\n<p id=\"chap4\"><strong>User-generated<\/strong> <strong>videos are made by consumers for consumers.<\/strong> They are more authentic and more relatable than brand-generated videos. That’s their added value.<\/p>\n\n\n\n<p>Authenticity, connection, humanity – that’s what people are looking for on social media. That’s what makes these platforms such great places to share the videos made by your users and customers.<\/p>\n\n\n\n<p>Then there’s the video format. On Google, visual content is more of a supporting act. The star of the show is text-based content. Text is king. On social media, it’s the opposite: visual content reigns supreme. It’s what draws the most attention and it’s the best way to get a message across. And while that’s true for images, it’s even truer for video!<\/p>\n\n\n\n<p>So whether for its content (a video made by consumers) or its format (a video), user-generated video has its place on social media. In fact, social media is invaluable for sharing your videos.<\/p>\n\n\n\n<p>Many of our clients have incorporated SKEEPERS&#8217; user-generated videos into their social media strategy. From Pinterest to TikTok, Instagram, Facebook, and of course YouTube, most social media platforms are ideal for sharing user-generated videos.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-woodbrass\"><strong>Example: Woodbrass <\/strong><\/h3>\n\n\n\n<p>Woodbrass is currently the 21st largest e-commerce site in France. With a catalogue of 120,000 musical instruments, the website receives in excess of 1.5 million visitors each month. Woodbrass has been producing inspiring and educational videos for many years, but wanted to take its strategy to a new level and engage its community of passionate musicians in the creation of videos to present its products.<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Like Decathlon, Woodbrass adopted SKEEPERS&#8217; Video Creator Platform to make user-generated videos and share them on relevant product pages. In addition to publishing them on its website and product pages, the musical instrument retailer decided to leverage them on social media. <strong>The videos were posted on the brand’s social media accounts (Facebook and Instagram) and on YouTube.<\/strong><\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Without a doubt, this was a successful move. The numbers speak for themselves:<\/p>\n\n\n\n<ul>\n<li><strong>200<\/strong> is the number of videos made, approved and shared in the first year.<\/li>\n\n\n\n<li><strong>290,000<\/strong> is the number of views the user-generated videos clocked up on YouTube.<\/li>\n\n\n\n<li><strong>+5% <\/strong>is the increase in conversion rate on product pages featuring user-generated videos.<\/li>\n<\/ul>\n\n\n\n<p>In 2020, three user-generated videos made it into the top 10 most viewed videos on the Woodbrass YouTube channel.<\/p>\n\n\n\n<p>And actually, some of Woodbrass’ user-generated videos are also ranking really well on Google and appearing at the top of search results for product-related searches. For example, if you type “eagletone solea” into your favorite search engine, it’s not just one or two SKEEPERS videos that appear in the top results, it’s three!<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<figure class=\"wp-block-image aligncenter is-resized\"><img decoding=\"async\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/Image-Blog-idees-videos-4.png\" alt=\"\" class=\"wp-image-674\" width=\"650\"\/><\/figure>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>Clearly, sharing the videos on YouTube doesn’t just allow the brand to extend their reach and increase traffic, it also improves their search engine ranking, which generates more traffic. It’s a virtuous circle!<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"user-generated-videos-to-give-your-ad-campaigns-more-impact\"><strong>User-generated videos to give your ad campaigns more impact<\/strong><\/h2>\n\n\n\n<p id=\"chap5\">The two broadcast channels we just presented (product pages and social media) are the ones our clients and partners use the most. But let’s look at a few other interesting ideas for sharing your videos. We’ll start with ad campaigns.<\/p>\n\n\n\n<p>Facebook, Instagram, TikTok, and of course YouTube: all of these social media platforms allow you to create ads with video at the heart of the content.<\/p>\n\n\n\n<p>These days, a kind of consumer fatigue has set in where marketing and ads are concerned. People are bombarded with too many messages, too many ads… That’s why it’s increasingly important for brands to <strong>manage marketing pressure<\/strong>. Whether we’re talking text-based (paid search) or display ads (AdSense, etc.), “old-school” ad campaigns are losing their power. Well… on average, at least; let’s not generalize!<\/p>\n\n\n\n<p>So how can you make sure your digital ad campaigns have the impact you’re after? How do you create ad campaigns that are memorable and hit the mark? How can you improve the performance of your ads (CPC, CPA, etc.) and your return on ad spend? We’re pretty sure you know the answer by now… Yep, you guessed it: building display ads based on user-generated videos is one more idea you should really be considering! We’ll no doubt get the chance to talk about that again on this blog.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"enhance-your-newsletters-with-user-generated-videos\"><strong>Enhance your newsletters with user-generated videos<\/strong><\/h2>\n\n\n\n<p id=\"chap6\">When it comes to communicating with your <a href=\"https:\/\/skeepers.io\/en\/blog\/user-generated-content-rules-to-engage-your-communities\/\" target=\"_blank\" rel=\"noreferrer noopener\">community<\/a>, the newsletter is one classic format that never goes out of fashion. Sure, the death of email has been predicted countless times, but for the foreseeable future it’s here to stay. The newsletter is one of the main channels for customer marketing.<\/p>\n\n\n\n<p>Although the newsletter format has been around for ages, like all the other formats it’s influenced by marketing trends. More and more brands are incorporating videos into their newsletters and, more generally, into their email communication.<\/p>\n\n\n\n<p>Several of our clients have had the great idea of <strong>sharing SKEEPERS user-generated videos in their newsletters<\/strong>. French beauty brand Yves Rocher is one example and we’re happy to share their great initiative with you.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"example-yves-rocher\"><strong>Example: Yves Rocher<\/strong><\/h3>\n\n\n\n<p>Yves Rocher wanted consumers to hear directly from its customers, so it invited its community to test products in user-generated videos. For this, Yves Rocher used SKEEPERS&#8217; Video Creator Platform and chose to share the videos on its e-commerce site and social media accounts… but also in its newsletters.<\/p>\n\n\n\n<p>NL screenshot (excerpt from the case study, pretty mediocre quality…):<\/p>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<div style=\"height:20px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<p>The newsletter campaigns featuring user-generated videos outperformed the classic campaigns. Analyzing the performance of the campaigns showed that the videos were the hot zones that got the most clicks in the email. By enriching the newsletters with videos, conversions jumped from 9% to 16% on the associated product pages.<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"a-bonus-idea-abandoned-cart-emails\"><strong>A bonus idea: abandoned cart emails <\/strong><\/h2>\n\n\n\n<p id=\"chap7\">What’s true for newsletters is also true for other forms of emails – editorial, educational and\/or promotional. We’re thinking of abandoned cart follow-up emails in particular.<\/p>\n\n\n\n<p>Online retailers know that they lose a lot of money through shopping cart abandonment. There is a way to reduce cart abandonment and increase the sales generated by your online store: abandoned cart emails. If you’re looking to <strong>improve your cart abandonment follow-up scenarios<\/strong> and\/or increase the use cases for your user-generated videos, that’s a new idea to consider!<\/p>\n\n\n\n<p>As you can see from all these examples, your user-generated videos can be used in many different ways. You now know how to turn your user-generated videos into a <strong>powerful marketing tool<\/strong>. Give it a go!<\/p>\n\n\n\n<div style=\"height:35px\" aria-hidden=\"true\" class=\"wp-block-spacer\"><\/div>\n\n\n\n<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-cb2d0916-f405-47e9-bb18-4064b993938a\"><span class=\"hs-cta-node hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\" id=\"hs-cta-cb2d0916-f405-47e9-bb18-4064b993938a\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"><\/div><![endif]--><a href=\"https:\/\/cta-redirect.hubspot.com\/cta\/redirect\/20304540\/cb2d0916-f405-47e9-bb18-4064b993938a\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" loading=\"lazy\" class=\"hs-cta-img\" id=\"hs-cta-img-cb2d0916-f405-47e9-bb18-4064b993938a\" style=\"border-width:0px;\" height=\"159\" width=\"700\" src=\"https:\/\/skeepers.io\/app\/uploads\/2022\/10\/cb2d0916-f405-47e9-bb18-4064b993938a.png\" alt=\"Discover our Solutions: Book your Demo\"><\/a><\/span><script charset=\"utf-8\" src=\"https:\/\/js.hscta.net\/cta\/current.js\"><\/script><script type=\"text\/javascript\"> hbspt.cta.load(20304540, 'cb2d0916-f405-47e9-bb18-4064b993938a', {\"useNewLoader\":\"true\",\"region\":\"na1\"}); <\/script><\/span><!-- end HubSpot Call-to-Action Code -->\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re reading this article, you’re already sold on user-generated videos and their potential for marketing. At least we hope so! Now, you’re looking for use cases and the best ways to leverage the videos made by your users and customers. E-commerce product pages, social media, newsletters… In this article, we look at some ideas&#8230;<\/p>\n","protected":false},"author":5,"featured_media":28542,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[100,148,2],"tags":[],"post_folder":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.6 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to use user-generated videos to talk about your brand? - Skeepers<\/title>\n<meta name=\"description\" content=\"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to use user-generated videos to talk about your brand? - Skeepers\" \/>\n<meta property=\"og:description\" content=\"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/\" \/>\n<meta property=\"og:site_name\" content=\"Skeepers\" \/>\n<meta property=\"article:published_time\" content=\"2021-09-09T06:16:58+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-11-09T16:04:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/skeepers.io\/app\/uploads\/2021\/09\/AdobeStock_351022318-scaled.jpeg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1687\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Marine Aubagna\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Marine Aubagna\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/\",\"url\":\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/\",\"name\":\"How to use user-generated videos to talk about your brand? - Skeepers\",\"isPartOf\":{\"@id\":\"https:\/\/skeepers.io\/en\/#website\"},\"datePublished\":\"2021-09-09T06:16:58+00:00\",\"dateModified\":\"2023-11-09T16:04:45+00:00\",\"author\":{\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\"},\"description\":\"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.\",\"breadcrumb\":{\"@id\":\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/skeepers.io\/en\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How to use user-generated videos to talk about your brand?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/skeepers.io\/en\/#website\",\"url\":\"https:\/\/skeepers.io\/en\/\",\"name\":\"Skeepers\",\"description\":\"It is time to get real about your UGC\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/skeepers.io\/en\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d\",\"name\":\"Marine Aubagna\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g\",\"caption\":\"Marine Aubagna\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to use user-generated videos to talk about your brand? - Skeepers","description":"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/","og_locale":"en_US","og_type":"article","og_title":"How to use user-generated videos to talk about your brand? - Skeepers","og_description":"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.","og_url":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/","og_site_name":"Skeepers","article_published_time":"2021-09-09T06:16:58+00:00","article_modified_time":"2023-11-09T16:04:45+00:00","og_image":[{"width":2560,"height":1687,"url":"https:\/\/skeepers.io\/app\/uploads\/2021\/09\/AdobeStock_351022318-scaled.jpeg","type":"image\/jpeg"}],"author":"Marine Aubagna","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Marine Aubagna","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/","url":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/","name":"How to use user-generated videos to talk about your brand? - Skeepers","isPartOf":{"@id":"https:\/\/skeepers.io\/en\/#website"},"datePublished":"2021-09-09T06:16:58+00:00","dateModified":"2023-11-09T16:04:45+00:00","author":{"@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d"},"description":"Your customers are your best ambassadors to reach your objectives and today the video format is the most relevant. Focus.","breadcrumb":{"@id":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/skeepers.io\/en\/blog\/where-and-how-to-use-user-generated-videos\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/skeepers.io\/en\/"},{"@type":"ListItem","position":2,"name":"How to use user-generated videos to talk about your brand?"}]},{"@type":"WebSite","@id":"https:\/\/skeepers.io\/en\/#website","url":"https:\/\/skeepers.io\/en\/","name":"Skeepers","description":"It is time to get real about your UGC","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/skeepers.io\/en\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/c3d2ad042fc7d2f93d1bb71e75855d5d","name":"Marine Aubagna","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/skeepers.io\/en\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67353bb96e19469d037b724835391b9b?s=96&d=mm&r=g","caption":"Marine Aubagna"}}]}},"_links":{"self":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16231"}],"collection":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/comments?post=16231"}],"version-history":[{"count":10,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16231\/revisions"}],"predecessor-version":[{"id":137149,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/posts\/16231\/revisions\/137149"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media\/28542"}],"wp:attachment":[{"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/media?parent=16231"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/categories?post=16231"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/tags?post=16231"},{"taxonomy":"post_folder","embeddable":true,"href":"https:\/\/skeepers.io\/en\/wp-json\/wp\/v2\/post_folder?post=16231"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}